{
  "time": 1658148364140,
  "blocks": [
    {
      "id": "nRFbbTLm-1",
      "type": "header",
      "data": {
        "text": "Best Saddle for Bicycle Touring",
        "level": 1
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "N5Q2qvyDuj",
      "type": "paragraph",
      "data": {
        "text": "<i>Are you planning a long-distance bike touring adventure and wondering how comfortable your butt will be on the seat? We'll discuss the globally accepted touring saddles.</i><br>"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "center"
        }
      }
    },
    {
      "id": "8IScb0Sr5V",
      "type": "image",
      "data": {
        "file": {
          "url": "/images/gear/saddle/1652553736_image.jpg",
          "name": "1652553736_image.jpg",
          "size": 401757,
          "extension": "jpg"
        },
        "caption": "",
        "withBorder": false,
        "stretched": false,
        "withBackground": false
      }
    },
    {
      "id": "a57l5t5zYm",
      "type": "paragraph",
      "data": {
        "text": "One major worry that a lot of new cyclists have prior to leaving on their&nbsp;first bicycle touring adventure&nbsp;has to do with how comfortable their butt will be on the seat."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "JDawUrYB6_",
      "type": "paragraph",
      "data": {
        "text": "Although this issue is typically mentioned by riders of upright or diamond frame bikes there are also seat issues that face recumbent riders. This web page will discuss&nbsp;saddles for upright riders."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "1pH0Cx84fD",
      "type": "header",
      "data": {
        "text": "Upright saddles for comfortable riding",
        "level": 2
      }
    },
    {
      "id": "4Vv-r657bM",
      "type": "paragraph",
      "data": {
        "text": "There are many, many different types of bicycle seats available and when all is said and done the way a saddle feels for you personally should play the biggest role in deciding the type of saddle that’s best for you. There is no one saddle that’s clearly the only possible saddle to use. That said, there is one type of saddle that is the clear winner:"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "CSzFXJBfJb",
      "type": "image",
      "data": {
        "file": {
          "url": "/images/gear/saddle/1652553931_image.jpg",
          "name": "1652553931_image.jpg",
          "size": 334828,
          "extension": "jpg"
        },
        "caption": "Just kidding! This is just an example of a noseless saddle.",
        "withBorder": false,
        "stretched": false,
        "withBackground": false
      }
    },
    {
      "id": "j2ivp3oq8A",
      "type": "paragraph",
      "data": {
        "text": "The various saddles out there range from saddles like the one shown in the photo with no nose, ergonomic saddles that feature areas of softer sponge or cut-out holes and the traditional narrow racing saddles that often come with most bikes when they are new. Some saddles also use gel to help cushion the rider."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "Ze5CsGUqgD",
      "type": "header",
      "data": {
        "text": "Brooks Leather Saddles for Bicycle Touring",
        "level": 2
      }
    },
    {
      "id": "_2iV_AaX_s",
      "type": "paragraph",
      "data": {
        "text": "I tried many of these saddles and while some worked for short to medium distances (10 - 50 km)<b> I always discovered&nbsp;pain or numbness&nbsp;once I reached the longer distances that I would typically do during an average touring day (100 - 180 km).</b>"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "WNYnPzeCoR",
      "type": "paragraph",
      "data": {
        "text": "One saddle that seems to be used by many upright touring cyclists is the Brook’s brand of saddles. During my tours, I have met approximately 43 upright touring cyclists. <b>The vast majority of these cyclists (32) have been using Brook’s saddles.</b>"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "ESMC0W50h5",
      "type": "paragraph",
      "data": {
        "text": "The most common Brook’s saddle seems to be the B-17 with the Champion Flyer coming in second."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "zIsvBkkkHx",
      "type": "paragraph",
      "data": {
        "text": "I use a Brook’s Champion Flyer saddle for my touring bike. This saddle is a leather saddle that rests suspended on some large springs. During the winter I often move the saddle to my Icebike."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "gteKSZdW_g",
      "type": "paragraph",
      "data": {
        "text": "<b>The leather saddle gradually changes to closely match the shape of your butt.&nbsp;After a short period of time, small dimples appear in the rear area of the seat as your “sit bones” gradually reshape the leather.</b>"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "jXDhZ-7LiS",
      "type": "paragraph",
      "data": {
        "text": "For some people the break-in period can be as little as the time it takes to hop on the bike and try the saddle out. For others, it can take up to 300 km of riding before the seat feels great. For some people, the saddle never works out."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "Zec9h2VRSJ",
      "type": "paragraph",
      "data": {
        "text": "To assist with the break-in period and as normal maintenance, I use a product called Proofide. This wax-like product is a leather treatment to replenish the oils in the leather that dry out over time. It also helps to protect the saddle from water while assisting with the reshaping of the saddle by preventing you from needing to work with dry leather."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "S2DoyAYnCu",
      "type": "paragraph",
      "data": {
        "text": "Proofide has a milder waterproofing function than some other products (Mink Oil, SnoSeal, etc). The serious waterproofing leather treatments clog the pores of the leather. On a saddle you want the leather to breathe and absorb your sweat. A saddle treated with something like Mink Oil would be hotter and more slippery with sweat on a hot day. While Proofide helps protect the saddle from the water I try to steer people away from thinking that waterproofing is a primary goal. A waterproofed saddle will not be as comfortable."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "AzMNopx5_x",
      "type": "paragraph",
      "data": {
        "text": "A small wrench is available that makes the re-tensioning of the saddle a much easier process than using typical tools. Saddle re-tensioning is something that is performed rarely and on the order of a quarter turn once a year."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "ijXineQ3W5",
      "type": "paragraph",
      "data": {
        "text": "Many people when confronted with the idea of a leather saddle are understandably sceptical. Their concerns become even more heightened when they invariably press their finger against the saddle and discover that their fingers bend before the saddle does."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "eXfZOkbWxW",
      "type": "paragraph",
      "data": {
        "text": "The secret to these saddles lies in the fact that your sit bones end up bearing your weight rather than the soft and more tender areas that are located between the sit bones."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "E9lLgPMsva",
      "type": "image",
      "data": {
        "file": {
          "url": "/images/gear/saddle/touringsaddle.jpg",
          "name": "touringsaddle.jpg",
          "size": 437706,
          "extension": "jpg"
        },
        "caption": "A picture of a Brooks Champion Flyer leather saddle.",
        "withBorder": false,
        "stretched": false,
        "withBackground": false
      }
    },
    {
      "id": "jK_jcSWUtt",
      "type": "paragraph",
      "data": {
        "text": "To help prevent water damage to the leather I carry a helmet or <b>saddle cover</b> along with me whenever I am riding a bike with a Brooks saddle on board and there is a possibility of rain."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "RB9wazptfu",
      "type": "header",
      "data": {
        "text": "Does a wider saddle equal a better ride on a touring bicycle?",
        "level": 2
      }
    },
    {
      "id": "447wWOnm9F",
      "type": "paragraph",
      "data": {
        "text": "Before touring around Lake Superior I upsized my saddle from the&nbsp;Brook’s B17&nbsp;and&nbsp;Brook’s B17 Champion Flyer’s&nbsp;I’ve used on previous tours to a&nbsp;Brook’s B67&nbsp;saddle. This saddle is approximately 29% wider than the Brook’s B17 saddles."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "78HcB2I6eh",
      "type": "paragraph",
      "data": {
        "text": "I chose this saddle because I tend to like looking around when bicycle touring. I enjoy seeing the scenery so my bike position tends to be very upright. As a result, <b>I have found that the narrower Brook’s B17 saddles became a bit painful unless I carefully managed my seat position.</b>"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "NCoVfZ7QBO",
      "type": "paragraph",
      "data": {
        "text": "With the Brook’s B67 I could safely sit completely upright and not worry about my seating position as much. This led me to a much more comfortable ride and the absence of the need for Bag Balm or other similar items. One thing to pay attention to when trying a wider saddle is to make sure that you aren’t experiencing rubbing at the insides of your thighs. This wasn’t a problem with this saddle for me due to the way that it is shaped in this area."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "Y2U4OK0oxv",
      "type": "paragraph",
      "data": {
        "text": "For me using seating position as a major criterion made a difference when it came to having a comfortable tour. My suggestion to you is to&nbsp;consider a wider than usual saddle for upright positions&nbsp;and a more traditional saddle if you expect to be riding in the drops on a persistent basis."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "IpUQ1Tx3AJ",
      "type": "paragraph",
      "data": {
        "text": "<b>The biggest relief for me was the release from butt pain during a bicycle tour. If you enjoy taking in the scenery from an upright seating position then I encourage you to consider a wider saddle like the Brook’s B67.</b>"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "n6kF1a0uzs",
      "type": "header",
      "data": {
        "text": "Brooks Cambium Saddles for Bicycle Touring",
        "level": 2
      }
    },
    {
      "id": "BZ6rjU9STU",
      "type": "image",
      "data": {
        "file": {
          "url": "/images/gear/saddle/1652553812_image.jpg",
          "name": "1652553812_image.jpg",
          "size": 214491,
          "extension": "jpg"
        },
        "caption": "",
        "withBorder": false,
        "stretched": false,
        "withBackground": false
      }
    },
    {
      "id": "zkqexXgsA-",
      "type": "paragraph",
      "data": {
        "text": "When this article was initially posted, there was no such thing as a \"vulcanized natural rubber saddle\". A couple of years ago I purchased a Brooks Cambium C19 saddle for touring.&nbsp;"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "9lSKmxQsz4",
      "type": "paragraph",
      "data": {
        "text": "After extensive testing on various terrain and weather conditions, I can safely say that it's 20% - 30% less comfortable than the leather version."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "tpa6-CZrdZ",
      "type": "paragraph",
      "data": {
        "text": "But I will continue to use this saddle because thanks to it I no longer wake up in the middle of the night, screaming <b>\"I forgot to cover the saddle!\"</b>"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "hBceqDF__i",
      "type": "paragraph",
      "data": {
        "text": "Yes, leaving the leather saddle under the rain for the whole night is bad, but rubber saddles don't mind it."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "urm0QzZqVZ",
      "type": "internal",
      "data": {
        "text": "gear/interactive-list-of-bike-touring-gear"
      }
    }
  ],
  "version": "2.23.2"
}