{"time":1659604240281,"version":"2.23.2","blocks":[{"id":"id_618754","type":"header","data":{"text":"Are All Bicycle Travellers Tech Nomads?","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_528091","type":"paragraph","data":{"text":"<i>Wishing that those who have posted their wonderful travels would explain how they finance it....are they tech nomads ?</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_47198","type":"delimiter","data":{}},{"id":"id_816884","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I used work for nine months in a bike shop by day save really hard and then travel for three months a year by bike .I would back in to the airport I had left nine Months earlier and then travel for about 3000 km to another airport in the world fly home work nine months and then back to the next airport and so on eventually making it right round the world</div>","author":"Mark Hepworth","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_314296","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Mark Hepworth\"> how much u spend travel for 3 months by bike?</span></div>","author":"Iman Imanee","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_500172","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Saving, basically!</div>","author":"Matt Kemp","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_23735","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I work three months ( June July and August)a year and take nine months (Sept to May)off to bike tour.  Done that forty years since 1982.</div>","author":"Gary Palmer","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_271070","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Gary Palmer\"> 👍👍👍</span></div>","author":"Daniela Šuligoj","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_403605","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"<span class = \" ce-fbcomment-quote\"=\"\">\"&gt;Daniela Šuligoj I ride a Raliegh 27 speed FAT bike.</span></div><div class=\"comment_attachment\"><div class=\"comment_photo_attachment\"><img class=\"comment_photo_image\" loading=\"lazy\" src=\"/images/community/are-all-bicycle-travellers-tech-nomads/image_1659604240_2974183304.jpg\" alt=\"\"></div></div>","author":"Gary Palmer","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_870952","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Gary Palmer\"> Awesome!</span></div>","author":"Noreen May Light","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_98073","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Gary Palmer\"> You must have a great job. Most people wouldn't be able to that. What sort of work do you do and do you travel internationally or just in your home country?</span></div>","author":"Andrea Collisson","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_284783","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Andrea Collisson\"> Actually I retired 5 years ago. But still travel 9 months a year. I was a cook. \nI think at today's wages \"anyone\" could do what I do. If you work 3 months and save, yes you can. My last job paid just $8.50 an hour and I only spent rent and food money the 3 months I worked. I saved $2500 to live on for 9 months, which gave me $277 a month for mainly food and minor bike repair.\nAnd I travel in N. America. I've been as far north as the Yukon River north of Fairbanks AK, as far NE as New Hampshire, SE  to Mississippi and SW  to San Diego.</span></div>","author":"Gary Palmer","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_991629","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Gary Palmer\"> So you really do live on a tight budget. When you work your job for $8..50 an hour, and saving is that because you are not paying much in rent and utilities? How do you do that? Do you have your house already paid for? Probably not i guess but your living costs seem to be extremely low \nI think in my life and being older, i dont enjoy living on such an extremely low budget and travelling on that amount is really quite difficult too. Its just not something i can do without getting depressed. But i also dont think even this is an option for many people around the world. In Australia low wages are better than in the US, but you'd have to free camp everywhere and i dont think living on so little money is good quality living in Austrlaia. It would be a very hard life I think.</span></div>","author":"Andrea Collisson","gender":"FEMALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_513026","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I trained myself how to live on less. And no I did not own my home, I rented. My last job was in a tourist town called Jackson in Wyoming.  My rent was $450 a month. Working as a cook I could eat at work 2 meals a day, 5 days a week on a 8 hour daily shift.  The other two days a week I spent hiking and biking around the area.\nI began living the way I do when I was 21, a year out of the military in 1977. I began traveling by hitchhiking and backpacking. I took to bikepacking or touring as it was called in the 80s and 90s in 1982. My first tour was 2100 miles in 19 days, I was 26. My second tour was 7000 miles and I took 9 months to do it from Wyoming to New York, to Arkansas  to Arizona and back to Wyoming.  I stopped halfway in Arkansas to work the winter.\nAfter that I began working June to August then bike toured to get to national parks and wilderness areas to backpack. I basically lived in Wyoming,  Utah and Arizona most of the 9 months I traveled.\nYou say you couldn't live as cheaply as I do! Most could not with mortgages or monthly rent, auto payments and upkeep, families to raise, and all the self acquired debts to pay.\nI never learned to drive, only paid rent 3 months a year, never married, and never got into debt.\nThe most expensive thing I ever bought was the $1250 bike I now have, I live on just food and eat oatmeal, crackers, cheese and salami and pasta for breakfast, lunch and dinner when touring. \nDuring the 3 months I don't travel I live in an apartment almost given to me by being a military veteran, via a program called HUD Vash. I pay just $226 a month on a $1445 a month place. The\n$277 a month I lived on was plenty to me. \nIn the USA  we have a store called Dollar Tree. Nothing costs more than $1.25 and I can buy enough oatmeal, crackers, cheese, salami and pasta to eat on for 4 weeks easy on $50 a week. And it's the same major brands of food a the major grocery stores.</div>","author":"Gary Palmer","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_524186","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Andrea Collisson\"> And I do free camp \" everywhere \" I don't pay to camp. Even when I go to a national park I only spend the daytime in the park, then leave in the early evening to camp outside the park then return in the morning. And I don't pay to enter either, I go in before the manned entrance opens. \nI bathe and wash my clothes where water is available  in natural sources like streams, lakes or ponds. \nI rarely eat out, but cook all my meals.</span></div>","author":"Gary Palmer","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_904777","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Save save save. People keep on asking how do I afford to take a year off at a time to cycle the world, I tell them its not a year off it's two, one year of not going out, spending as little as possible while saving and then the one year on the bike. It takes me about a year to save enough money to spend a year off.</div>","author":"Barry Warner","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_172552","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I work as a freelance tour leader, taking tourists around the world. By doing that around 125 days a year, I can finance the rest of the year, where I mostly travel the world for fun. Since I also travel for work, I basically have next to no expenses back in my native Denmark, making things a bit easier as well. I have been doing this for more than 2 decades and is very happy with that. I am writing these lines from the Azores by the way, where I am taking a group of hikers on a tour this week.</div>","author":"Claus Andersen","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_288379","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Claus Andersen\"> how does one become a freelance tour leader? Do you just kind of do it? Haha</span></div>","author":"Nelson Incog Nito","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_156748","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I have been traveling most of my time, since I was 19 years old <span class=\"ce-fbcomment-quote\" data-quote=\"Nelson Incog Nito\"> . That is 34 years ago now. So I use my travel experience to convince various companies to hire me to be responsible for their tours. Right now I have more bookings than ever before. It's very much a matter of networking though. I get most of my job from talking to company owners in person, when there is a travel fair, or some trade events in travel &amp; tourism.</span></div>","author":"Claus Andersen","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_604852","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Claus Andersen\"> ahh that’s a life well lived. I’ve been thinking of something like this as a possible means for myself.</span></div>","author":"Nelson Incog Nito","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_67915","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Claus Andersen\"> any thoughts on climate change and global warming and the impact of mass tourism, air transportation… ?</span></div>","author":"Thom Hoo","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_911647","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Working as a chef and renting out my apartment</div>","author":"Thomas Madsen","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_561038","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Hard work, lots of pasta, priorities, sacrifice, positive intentions....</div>","author":"Barry Kwaaitaal","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_223793","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I am in IT field and all we need is a laptop and internet connection to do our day to day job. I usually ride during my off hours and use internet from my mobile hotspot.</div>","author":"Sriram Mutnuri","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_523625","type":"fbcomment","data":{"text":"<div class=\"comment_text\">We are retired and we live aboard our sailboat. We sold our house. We don't eat out much. We don't spend much money on clothes. I cut my husband's hair. I drive the car I bought in 1997. My hair is straight and I pull it into a ponytail - no big expense for coloring, perming, or styling. We spend our money on experiences. We bike tour, cruise on the water,  and enjoy parks wherever we go. If you can make it happen when you're younger - GO!!!\n😊⛵🚲</div>","author":"Noreen May Light","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_353910","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Noreen May Light\"> how are you able to leave your boat for weeks, safely?</span></div>","author":"Arturo Tinio Alindada","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_819249","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Arturo Tinio Alindada\"> We have two boats. A 20' Flicka is safely stored on her trailer in a secure dry storage area in San Carlos, Mexico. ($63/month)\nOur 32' Island Packet stays in her slip on Puget Sound, in Washington State, US, under the watchful eye of our friends and dock neighbors. We also pay someone $50/month to go onboard once a month, run the engine, go through a checklist, and make sure she's okay.</span></div>","author":"Noreen May Light","gender":"FEMALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_999093","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Noreen geeze, you're in my mind. I've been missing my old boat and thinking I want to get back into it, but worried that I will no longer travel on my bike because the boat would take all my time and money. Thanks for your comment</div>","author":"Merlin Clark-mahoney","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_47700","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Merlin Clark-mahoney\"> The boat does take time and money, for sure. We don't have marine refrigeration, so that can't break and cost us an arm and a leg! 😂 We use a little dorm size fridge when we are at a marina, and block ice in the cooler when we are out and about. We don't have a watermaker or lots of fancy upgrades. Our \"big\" boat has a Yanmar 3GM30 motor, which only takes about half a gallon of fuel per hour. So, even on a windless day, it's fairly economical. The \"little\" boat takes even less fuel. Of course, the smaller the boat, the cheaper the moorage in a marina, and less cost for so many other things. We also do most of our own engine and boat maintenance and repair. And make and repair our own canvas. \nWe have more than we need and enough to feel comfortable. We feel incredibly grateful.</span></div>","author":"Noreen May Light","gender":"FEMALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_845411","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I worked 49 years and now I can go anywhere for as long as I want</div>","author":"David O'Donnell","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_668825","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I gave up smoking 11 years ago. I invested the monetary values of every pack of cigarettes into stocks. Now I can go cycling as long as I want.</div>","author":"Ralf Lopian","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_912775","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Savings</div>","author":"Anca Hotnog","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_963357","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Retired ! 😊</div>","author":"Isabelle Delannoy-Scherpereel","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_536572","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Stealing</div>","author":"Tony Mrt","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_472108","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tony Mrt\"> Such a  bad boy!</span></div>","author":"Astrid Böhmer","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_817246","type":"fbcomment","data":{"text":"<div class=\"comment_text\">some of us are retired... but don't wait!</div>","author":"Miko Sloper","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_26814","type":"fbcomment","data":{"text":"<div class=\"comment_text\">It doesnt have to cost much. Spent around £120 this week, mostly on eating out plus, a few camp fees. Covered almost 1000km</div>","author":"Michael Richards","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_958168","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Retirement. Living the dream</div>","author":"Daljit Singh Sidhu","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_420335","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Depends where you travel to, you can work a winter job for 4 months, cycle for 8 months, and have enough to even save (a little or a lot) depending on your job. It's pretty cheap once you have the bike and equipment. Your only expense is food if you're really on a tight budget. SE Asia you'll need to pay for hostels or hotels becuase wild camping is nearly impossible but it's $5-10 max a night and street food is $1-2 a meal so easier and cheaper than groceries. Many budget $10 a day. $20 is more of a worry free (if you mostly wild camp anywhere in the world) and don't need to worry about packing a kitchen unless you like cleaning up ever night or you plan really remote tours into Patagonia, Pamir, etc. \n\nOn the $20 a day, that's less than $5000 for 8 months not including flights. Where I used to call home in Boulder, Colorado, average 1 bedroom apartment is over $2000 a month now before food, utilities, insurance gas, car payments etc.  In two months at home I would spend way more than I do in 8 months on the road, be miserable, depressed, and stressed about finances, healthcare, etc. \n\nBeen on the road for 5 yrs working winters in Japan earning almost 3 times what I did in Colorado so I actually save more than I did when I had a small business, a nonprofit for economically challenged families, and a 3rd part-time winter job to help out when times were hard (which was the case for 10 years before I quit it all and hit the road at 37.</div>","author":"Adir Sharon","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_992864","type":"fbcomment","data":{"text":"<div class=\"comment_text\">We saved some money and quit our jobs and gave up our apartment, cycled for 7 months. Costed us about 6000 euros, for 2 persons.</div>","author":"Julia Eekels","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_387409","type":"fbcomment","data":{"text":"<div class=\"comment_text\">The price of travelling by bike is less than my everyday life at work. You only spend on food and sometimes on campgrounds. With an average of 40$ per day (280$ per week), you have quite a lot! Some travel with 25$ per day...</div>","author":"Juulien Duupont","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_691385","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Saved hard while working for the NHS for 35 years. Now retired and reaping the benefits of being frugal</div>","author":"Sonya Katharine Brannan","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_258010","type":"fbcomment","data":{"text":"<div class=\"comment_text\">It’s more expensive to stay at home than it is to travel these days 😂</div>","author":"Nelson Incog Nito","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_571395","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I save a bit every month at the same time I  do things to save money - don't eat out much when travelling and cook when touring and mostly camp, I want to try Warmshowers in the future, I've accumulated my equipment over time taking advantage of special offers etc, I generally don't go at peak times of the year.</div>","author":"Emma Sealy","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_234811","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Stealth camp. Cook your own food. Not very expensive</div>","author":"Clay Pardue","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_127476","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Good question, great answers!</div>","author":"Winnie Bosman","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_785396","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Worked for 26 years 24/7/366 and saved</div>","author":"Elie BD","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_815532","type":"fbcomment","data":{"text":"<div class=\"comment_text\">You need time not so much money to cycle</div>","author":"Phil Flatley","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_818012","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Phil Flatley\"> If you are credit card touring,staying in hotels etc. you would need money for that</span></div>","author":"Roman Mentor","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_146078","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Time is just something that you take <span class=\"ce-fbcomment-quote\" data-quote=\"Phil Flatley\"> . stay away from horrors in life, such as mortgage, marriage and children and time is no problem 🙂 .</span></div>","author":"Claus Andersen","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_250817","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I'm saving for 9 months for a 3 month trip</div>","author":"غويلب محمد رضا","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_208630","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I'm currently switching to a remote job from my caregiver job.</div>","author":"Clair Numberi","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_78530","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I just rode across the US in just under three months. Stayed in hotels and motels. It was very expensive, by my standards. But I’m 62 and retired, and have dreamed of this ride since I was 16. I started budgeting for it about three years ago. I worried at times about how much I was spending, but my wife would assure me (by phone) that we were prepared for the cost and I should just enjoy my dream — and all the years of work and planning I put into it to make it a reality we could afford. She was right.</div>","author":"Richard Core","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_443811","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Probably a handful are but the majority of people save up. My first indian tour took two years of saving and i did not earn very much at the time. But i managed to tour for six months. this includes buying the gear i could afford though my bike was a   cheap situation.</div>","author":"Andrea Collisson","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_685345","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I think to live like this for such extended periods is really hard core. I know i would find it soul destroying rather than liberating.</div>","author":"Andrea Collisson","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_961240","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Tech consultant with no kids and very modest lifestyle at home.</div>","author":"Rhandom Scheuer","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_192657","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Seasonal summer job is enough \nI did it for 45 years</div>","author":"Larry Morgan","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_679823","type":"fbcomment","data":{"text":"<div class=\"comment_text\">retired 🙂</div>","author":"Susan Kopczynski Jostrom","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_779556","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I have bad brain Chemicals so I was put on a person payment since young...  Without it I couldn't do...  It's about half a small wages of a normal job but I don't complain. Main thing for me is a good bike..  Then it's just small stuff after</div>","author":"William Sloth","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_461648","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Save and clearance and determination. Not easy just necessary.</div>","author":"Patricia Roth","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_574235","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Work &amp; save. Then there is a learning curve how to bring expenses at the lowest keeping comfort.</div>","author":"Jo En Pausa","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_706676","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Homeless. Bike packing is great</div>","author":"Ross England","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_879608","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I've pruned my daily costs for the month I'm on the road down to an average of about 10 to £20 for accommodation (campsites and cheap hostels/hotels, probably a bit less for food. My budget for the month is about a grand, including the flight to get me home. This trip has been planned for some years!</div>","author":"Bill Hammond","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_856733","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Work behind a corporate desk for 30 years, buy a house, bring up A family, buy an apartment, retire at 49, rent out aforementioned properties. Travel for as long as we want without having to worry too much about the budget, within reason!</div>","author":"The Gullivers Travels","gender":"NEUTER","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_407413","type":"fbcomment","data":{"text":"<div class=\"comment_text\">For us the main cost is flights, which from Australia to Europe is significant. We spend very little throughout the year to allow us to pay for those flights. Once we are on the road it's cheaper for us to be touring than it is to be at home, so long as we're wild camping.</div>","author":"Cath Wood","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_634693","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Work, save and travel low budget. ❤</div>","author":"Narda Bodemeijer","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_858767","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Well retirees (financially sound ones) kind of don’t count. As to others, trust me, they’re low rent low budget travel bums and that’s not living no matter how they try to describe it. \n\nIt seems to be a trend in the last several years to be an irresponsible loser. Most of these DBags are screwed after oh say 50. \n\nThis younger live and travel for today crowd are extremely annoying.</div>","author":"Joe Martin","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_551554","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Ski that is spend kids inheritance!</div>","author":"Liz Halpin","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_335986","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Work hard. Save money. Travel cheap. Have a lot of fun. Enjoy the world. 😉</div>","author":"Frank Bug","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_438993","type":"fbcomment","data":{"text":"<div class=\"comment_text\">When you're travelling on bike the only cost you have are food and hostel if you plan to sleep in good bed , otherwise saving money, and as you don't have to pay for gaz, each day's cost could be between 10 and 20 euros for me for example,</div>","author":"Mohamed Sabri","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_600226","type":"fbcomment","data":{"text":"<div class=\"comment_text\">For me it is not really money issue, you can get by with very little money while cycling. I met a guy in Japan who had about €3-4 for a day and he was able to do it. The problem is to get the time I need. As I live from the work of my 2 hands I can't just get a new job after every trip.</div>","author":"Thomas Bicycle","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_894900","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><a href=\"https://www.thelibertybeacon.com/tour-de-france-cyclists-quit-because-their-lungs-are-screwed-up/\" target=\"_blank\" rel=\"nofollow\">https://www.thelibertybeacon.com/tour-de-france-cyclists-quit-because-their-lungs-are-screwed-up/</a></div><div class=\"comment_attachment\"><div class=\"link-tool\"><a class=\"link-tool__content link-tool__content--rendered\" target=\"_blank\" rel=\"nofollow\" href=\"https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.thelibertybeacon.com%2Ftour-de-france-cyclists-quit-because-their-lungs-are-screwed-up%2F&amp;h=AT0aUKK8gKGpqw9qRLSE4uxKtcybhnuDgN7kza43QxgjvGmt6dN6t35HAdD09IA7PYgIw0QysQnk_dskZfuLa-zIsiF8G1JnzieMXHLRLCqJrBNyohThVsMvhQGBuH67tGqCkwJtHMr9dls&amp;s=1\"><div class=\"link-tool__image\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.thelibertybeacon.com/wp-content/uploads/2022/07/TourdeFranceVictorLaFay-min.jpg?fit=620%2C280&amp;ssl=1\" alt=\"\"></div><div class=\"link-tool__title\">Tour de France: Cyclists Quit Because Their ‘Lungs Are Screwed Up’ | The Liberty Beacon</div><span class=\"link-tool__anchor truncate\">thelibertybeacon.com</span></a></div></div>","author":"Jack Fitzsimons","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}