{"time":1655971020059,"version":"2.23.2","blocks":[{"id":"id_636351","type":"header","data":{"text":"Are DiamondBack Bicycles Worth the Money?","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_147528","type":"paragraph","data":{"text":"<i>I am looking to buy a bicycle. I had some cheap bikes and I want a little bit better one. I mostly ride on asphalt or concrete and I don’t need anything hard-core. Does anybody know anything about diamond back bicycles? Their website has them very very very expensive￼. Cheapest $475. Walmart and Amazon sell them for $250. I don’t understand the discrepancy of price. ￼</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_822521","type":"delimiter","data":{}},{"id":"id_52971","type":"fbcomment","data":{"text":"<div class=\"comment_text\">The Walmart bike will have a less of quality componets on it. Big box stores have a little better quality than wally world. bike shops have even better quality . My advice would be to shop second hand bikes, plenty of low use good quality bikes fo affordable rates &gt;</div>","author":"Troy P Mullen","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_885645","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Troy P Mullen\"> I second this advice, but while browsing bikes do beware of overpriced junk. Try and get a used bike that was made after 2019 or so</span></div>","author":"Sam Kersten","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_652107","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Had a Diamond Back Ascent in the mid 90's it was voted mtb bike of the year and was a quality bike, cost me £500 back then. Don't see many about now to be honest, certainly used to be good.</div>","author":"Kevin Chessman","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_535935","type":"fbcomment","data":{"text":"<div class=\"comment_text\">anything under $500 will be heavy with average components&gt;\nspend at least that amount or more\n\ndiscount stores always sell at discount prices  :-)</div>","author":"Richard Reitman","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_602432","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Buy at a bike shop where labor is included the first year and learn everything that you can from them about how to service it yourself. A quality bike plus service by professionals will keep you in better shape.  It's like the old adage about quality shoes costing less in the long run than replacing cheap ones repeatedly.</div>","author":"Megan Guerra","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_163218","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Do not buy a store bike. You will get a better bike aftermarket for that 500 price point. Look on Fb market place or Craigslist</div>","author":"Erik Pipins","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_653544","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Here's a website that sells leftover stock. You might find something here. <a href=\"http://www.bikesdirect.com/?gclid=CjwKCAjwrfCRBhAXEiwAnkmKmccWdTVx0tWL0GN-SDXSa4t_PJY2JmGubNjRX5hZRA5x4f79vNbQEBoCPxAQAvD_BwE\" target=\"_blank\" rel=\"nofollow\">http://www.bikesdirect.com/?gclid=CjwKCAjwrfCRBhAXEiwAnkmKmccWdTVx0tWL0GN-SDXSa4t_PJY2JmGubNjRX5hZRA5x4f79vNbQEBoCPxAQAvD_BwE</a></div><div class=\"comment_attachment\"><div class=\"link-tool\"><a class=\"link-tool__content link-tool__content--rendered\" target=\"_blank\" rel=\"nofollow\" href=\"https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.bikesdirect.com%2F%3Fgclid%3DCjwKCAjwrfCRBhAXEiwAnkmKmccWdTVx0tWL0GN-SDXSa4t_PJY2JmGubNjRX5hZRA5x4f79vNbQEBoCPxAQAvD_BwE&amp;h=AT3SOocSx4TO0wew19QJyID3z0sBW9E_FghA0GEtcv3ZICc4klWHzRaNaIMay02Qpvz1GjmnpnfbpPQMigy0JwzhAzf31JO-1JX_J7EfwaNsD0Qd_9ahk7EvgWeUfFb81lhxW90gXZaUAwY&amp;s=1\"><div class=\"link-tool__image\"><img loading=\"lazy\" src=\"http://www.bikesdirect.com/products/gravity/full-suspension-mountain-bikes/fsx29ltd-clrs-5.gif\" alt=\"\"></div><div class=\"link-tool__title\">Save Up To 60% Off Road Bikes, Bicycles, Mountain Bikes and Bicycles with Bikesdirect.com, New with full warranties</div><span class=\"link-tool__anchor truncate\">bikesdirect.com</span></a></div></div>","author":"Troy P Mullen","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_421938","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Troy P Mullen\"> bikesdirect bikes are excellent and are not leftover stock.\nTheir bikes are from the same factories that produces other high end brands...often better quality Taiwanese..not Chinese.</span></div>","author":"Mitchell Paul","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_15899","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Mitchell Paul\"> they use good components. The only caution there would be support. If you're not mechanically inclined, it's not as good of a deal.</span></div>","author":"James Lane","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_942119","type":"fbcomment","data":{"text":"<div class=\"comment_text\">When you buy a bicycle, it consists of 4 main groups;\n1) Frame (40% of TP) - including seat post and forks\n2) Group set (30% of TP) - Crank, cassette, shifters n etc\n3) Wheelset (15% of TP) - front n back wheels\n4) others (15% of TP) - racks, saddle, tyres n etc\nTP = total price. Percentage applicable to Touring Bike only\nFor serious touring, we recommend a chromoly steel frame, a Shimano Deore or better gearing set and a 36 spokes wheelset.\nDon't go by the brand name, as they do both high and low end.\nI m using a Surly Long Haul Trucker with sram X9 groupset and a 26'' wheels with 36 spokes.\nHope it helps</div>","author":"Wan Sabri","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_297658","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I suggest you break down type/style/material/groups/options rather than brands.\n\n1: Type of bike. Posting on this site I assume a touring bike? Correct?\n\n2: Frame material. For durability, options and value I believe you can’t go past steel.\n\n3: Riding position/handlebars. Flat, drop, butterfly. This leads onto shifters.\n\n4: Groupsets. Most common and spares / repairs easily sourced you can’t go past Shimano. I would definitely steer away from department store Shimano levels. I believe 105 is the best bang for your buck but you can go down to Sora or even Claris without major dramas. Don’t go lower.\n\n5: Brakes. Rim or hydraulic. Quite a divisive subject. Both have pros and cons.\n\n6: Options. Mainly racks and lights. Easier and more cost effective to get with the purchase. Everything will fit. Adding later, you can customise to suit.\n\n7: Wheel size and width. Depending where you plan to travel and type of conditions will help you decide.\n\nConsider what you plan to do, how and where you will ride. This will help to answer each criteria.\n\nThis will narrow down and focus on one or two bikes in each brand. You can then shop around new or pre-loved.\n\nA lot to consider and digest but worthwhile. Ask questions. Good luck and happy riding.</div>","author":"Scott Thompson","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_731077","type":"fbcomment","data":{"text":"<div class=\"comment_text\">4: Groupsets. My original post only included road groups. For mtb groups I believe XT is best bang for your buck. Deore and Alivio are good, even down to Tourney but don’t go lower.</div>","author":"Scott Thompson","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_329338","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Hi, Lisa- the difference between a wal-mart bike and a bike store bike will likely be the quality of the components (brakes, crank, handlebars, gears...) and the quality of the workmanship-- A wal-mart bike will be comparably easy to break and difficult to fix, but a high-end bike might have design features in the components that will help you adjust them more easily; sometimes with your bare hands.  If the crank (two front gears and arms where pedals attach) on a wal-mart bike looks like 500 of them were stamped out in an hour in a factory, it's probably because 500 of them were stamped out in an hour in a factory vs. being inspected and filed and re-checked by a human being.</div>","author":"Kimberly Hunt","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_826751","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Kimberly Hunt\"> a lot of the crank arms are now made out of plastic!....snap crackle POP!</span></div>","author":"Sam A. Ballard Jr","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_264867","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Sam A. Ballard Jr\"> my kids Magna's had plastic bottom bracket and hub bearing cups...</span></div>","author":"James Lane","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_664575","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Sam A. Ballard Jr\"> not sure where you are seeing all this plastic. I have never seen one at any Walmart. As far as there being 500 cranks looking the same, does anyone believe that the more expensive bikes are using one-off parts?</span></div>","author":"John Lasne","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_644338","type":"fbcomment","data":{"text":"<div class=\"comment_text\">The diamondback bike you seen at Walmart and Amazon won’t even be listed on the diamondback website. Those bikes are for the budget minded and through some licensing agreement was able to slap that name on their bikes. Parts will be of cheaper quality. Like what others have said try used market.</div>","author":"John Lum","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_388013","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Most department store bikes will never be ridden more than 150 mi in their entire lifespan, the components &amp; manufacturing qualities reflect that.\nA good bicycle is a good thing, visit some of your local better bike shops to get an idea of what you may want. They will often have used stock available, or you can start shopping the secondary market once you know what you are looking for..</div>","author":"Jim Ford","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_916898","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jim Ford\"> correct. My kids got WalMart bikes from their well intentioned grand father. Everyday was a new issue. I found an old GT and a Raleigh on craigslist. A quick tuneup with new cables and they have been trouble free</span></div>","author":"James Lane","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_110287","type":"fbcomment","data":{"text":"<div class=\"comment_text\">How much are you intending to spend, upper limit?</div>","author":"Peter Lownie","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_945363","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Most of the answers here seem to be from men and the sort of men who really get a buzz out if the details of the technology. You don't need to approach it like that. Spend what you can afford. Buy from a local shop of you have one near you, rather than online. You might get a bargain online, sure, but to do that you're going to have to learn all the details and technology like these guys. Fine if you're up for that. Or maybe you have a friend who is into all of that, so ask them to buy for you, to get the best bang for your budget. But honestly, they all have wheels and a saddle and pedals, it's not rocket science unless you're planning to compete in the Tour de France on it.</div>","author":"Alan Myler","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_656485","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Alan Myler\"> the advice here isn't to get the latest, great carbon fiber Enduro bike with 7 inches of travel... Most of the comments have simply been buy local to get a quality bike and stay away from department store models as they are lower quality, have no after sale support and parts aren't standardized.</span></div>","author":"James Lane","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_702535","type":"fbcomment","data":{"text":"<div class=\"comment_text\">$475 is not very, very expensive. It is in fact very, very cheap.</div>","author":"Peter South","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_581407","type":"fbcomment","data":{"text":"<div class=\"comment_text\">This is very much, you will get what you pay for. Of course, if you're looking for a top end racer, an extra thousand dollars will only give you negligable (or marginal) gains - probably so little you wouldn't even notice. However, at the opposite end of the market, spending more will give you enormous improvements in quality and performance. If you're planning to become a proper cyclist, then buying a supermarket cheapie, will likely cost you more in the long run, than buying from a reputable bike shop, who should help you decide exactly what you need and get the best value for money, within your financial limits. Very cheap bikes have very cheap components and these will not last long - best to spend more on a bike with decent components, in order to avoid needing replacements, after only a few months.</div>","author":"Norman Saunders","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_789811","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Walmart and Amazon bikes won't stand up to the rigours of bicycle touring. Some of them hardly stand up to light regular use before parts fail, become loose, etc.</div>","author":"David Rowe","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_399099","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Giant, Trek, Scott, etc. \nI say do not buy Walmart or similar because the kid putting it together has no real training.</div>","author":"Rich Meyer","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_226646","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Go vintage. They are better and cost less.</div>","author":"Ricky Streight","gender":"NEUTER","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_222021","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Ricky Streight\"> I've had my bike for 18 years. A record. Only because they usually get stolen. First time I've ever had to replace the whole drivetrain. Now watch...it will get stolen!!! Knock on wood, knock on wood!!! Gah!!!</span></div>","author":"Alan Hunter","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_306276","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Like other have said buy used if your budget is tight. I have a 2012 Specialized Tricross. It was £600 new here in the UK so not as cheap as your Walmart offer but cheap for what is still an excellent and versatile bike. I have more expensive bikes but my Tricross is still my favourite it just rides nice. No idea what one of these would cost now used but have a look on eBay, avoid cantilever brakes ones  ( just more difficult to adjust) and go for rim or disc. Just a suggestion.</div>","author":"Mick Hine","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_870443","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I’m one that wanted comfort  yet the ability to hit bumps on a trail and not feel like I’m using a jack hammer recently got a Marin wildcat 5  road Ribble bikes for years but this year my money had to go for my teeth after tree branch fell whacked me never hearing the end of jokes from my family on that one</div>","author":"Freedom Kinney","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_812433","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Visit your Local Bike Shop first and see what they have to offer ? buy from a decent cycle store and not a supermarket where they sell bikes, {you cannot take back to a supermarket if you get problems} do you know how to work on bikes ~ it will save you a lot of money, if not there are cycle maintenance courses around ... good luck whatever you decide to buy</div>","author":"Danny Simmons","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_804053","type":"fbcomment","data":{"text":"<div class=\"comment_text\">For $500 you can easily find a 10yr old quality road bike, and likely with lots of life left in it.</div>","author":"Richard Kratz","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_12714","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Look for a bicycle coop in your area. They usually have great used bikes or will help you build your own. Great experience</div>","author":"Ron Hall","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_454960","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Ron Hall\"> didn't think of this and I volunteered for one! There are lots of good bikes that come through that may be older but need a tuneup and are ready to go</span></div>","author":"James Lane","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_724377","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Exactly.  Also, if the buyer builds it they learn how to maintain it, and it’s far less expensive than new</div>","author":"Ron Hall","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_308175","type":"fbcomment","data":{"text":"<div class=\"comment_text\">The components on the big box version of their bikes will be very low end or no-name, compared to what you will get on perhaps the very same frame at Wal Mart.   Think of it like different trim levels on a vehicle.  You can go to the dealership and see three different trim models and price points that look visually similar, but will behave and feel very differently.    What Wal Maet sells isn’t even the lowest one.    They’re selling the “fleet vehicle” version that Dodge doesn’t sell to the general public.</div>","author":"Juli Warfel Bitler","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_178697","type":"fbcomment","data":{"text":"<div class=\"comment_text\">And those low end and no-name components are NOT a bargain.   They are designed to break, and a bicycle shop will not be able to repair them.   There is a reason why solid name brand bikes are on the roads for 20+ years and Wal Mart bikes are in a landfill in 5.</div>","author":"Juli Warfel Bitler","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_811963","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Do yourself a favor. Do NOT buy a bike from Walmart. The bike builders are  not bike mechanics. When you buy from a bike shop you also get service. Even a lower end model is built well.</div>","author":"Robin Brodsky","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_941001","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Diamondback is a good brand, they sell across the spectrum from inexpensive to fairly expensive. The Walmart and Amazon cheap bikes are typically junk, just ask any bike mechanic of the frustrations of dealing with these. While you are talking to said bike mechanic, ask him for recommendations.</div>","author":"Marc Pujol","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_299118","type":"fbcomment","data":{"text":"<div class=\"comment_text\">This isn't what you probably want to hear but if your planning to stick with this bike riding thing don't buy from Walmart and for sure don't buy from amazon. You'll probably still need to bring it to a bike shop for adjustment, etc. Far better to get a bike from a shop that will have your back and will offer warranty &amp; repair service. Diamondback was a big name back 30 years. Less so now. You can get a Trek for north of $800. Do yourself a favor.</div>","author":"Rick Hancock","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_449142","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Rick Hancock\"> diamondback does have higher end bike shop models and offer a direct to consumer option as well as the department store and Amazon options.</span></div>","author":"James Lane","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_284439","type":"fbcomment","data":{"text":"<div class=\"comment_text\">James Lane good to know been buying Trek for years.</div>","author":"Rick Hancock","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_120268","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Don't waste your money on a cheap bike that your just going to have to replace or spend more on maintenance than the bike itself.</div>","author":"Gerald Raton","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_785491","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I always recommend buying from a local bike shop unless you really know your stuff. You can have a conversation with them about what it is you're looking for in a bike, the difference between bikes etc (they should be asking you that by default). \n\nYou're also far more likely to find that your bike has been put together by a trained bike mechanic, using the right tools.\n\nSadly, many of those wonderfully cheap bikes end up in landfill because they are not fit for task. \n\nBuying local was also how I ended up being part of my local cycling club and cycling community.</div>","author":"Simon Tomkins","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_322954","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Go to a bike shop.</div>","author":"Mi Letts","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_677874","type":"fbcomment","data":{"text":"<div class=\"comment_text\">A bike is best bought in person, whether that be used or new from a bike shop. You need it to be fit for purpose and to fit you.  It’s not something I’d ever suggest buying from Walmart or similar or from Amazon.  It’s worth going to a decent bike shop (ask around for recommendations).</div>","author":"Jacquie Gaudet","gender":"UNKNOWN","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_586616","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jacquie Gaudet\"> In addition to what you've said, a sales person at your local bike shop can likely find something for you in your price range that they'd be proud to sell. Good brands make bikes at or very close to the price point OP has given that will be way better than any box store bikes.</span></div>","author":"Noelle Harris Burns","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_965971","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Go talk to someone at a local bike shop.\nFind out what size you need or even get a fitting.\nThen look for a better used name brand bike for that kind of money on Facebook marketplace or Craigslist.\nThey’re out there .</div>","author":"Rick Shaffer","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_304256","type":"fbcomment","data":{"text":"<div class=\"comment_text\">The bike take away here and what most people are offering is that $475 is still considered below entry level, even if it's a high price for a department store bike. These bikes are made to a price point and even the nicer ones suffer from plastic bearing races that need constant adjustment, poor assembly, etc. My experience with Magna's warranty was amazing. I sent them pics of the issues and they promptly sent me parts for my kids'bikes, but didn't cover labor and the labor at the bike shop was nearly the cost of the bike. If you are constrained by a certain price point, used is an option if you're knowledgeable/have a knowledgeable friend and aren't afraid to learn maintenance. If you can stretch the budget a newer bike from a bike shop that will fit you, do a free initial tuneup after purchase and support later. Something like this will hold value, last an eternity and the bike shop will be there for maintenance and warranty issues should they arrive.</div><div class=\"comment_attachment\"><div class=\"comment_photo_attachment\"><img class=\"comment_photo_image\" loading=\"lazy\" src=\"/images/community/are-diamondback-bicycles-worth-the-money/image_1655971019_3443285339.jpg\" alt=\"\"></div></div>","author":"James Lane","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_184416","type":"fbcomment","data":{"text":"<div class=\"comment_text\">In comparison, I bought this bike in 2012 to commute on. It has needed replacement cables and chains, but could probably use a whole group set now after 10 years. The only issue it had to this point was that I kept breaking apokes when I was heavier, so I built some heavier duty wheels made. For someone who's lighter, the wheels last longer and the drivetrains last longer</div><div class=\"comment_attachment\"><div class=\"comment_photo_attachment\"><img class=\"comment_photo_image\" loading=\"lazy\" src=\"/images/community/are-diamondback-bicycles-worth-the-money/image_1655971019_6113143348.jpg\" alt=\"\"></div></div>","author":"James Lane","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_597570","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Familiar brand names have been commodified &amp; sold off. so, there may be little relationship to the company that established the original reputation.</div>","author":"Robert Clark","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_703257","type":"fbcomment","data":{"text":"<div class=\"comment_text\">We have a local rental place that often replaces their entire inventory at end of season.  We picked up a couple decent treks from them when we started our biking careers a few years ago.</div>","author":"Karen Ostrosky","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_211954","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I gotta bike 300$ it’s exactly what you want.</div><div class=\"comment_attachment\"><div class=\"comment_photo_attachment\"><img class=\"comment_photo_image\" loading=\"lazy\" src=\"/images/community/are-diamondback-bicycles-worth-the-money/image_1655971019_7867279113.jpg\" alt=\"\"></div></div>","author":"John Harington","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_877560","type":"fbcomment","data":{"text":"<div class=\"comment_text\">The brand name has almost nothing to do with bike quality since brands span huge price ranges. These days rich bicycle fanatics might buy bikes with the top two shimano groups but normal upper middle class fanatics get bikes with the 105 or Tiagra group. These medium price bikes typically have aluminum frames and carbon forks and are masterpieces of functional elegance. Carbon frames are more expensive. Steel is found on only cheap or very expensive bikes. So called high-ten steel (high tensile) actually isn't high compared to good steel and the bikes are cheap, heavy and found in Walmart. Quality steel bikes are made from steel that's 3 to 7 times higher tension than high-ten steel and are light weight but are as expensive as carbon frames. If you know enough about bikes and their maintenance online purchases can be a decent option. In your case however a bike shop is the best place to go. First you should think about if you want a hybrid, gravel, road style.</div>","author":"Gordo S. Groundchuck","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_1557","type":"fbcomment","data":{"text":"<div class=\"comment_text\">If you're looking to buy a cheap bike look on Craigslist, want ad digest, or swap sites. Every time period is different but we got a really great bike in tip condition for $50. We had to shop a bit and drive far out of town to pick it up but the result was worth it.</div>","author":"Paul Stewart","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_721060","type":"fbcomment","data":{"text":"<div class=\"comment_text\">See Paul Harvey's post in Cycling humour</div>","author":"Sheila Anderson","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_133220","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Can’t go wrong with a Giant hybrid for asphalt and old rail trails converted into bike trails. I’ve had my Giant hybrid for 10 years and it’s still going strong.</div>","author":"Phillips Jamie","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_164011","type":"fbcomment","data":{"text":"<div class=\"comment_text\">You appear to be a shorter woman,( or your hubby is really tall. The proper fit is so important. Go to a good bike shop.</div>","author":"Alan Hunter","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_788330","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I bought diamond back bicycle wholesale about 20 years ago. They were budget brand then, but good for the money. I still have it. It would work if I put the wheels back on it. No parts failed in that time, othere than perishables like tyres. As it came with Kenda tyres, they wore out fast.</div>","author":"Steven Offord","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_285080","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Nine times out of ten I'd purchase a quality used bike over a cheap new one. I have a high-end bike that's almost 40 years old and still works perfectly. It's got that skinny steel tubing, but I like that retro look. It will outlast and out-perform any new bicycle from a big-box store.</div>","author":"David Law","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_540462","type":"fbcomment","data":{"text":"<div class=\"comment_text\">If you don’t have a knowledgeable and experienced friend to help you buy a used bike you are better off buying from a bike shop. Used bikes are selling at high prices now and a lot of them aren’t worth it. You can always factor in the price of replacing the chain and cassette into the price that you’re willing to pay for a used bike.</div>","author":"David Gruberg","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_26867","type":"fbcomment","data":{"text":"<div class=\"comment_text\">This is an easy question to answer and so many great responses for this question. \nYou could buy a good quality used bike but it may need parts and labour, so costs could rise unless you had someone with knowledge with you when you buy a used bike. I would never buy a Walmart bike, Walmart bike is a cheap bike . So your going from cheap to cheap, you are doing a disservice going the same route. You want a good reliable bike that will last , spend the extra money , $475 is nothing and that's to buy a cheaper bike with low end components. make the plunge spend the extra and from a reliable bike store as many have stated . Good luck with your decision.</div>","author":"Todd Abernethy","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_381686","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Diamond back is cheap at any price, so ignore price.  I think your definition of 'cheap' is skewed.  Try a definition of 'cheap' more like (unrelated to price) what percentage of the components are 'throw away' versus 'repairable'.</div>","author":"Mike Dannheim","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_790072","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I think by now you know not to cheap out lol\nSo I am going to say…go to a local bike shop that has many styles and brands. Then let the professionals guide you. And be sure to test ride. \nYou will get good advise and warranty.</div>","author":"Melinda Welborn","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_983783","type":"fbcomment","data":{"text":"<div class=\"comment_text\">You get what you pay for- cheap bikes suck!  Buy a used bike to save a few $$ or up your budget.</div>","author":"Gary Moonan","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}