{"time":1659812539272,"version":"2.23.2","blocks":[{"id":"id_790792","type":"header","data":{"text":"Bicycle Touring at High Altitudes and Preventing Altitude Sickness?","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_458165","type":"paragraph","data":{"text":"<i>Anyone have any tips on how to train for biking at (higher) altitudes, to prevent altitude sickness? We are planning a trip to Nepal and they warn for altitude sickness. We live in Holland, which is as flat as can be. Thanks for the tips 🙏🏻</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_203815","type":"delimiter","data":{}},{"id":"id_43188","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Do you have time to spend a day acclimating when you get there before you start riding?</div>","author":"Greg Rothman","gender":"UNKNOWN","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_780312","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Greg Rothman\"> yes, sort off. But it won’t be on on high altitude (we arrive en depart for the mountains from Kathmandu)</span></div>","author":"Daniel van Dijkman","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_593638","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Sleep as low as possible.  I don't know how high you are going but I started a tour in Chengdu which is low.  The road quickly goes up to 4500m.  I tried to acclimatize by riding without panniers up to 3000m as fast as I could.  Then started on the trip sleeping once at 2000m and then 4000m.  If you can't do that then sleeping around 800m above the previous day I think is recommended.</div>","author":"Peter Hardie","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_741541","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Everyone responds differently to high altitude. Some affected more than others. So please be careful if it's your first time. Ascend slowly. Sleep lower than you climb to. Drink lots of water and if you get a headache descend.</div>","author":"Moinudin Gallotta","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_647421","type":"fbcomment","data":{"text":"<div class=\"comment_text\">You can't really train for it at lower altitudes. You just have to go and see how you feel.</div>","author":"Moinudin Gallotta","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_173390","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Moinudin Gallotta\"> You can’t, but you can be in better shape, which helps immensely.</span></div>","author":"Mark Courtenay","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_95340","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Mark Courtenay\"> read the thread in response to Zack's comment below. It's risky to rely on such training even if it did work, as you can't acclimatise your brain and the fluids surrounding it which are central to high altitude sickness. So you could easily give yourself false confidence that leads you to climb higher than what is safe.</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_624499","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Moinudin Gallotta\"> Your body will let you know, but at least the altitude won’t take as large of a toll. We saw people in Peru that obviously were not in even mediocre shape struggling at 11,000’, and they were positively suffering above 13,000’. We lived at and came from sea level but trained (hiking steep trails) for 6 months prior and think it helped immensely. I only had mild AMS once for a few hours at 14k and it passed with some aspirin. \nI did a lot of researcher beforehand, including lots of great info from this site, and listened to local guides as well as our own bodies. While we were in decent shape, once we hit 10k (flying in) we noticed we had to slow things down to avoid getting winded fast, so we did. We took 2 days beforehand to acclimatize based on the recommendations here and think that helped a lot. \nBut one of the things we also learned is that everyone is different. We since moved to 5,000’ elevation and I find mountain biking over 8,000’ is noticeable, so there are different levels.</span></div>","author":"Mark Courtenay","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_959479","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Mark Courtenay\"> Absolutely everyone is different. I know people who try as they might always suffer at 2-3000'. I barely feel it 15000'. Now that's not to say I don't struggle. I feel the effects on my cardio biking at just 5000', but I have only get altitude sickness symptoms much higher.\n\nWhat I'm trying to say is the medical symptoms you can't prepare your body for at lower altitudes. You can only work on your cardio, and for that there's no evidence to prove that masks work, unless things have changed since I researched the topic 5 years ago.</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_555254","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Moinudin Gallotta\"> when I did research on altitude masks and tents years ago it was inconclusive since it only created a low oxygen atmosphere and not the other conditions (pressures, etc) that accompanies it. Research also showed that unless you were in that state constantly it did little good since your body would adjust back.</span></div>","author":"Mark Courtenay","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_496809","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Wear a mask while your train. They make specific masks for this, (that don’t get soggy when you breathe hard)</div>","author":"Zack Martinez","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_110736","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Zack Martinez\"> No, masks hardly do anything to mitigate altitude sickness. They work on respiration factors while altitude sensitivity is a pulmonary issue.</span></div>","author":"Aaron Crawford","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_36748","type":"fbcomment","data":{"text":"<div class=\"comment_text\">A training mask provides resistance to increase diaphragm and intercostal strength while also increasing CO2 ppm upon rebreathing, leading to a larger inspiration volume.</div>","author":"Zack Martinez","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_3921","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Zack Martinez\"> that's only one minor element in altitude activity. Nothing to do with the ones that cause fatal issues as Aaron says.</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_391951","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Zack Martinez\"> Again, masks involve respiratory factors. But they hardly improve pulmonary function, which is what altitude sensitivity is all about.</span></div>","author":"Aaron Crawford","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_361983","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Aaron Crawford\"> I’m not understanding the distinction you’re drawing between “respiratory” and “pulmonary” here. I’ve always felt they were largely synonymous…\n\nCan you elaborate a bit?</span></div>","author":"Zack Martinez","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_108420","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Zack Martinez\"> Respiratory action is what you described, that is the act of inspiration and expiration when we breathe. Pulmonary action is the actual exchange of gases - primarily O2 and CO2 - while we are breathing.\n\nThis gas exchange isn't mechanical like respiration. Respiration uses our diaphragm muscle to pull air in and our ribcage muscles to push air out. Our pulmonary system is dependent mostly on atmospheric pressure. So, the lower air pressure at high altitudes mitigates the amount of O2 absorbed into our blood stream and the amount of CO2 dispersed out of it. Acclimation at altitude encourages an increase in blood cells to meet the O2 demand. Training masks cannot do that.</span></div>","author":"Aaron Crawford","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_555138","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Stay hydrated</div>","author":"Johnny Wood","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_756604","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Smoking cigarettes seems to help. I read somewhere that the low blood oxygen then stimulates epo production. Some of the early Everest expeditions took tobacco with them.</div>","author":"Raymond Hallam","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_270585","type":"fbcomment","data":{"text":"<div class=\"comment_text\">During Yak Attack race we rode to Manang from Kathmandu on Annapurna circuit then took a rest day to acclimatize before going over Thorang La (17,800 ft).</div>","author":"Carl Gable","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_4174","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Take a heavy backpack and go climb some mountain near your home.</div>","author":"David O'Neill","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_897913","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"David O'Neill\"> there aren’t any in Holland it’s under water as far as I know</span></div>","author":"John Findlay","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_496408","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Just ride, no worries</div>","author":"Keevy Raes","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_489482","type":"fbcomment","data":{"text":"<div class=\"comment_text\">No more alcohol till after the trip, drink lots of water you purify your self, pills or UV light. I’ve never used the masks, they maybe good for altitude pre-acclimatization, most studies show they are not so good for general conditioning. \nI have been able to, while living below sea level, been able to acclimatize to 15,000 feet + by living 100% of my time in a O2 low level with CO2 carefully scrubbed out chemically. (Months at a time on one of the oldest nuclear powered submarines)\nI went in one day from sea level to 17,000 feet+ felt great, could even run. I think if one can use the mask for near 24 hours a day for four weeks prior to your trip.</div>","author":"Dick Blomshield","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_842528","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Dick Blomshield\"> We found in short order drinking alcohol was a big mistake and we waited until the end of our multi-week trip to have a few. Each one felt like we had 3 with some not so pleasant side effects. I am not usually a water drinker but our guide explained that you get oxygen from the water, which makes sense. I found drinking more actually helped and we’d go through 10 liters in a day pretty easily.</span></div>","author":"Mark Courtenay","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_882690","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Mark Courtenay\"> And to share another experience: took a sightseeing flight to 23,000 feet - Mt McKinley. The plane was non-pressurized. I was sitting next the the pilot in the rh seat. I told the pilot I wanted to take off my O2 system and attempt to maintain a conversation. He said “sure”. \nAt this point in my life I had zero acclimatization to altitude. The pilot said I was fine - as near he could tell. But I knew better, I lost my color vision in the first few seconds and when I went back on O2 my vision  registered as wow it just got brighter outside. \nMy son, a USCG pilot, has been tested in altitude chambers and some times he is great, with no effects, but other times he can notice a distinct slowing of reflexes when he see him self on video. His instructors told him, “hard to predict same person can be fine one day and not so good the next. “Drink plenty of water, that does make a difference “.</span></div>","author":"Dick Blomshield","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_90556","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I had to train for firefighting and we would do stair master with 40lb pack then either run or bike sprints. I did that and then went to mountains a few days early and did just fine.\n\nAnd, yes, altitude sickness vs shortness of breath are different but being as fit as possible helps. Viagra may also help - ask your doctor. It was used to treat altitude and respiratory illness, too, with an observed side effect.</div>","author":"Jim Lee","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_313851","type":"fbcomment","data":{"text":"<div class=\"comment_text\">The most effective way to prevent altitude sensitivity issues is to acclimate right beforehand. Can't rush your body's ability to adapt to changes in air pressure going up high altitudes. Other important on site strategies to help include staying hydrated, use meds like Diamox and ibuprofen, and sleep well.\n\nBefore the trip, just make sure you're well conditioned. The better shape one is before the trip, the less taxing and demanding the trip will be on the body. Obviously, of course, but that much more important when the trip is at high altitude.</div>","author":"Aaron Crawford","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_939756","type":"fbcomment","data":{"text":"<div class=\"comment_text\">When we head to the mountains, we allow a couple of days to acclimate and then the first couple of days are easy ones.  Helps my wife with the effects.  (High altitude in this case being anything above 6000 feet).</div>","author":"Chris Halle","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_352796","type":"fbcomment","data":{"text":"<div class=\"comment_text\">When I was trekking to higher altitude, I was advised by a Doctor to start taking Diamox 2-3 days before we started trekking. We also did a few short day hikes in the area to help us get used to the altitude. Don’t rush it, &amp; listen to your body. Don’t do anything beforehand or during the trip that could negatively impact your blood oxygen level, like breathing in exhaust fumes or cooking in your tent (which you should never do anyway!).</div>","author":"Cheryl Leskiw","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_220174","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Takes 48 hours above 4000’ to adapt \nRed blood cells which carry oxygen increases above 4000’ and need 48 hours for that to happen</div>","author":"Charles Nighbor","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_279002","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Charles Nighbor\"> I think you mean red blood cells that carry O2 ....</span></div>","author":"Aaron Crawford","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_736057","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Aaron Crawford\"> yes</span></div>","author":"Charles Nighbor","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_935836","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Plan A. Train hard! Plan B. Acetazolamide, or Diamox, is the standard medical prophylaxis agent for high altitude illness.</div>","author":"Frank Praznik Jr.","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_656860","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Great question. I’ve just looked at Training for the New Alpinism, which has a good chapter on the topic. In short, they are sceptical as to whether there is much you can do at home. There is a useful section on preparing your body to go high, as well as a discussion of acclimatisation strategies and some suggested schedules/plans. Worth taking a look if you can get it - may also be some articles available on line from Steve House or Scott Johnston (the authors), or other high altitude mountaineers. I tried a few sessions at the Altitude Centre in London but did not notice a difference when then going to altitude.</div>","author":"Hugh Robinson","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_895534","type":"fbcomment","data":{"text":"<div class=\"comment_text\">In 2018, Victoria Pendleton, the olympic cycling double gold medalist tried to climb everest. She had to pull out due to altitude sickness.\ni.e. it doesn’t matter how incredible your fitness is at sea level if your body doesn’t have the physiology for altitude.</div>","author":"Andrew Paul","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_757436","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I did Annapurna circuit on foot 2019, in my 50s. Was a little overweight and hadn't done any particular physical prep. Had a touch of altitude sickness only on the way down into Mucktinath after crossing Thorong La at 18,000'. Most healthy people adapt fairly well up to a certain altitude. Definitely give yourself time to acclimate and always bike high, sleep low!</div>","author":"J.c. Mcguirk","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_207282","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Ah, I forgot.  One thing I used to do that seemed to help was swimming- particularly some under overs about twice a week.  Swim underwater the length of the pool (25  meters), then without resting swim back in top as fast as you can.  Then rest for a little bit. And repeat.  Do about  10-20 times</div>","author":"Chris Halle","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_493732","type":"fbcomment","data":{"text":"<div class=\"comment_text\">1) It doesn't matter how good your condition is. \n2) Climb high, sleep low\n3) Take extra days to acclimatize at middle elevations.\n4) Diamox should be #1.</div>","author":"Doug Gudfred","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_855273","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Don’t do stupid things.</div>","author":"Gregory P. Harm M.A.","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_216845","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Impossible to “train” against high altitude sickness. Relax 2 days in Kathmandu and climb slowly.</div>","author":"Marcel Besemer","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_93006","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Don’t take Diamox if not necessary. It’s chemical crap and it disguise the symptoms you should take seriously. It’s a medicine, not preparation!</div>","author":"Marcel Besemer","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}