{"time":1659604051416,"version":"2.23.2","blocks":[{"id":"id_727170","type":"header","data":{"text":"Bicycle Touring and Learning the Culture of the Country","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_646850","type":"paragraph","data":{"text":"<i>Please discuss. This is not something that rarely gets thrashed out here enough so let's do it. \n\nWhen i travel, (for between 2 and six months) in a foreign country, i really like to learn about the culture and as i'm an arty farty type, i love to visit museums and the important cultural buildings. Honestly, i'm not good at reading history but can occasionally be lured into it. There's a lot of museums i dont visit and i wish i could afford to partake (hate that word) of more cultural activities when i am in a country. \n\nFood is another big cultural experience i wish i could do more of when in some place. But the limitations on my activities are mainly due to budget constraints. \n\nIt is just not enough to ride through a country and see the landscape and meet the locals. I need more than that, even though some countries, india for instance is extremely rich in the quotidian culture front. \n\nSo engage with this topic any way you like but please list the things that are important to you on a bike tour - like is it just finding the best natural landscapes and features or which cultural activities turn you one? \n\nWhat's your philosophy when it comes to these things and balancing them out. \n\nComments of more than one sentence earn one gold star for effort! :-)</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_237094","type":"delimiter","data":{}},{"id":"id_663913","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Eat. Eat a lot. Develop a learned taste in the countries junk food.</div>","author":"Paula Lilburne","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_374103","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Paula Lilburne\"> yes some countries junk food is really quite healthy compared to what we have in the west. Or perhaps its not really junk food on any level just street food. I'm thinking of india for instance, they dont really have traditional junk food. So street food is not really junk food. \n\nBut maybe you really do mean junk food like American hamburgers in every nationality.</span></div>","author":"Andrea Collisson","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_604033","type":"fbcomment","data":{"text":"<div class=\"comment_text\">For me, the pleasure of cycling through the landscape is the main attraction. Of course, I pay attention to the places through which I travel. I look for the differences and enjoy them, but I don’t dig deeply into every nook and cranny.\nI appreciate that there can be practical difficulties when cycle touring. It’s not comfortable leaving your bike and luggage unattended while you explore a museum or a gallery, and that could inhibit some people from exploring but, I’m not really that interested. That’s not to say that I think you shouldn’t be. It’s wonderful that you love to soak up as much local culture as possible 🙂</div>","author":"Neil Irwin","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_207552","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Neil Irwin\"> generally you leave your gear at your campground or room. Of course some people do wild camp when passing through a city. I did that a little bit in Japan but in big cities where i really want to focus on the culture, i usually take a room or campground and can leave my gear there. Though in paris i did have my bike stolen outside the louvre. Not my gear. I've learnt from that experience though.</span></div>","author":"Andrea Collisson","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_640241","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Interesting topic. I think stopping every few days and not riding for a day or two to explore the area your in makes any tour richer and less hurried. You feel like you absorb more and didn't just hurry through it. Of course, there is the reality of possibly needing to get your route finished by a certain time, always being concerned if your bike and stuff gets stolen etc. I found staying at a hotel every 3 or 4 days allowed a safe place to store your bike and stuff while getting a physical break for a day or two and allows you the freedom to explore and eat lots on foot!</div>","author":"Chris Blacklock","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_96376","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I love the challenge of planning and riding a route whilst also loving the idea that curiosity might take me down a slightly different route. Learning about the landscape, the history and events that shaped the areas I ride is also very enjoyable it adds an extra element to the planning and enriches the ride. It’s not always about museums but more understanding why things are the way they are and appreciating the stories that lie beneath our wheels. I really like visiting cafes, pubs etc and just meeting interesting people and seeing that whilst we all have different perspectives we all have much more common ground than differences. Fundamentally I see the cycling as a challenge and learning process that keeps me mentally stimulated, physically fitish and provides memories that will live with me for the life I have left.</div>","author":"Steve Williams","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_581075","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Steve Williams\"> hear hear!</span></div>","author":"Winnie Bosman","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_154985","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I have not done it yet, but your need looks like a thing for Warmshowers hosts. I have seen a few accounts of WS hosts taking guests on tours of there locale and making recomendations of what to see and do. If you could use WS and spend a couple of days with people, rather than spending the night and leaving next day, I can see a lot of possilities here.</div>","author":"Mark Perry","gender":"UNKNOWN","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_436867","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Mark Perry\"> Not really. I do my own research, travel with a guidebook and so i can figure out myself what to see. However a really generous warm showers host can introduce you to things that you might easily miss if you were on your own. Also they might take you to things ot tell you about places that that might not rate but find out a interesting anyway. With warm showers aren't really guides though sometimes they might want to be. As a guest you really have to go along with whatever the host decides he/she can do even with regard to how long you stay.</span></div>","author":"Andrea Collisson","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_295941","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Andrea Collisson\"> so you have given a “ negative” to WS ..? It’s not enough for you ..? I guess you are “ super conscious “ ..? ( not that this is the place to discuss WS ..)</span></div>","author":"Grace N Adelaide","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_426956","type":"fbcomment","data":{"text":"<div class=\"comment_text\">The way you travel will be unique to you. You must find out what it is you do like to do. Everyone finds their travelling method.... Mine bicycle tent mountains and remote places. Its simple. India is fascinating especially for arty culture hungry eyes... Good luck</div>","author":"Tim Hobin","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_595803","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tim Hobin\"> even though the way a person travels is unique to the individual, you can also make generalisations. For instance there are those who like to explore the local culture and those who mostly focus on the bicycling experience . See!</span></div>","author":"Andrea Collisson","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_859133","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Some bigger cities have local “free” guide” donation based. They are very helpful and give you tips on what museum may be free in some specific days , or activity. Stay in a city more then one day and a go to a local meet up . \nDepends where you are in the world and how long you planning on staying , volunteer.</div>","author":"Anca Hotnog","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_163653","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I think riding through the country gives you more of a feel for the current culture. Also long walks through cities. Going to local events and eating and drinking a lot of food (though that is less a priority after I became plant-based 😐)\n\nWhen I plan my trips and pick out my route my secondary plan is \"what is there to do or see in each city/town or along way?\"\nI make a \"have to see/do and would be nice to see/do\".\n\nI usually try to ride 3 days on and one day off. And allow myself time for things I never planned. I used to be an archaeologist so that sometimes influences my stops but I like to see the weird and wonderful so Atlas Obscura research is done.\n\nHowever my last cycle tour in Fall of 2019 really hit my core. I did these tours as an adventure to accomplish, to grow and learn about the world and to help mental health.\n\nWhile all these are good character building they are individual-based (lack of better word selfish). My goals are to make a positive impact out side my own circles. So on that last tour seeing how many stray dogs there were I ended up focusing a lot on helping as many as I could.\n\nAs I started planning my next tour I switched my initial route and now have a plan to tour India to go to 68 cities to meet and volunteer at a variety of stray animal shelters and places helping dogs. I will donate my time and money and hopefully raise funds to give them along the way through creating exposure.\n\nI was to go this year but diverted my attention to the animals affected in Ukraine. Though not by bike I bought a can in Romania and started driving supplies into Ukraine to help animals. Even though I had to come back to Canada and cannot return at moment I am still hiring driver to continue the work.\n\nIn meantime I am planning and researching more and more into India trip. \n\nAll my subsequent trips will be focused on helping stray animals and working with local groups already doing the work.</div>","author":"Duane Taylor","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_549690","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Duane Taylor\"> In case you haven't been to india before some comments about the dog situation in india: There are a lot of stray dogs and you will notice that most of those you see are healthy. People do feed them. However in some places you come across dogs who have been very badly injured but who have \"recovered\" and just kept on going. It is a terrible thing to so those animals but you also humans in similar condition in some places. They are usually beggers. There are lots of animals shelters and there are some really good animal welfare organisations but i never stumbled upon any by chance. I guess you'd have to research them before you go. Or local people might tell you about them if you ask the right people. It can be sad to find frightened little puppies. \n\nSometimes you do find animals who need urgent medical attention and it can be quite difficult to know what the right thing to do it. Usually the locals already know about them and are either not doing anything , don't know what to do or are helping in some limited way. It depends on the situation. In kerala once i came across a dog who had been recently hit by a vehicle and it looked like it might be paralysed. The locals did nothing. On sunday morning they all filed past on the other side of the road on their way to church! What would you do in this situation? \n\nAnother situation I encountered was a female dog with a prolapsed uterus presumably after giving birth but i dont reallyknow. It was a small place with no vet. What would you do in this situation? \n\nAnother situation was in a big city in Rajasthan where i saw a cow with a prolapsed uterus. What would you do in that situation?\n\nI have admit that before i went to india and or came upon these situations, i did not give any thought to what i would do if came face to face with an awful situation such as those above. But each time i did try to do something and I think in only one situation did i get it really right. \n\nThere were situations where i came across people who needed help. I did help but not as well as i wish i had done. So i would mention this in case you need this info. And i know this will probably seem obvious but when you are india, and in the moment, it will not be as obvious as you think. \n\nWith injured animals, if you can find a Jain they will help the animal and know what to do because the Jains are very animal centred in their spirituality. \nIn india most vets work with farm animals and they are not really set up to take care of pets and individuals but they will probably help if you approach them. They can be hard to find. \n\nWhen it comes to people, remember there is always Mother Theresa's for those who are really really sick and near death's door, and taking a person to hospital in a rickhsaw is not a bad idea even when there are hundreds of people mulling around doing nothing because the person is normally a begger and lives on the streets. A lot of poor people or crippled people get their food from restaurants and basically set up home outside their door so that the patrons can give them their leftovers on the way out. You dont really see this a lot but i was with friends in mumbai and they always had food to give to the poor people when leaving a restaurant. \n\nI never saw a lot of incidents with people who really needed my help beyond the usual beggers but those few occasions when i did have those encounters it pays to know what to do. \n\nIf you are going to be mingling with dogs a lot, i would get rabies vaccinations in advance because if a dog bites you, you will basically have to abandon your trip and go either back to delhi or home to get the urgent immunoglobulin shot. Maybe you already know all this.</span></div>","author":"Andrea Collisson","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_291954","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Andrea Collisson\"> I have already done a lot of research on stray dogs and the organizations that help them.\n\nI have been in contact with dozens of them and learned a lot. I also support many of them financially. As I also do in Ukraine, Moldova and other places.\n\nAs far as what to do when I come across animals. I have learned a lot about that after being through so many countries and dealing with this. I also will be getting all vaccines needed at the appropriate time before actually going. I expect I will get bitten a few times given how much pain some of these animals will love in and their innate distrust of humans (especially men). Although I have no been bitten yet in my efforts I have come close. I am trying to arrange quitting my job and making this my full time raison d'être. I already set up a project called IMPACT Express (the first iteration was ongoing efforts in Ukraine).\n\nI am currently enrolled in a vet technician course so I am better prepared to do an assement and if I can possibly help. Or if I need to bring them to closest vet and cover the cost. I will be carrying some food but also different types of standard medicines that could be used.\n\nBut mainly my efforts will be to assist those that are already doing this work. I know I can never fully prepare myself for what things are like in person but I am fully prepared for how hard it will be emotionally. Just like I did when I went back into Ukraine.</span></div>","author":"Duane Taylor","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_457593","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Duane Taylor\"> It would be interesting to read if you  did a blog on what you find with regards to the animals and how you manage. I would like to read that. I know noone does blogs anymore but i would be interested. People could learn from you.</span></div>","author":"Andrea Collisson","gender":"FEMALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_154252","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Dress appropriate to the culture. Garish bike racing jerseys and skin tight bike shorts do not endear you to local people.\nI wear padded bike underwear from Pearl Izumi under lightweight hiking pants and shirts made of modern breathable fabric.</div>","author":"Curtis Evans","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_226813","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Music explorations, spontaneous festivities. Street food. People!!!! I get in the mix and follow curiosity. I’ve been invited to many a spontaneous family meal or celebration. I get to know people, ask for advice, suggestions, help. I’ve cycled across Asia and Europe and rarely do museums or sites if only because what’s immediately interesting and tugging me tends to eclipse the well-beaten path. \n\nExample, as a wee 23 year old, in Sonora, Mexico, I tent slept in a plaza during an annual pilgrimage, there were lots of families sleeping on the ground in the same plaza. Clearly, my bike/stuff had to be secured before I could explore the busy street markets. I got to know a cafe/sopa seller, a family with a 12-year old son who was curious about me. The woman was more than happy to keep an eye on my bike next to her stand while I practiced English/Spanish with her son, we strolled the carnival streets, went in the hall of mirrors... I bought him a football for being such a great tour guide. And then we played football 🙂 \n\nAh this is just one of many stories where I get to know the folks I meet and it all unfolds, something beyond anything we can plan. \n\nAnd that is everything to me!</div>","author":"Hannah Pierce-Carlson","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_424022","type":"fbcomment","data":{"text":"<div class=\"comment_text\">We sometimes think one of the things we most enjoy about cycle touring is that it's essentially a camping and picnic holiday. It's the one time when we get to spend lots of quality time together, in the outdoors. The fact that we are enjoying foreign landscapes is a bonus really. We always enjoy cathedrals and churches even though we are not religious ourselves. Some of those buildings are just absolutely spectacular and we always make time for them.</div>","author":"Cath Wood","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_778528","type":"fbcomment","data":{"text":"<div class=\"comment_text\">When I first started travelling, I thought the landscapes were the most important thing for me.  Being alone in nature, the freedom of it all.  But after I had been on the road a few months, maybe as I was coming up to the end of my first year, I realised it had changed.  After a while landscapes get a bit familiar.  There are only so many types of woodland, moorland, beaches, deserts.  Although, I really like countries with different styles of old architecture, like in Romania with their old hilltop citadels.  However, now the main draw for me is the people, because through them and their personal interests I see lots of different sides of their country and culture.  If I stay with someone who is into politics, I learn about the politics of their country, the same goes for history, local wildlife, food and drink, everything 😅.  At the moment I'm in Chile and I have learned about their local food, their complicated politics at the moment, their history with the dictatorship, history of how Bolivia lost access to the sea.  I feel that if I meet enough people and talk with them, I learn so much.  So while I still enjoy landscapes (especially tropical beaches), people have become my main interest.</div>","author":"Tony Gahegan","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_922327","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Culture in the form of museums, food, architecture, language, cinema and literature are always part of a trip through a country for me. I also try to read up on the geopolitical situation to have an understanding of how people live, world views, history etc. For my big trip from Amsterdam to Tokyo I tried to read a couple of famous novels and watch a couple of films for each country. Language was impossible to learn for so many countries - by the time I reached China I would make an effort to say hello and thank you but not much more. Museums - not that many but I will visit them when staying in a larger city for a while because of visa applications etc. Food - yes, lots of local dishes, I'll try anything! I'm an architectural historian and will make detours for interesting buildings :D</div>","author":"Vera Van De Nieuwenhof","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_326218","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Beginning to plan a trip so a complete novice, but what do you do with your bike and equipment in a large city to view a museum or cultural site?</div>","author":"Jeff Welborn","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_477386","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jeff Welborn\"> Get a room and leave your stuff in the room.</span></div>","author":"Kerry Vanderzalm","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_127831","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Best way to get inside the culture is to get a job..😉</div>","author":"Mats Aadde","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_648701","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I love visiting the museums,churches old buildings generally. I try to sample the local dishes also pardon the pun but it gives you the flavour of the country your cycling in.</div>","author":"Tony Jackson","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_807691","type":"fbcomment","data":{"text":"<div class=\"comment_text\">My best memories are related to interactions with locals, then the rest comes automatically. Learning basic sentences in their language will open gates of sympathy. In a country where ppl don`t talk with visitors i can always get drunk. just kidding but heading south i was invited many times for dinner , overnight and good chats, i know the northern countries will catch up.</div>","author":"Jo En Pausa","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_119056","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Why?</div>","author":"Donald Canard","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_760539","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Donald Canard\"> I actually thought it would be interesting, but actually its been disappointing.</span></div>","author":"Andrea Collisson","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_274872","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Museums, churches, scenery and pubs. Those are my favourite elements of cycle touring. No particular order; they are all as important as each other</div>","author":"Jack Robins","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_762627","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Local food is everything! Leave the stove, pots and pans at home.</div>","author":"Kerry Vanderzalm","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}