{"time":1660053208188,"version":"2.23.2","blocks":[{"id":"id_316945","type":"header","data":{"text":"Bike Touring in the Rain without a Raincoat","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_496439","type":"paragraph","data":{"text":"<i>Newbie question... What do folks actually do about rain?\n\nSo far I've focused on keeping my stuff dry so I can sleep dry. But I don't wear a raincoat under the assumption that I'm so wet with sweat already, some actual water won't make a difference. Is this normal? What do others do?\n\nFor context, it's summer in south-eastern Canada so temperatures range from 22-32. I started out as a road cyclist so I'm wearing bibs and a jersey  (it's what I'm comfortable in).</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_769846","type":"delimiter","data":{}},{"id":"id_869745","type":"fbcomment","data":{"text":"<div class=\"comment_text\">At 32 enjoy the rain.\n\nI have a poncho when it is colder. Nice breezes from below so I don't get wet from sweat, I also have fenders. The aerodynamics are horrible.</div>","author":"Thomas Wilson","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_970325","type":"fbcomment","data":{"text":"<div class=\"comment_text\">No rain gear , I’m already wet and rain cools my legs. All is good as long as you can keep it out of your eyes.</div>","author":"Michael Fluke","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_920005","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I swear by merino wool...keeps you warm even when soaking wet, even in winter...just need something dry for when you stop</div>","author":"Olaf Geerken","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_889767","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Have a poncho available if i get caught in the rain.  Most light rain i simply get wet if it's reasonably warm.  I hang out on heavy rain days and plan for two or three on my trips.  I don't pack serious rain gear.</div>","author":"Daniel Ellsworth","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_828547","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Goretex, Goretex and more Goretex. Here in Norway it's too cold to be wet, especially in the mountains.</div>","author":"Martin Storli","gender":"UNKNOWN","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_514869","type":"fbcomment","data":{"text":"<div class=\"comment_text\">If cant avoid it i do that, find a place to wait, if not i carry a poncho that covers the whole bike, it is great if it isnt too windy, just be carefull that it cant get into the wheel or something</div>","author":"Tomas Aperlo","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_528345","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Always keep yourself dry. I wear light rain coat, rain pants, rain cover for the helmet, and rain booties. All Gore-Tex. I once toured around the Bay of Fundy and it rained 8 out of the 10 days. “Waiting it out” was not an option, and with my full rain gear, it was totally doable.</div>","author":"Stephen Norton","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_29774","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Stephen Norton\"> Agree with Stephen, unless you’re in really warm climate.</span></div>","author":"Sarah McGregor","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_357024","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Stephen Norton\"> to contrast with this experience, I also have Gore Tex everything, but if it's raining hard and I'm climbing uphill, my upper half will get soaked no matter what. I've always wondered if I'm doing something wrong, or if I just have unrealistic expectations of what Gore Tex can do.</span></div>","author":"Hugh Warrington","gender":"NEUTER","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_845238","type":"fbcomment","data":{"text":"<div class=\"comment_text\">If it’s going to be warmer I just wear clothes that dry quickly and keep anything I want to sleep in dry</div>","author":"Kevin Medick","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_783805","type":"fbcomment","data":{"text":"<div class=\"comment_text\">It depends on the temperature. I keep my self warm but not hot. In hot temperatures I wear no rain gear and just get wet. If cold I wear full rain gear. Most times I just wear a rain jacket. I also carry a small umbrella to deal with short cloud bursts (but that's just me 😉). Main thing is to have something dry to wear or crawl into at night</div>","author":"Stewart Houck","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_696036","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Q: What happens to a cyclist in the rain?\n\nA: They get wet.</div>","author":"Mike Binnix","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_467514","type":"fbcomment","data":{"text":"<div class=\"comment_text\">In Alberta, if it rains, my first priority is try to stay warm.  when it rain, sometimes temperature can plunge as low as 5 C. so if you're riding, you need to focus on staying warm and preventing hypothermia.</div>","author":"Paul Kvarnberg","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_371748","type":"fbcomment","data":{"text":"<div class=\"comment_text\">In the summer I just ride in the rain. In colder temperatures I have goretex-style rain jacket and pants, neoprene gloves, neoprene socks and Crocs.\n\nBags are all waterproof.</div>","author":"Jason Roussel","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_906799","type":"fbcomment","data":{"text":"<div class=\"comment_text\">To me, 22 C is where the rain will start feeling cold. Below that I'll put on my raingear but - and this is crucially important - you can't just pull on Gore-Tex on bare skin; you need some intermediate layer. Yes, some rain garments do have a mesh inner lining that's supposed to deal with that but, no, in my experience they don't work.\n\nThe key to understanding permeable clothing is that the sweat from your skin has to actually evaporate into steam BEFORE it reaches the outer layer. Merino wool or silk work orders of magnitude better than the synthetic linings of most rainwear. It may seem strange and counter-intuitive to wear a long-sleeved wool shirt in summer, but once you've tried it I promise you'll become a convert. It will take heat from your skin to evaporate the sweat so it can escape through the pores of the garment - and it will cool you down at the same time. Win-win!</div>","author":"Torsten Lif","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_646167","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Breathable waterproof with large pit-zips. Ventilation is more important than fabric breathability for cycling as no expensive fabric can output the moisture at the rate you generate active cycling. Even a windproof works ok. You will get wet eventually. It's more about stopping the wind-chill causing evaporative cooling. I carry waterproof overtrousers, but don't use them unless really cold and stormy. In normal rain, just let legs get wet...your skin is waterproof and soon dries!</div>","author":"Steve Holland","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_102227","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Steve Holland\"> wet legs mean wet feet, and that's no fun.</span></div>","author":"Hugh Warrington","gender":"NEUTER","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_159039","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Hugh Warrington\"> in showery weather, not a problem. In cold wet weather, only real way of keeping feet totally dry is overtrousers  over gaiter style waterproof overshoes and waterproof socks. Overkill for most situations, but a method that works. Water will always run down legs into shoes/socks unless there is a double overlap. Sealkin socks on their own are a good comprise, as as they get wet, they act like a wetsuit, keeping warm layer of water next to skin. As a UK cyclist, I've developed this strategy over the years, and it's the one that works for me. Dress to expect to get wet eventually and your prepared. Dress expecting to keep totally dry and your in for trouble!😉</span></div>","author":"Steve Holland","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_833073","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Steve Holland\"> thanks for the thoughtful reply, I now swear by the sealskinz socks too! Although weirdly the instructions with my latest pair said 'not for prolonged use'??</span></div>","author":"Hugh Warrington","gender":"NEUTER","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_240696","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Hugh Warrington\"> yep, the water eventually runs down skin into sock. Also not the most robust, but once they fail, they are still useful as a windproof/warm wet style sock! I also use them for stand up Paddle-boarding with a diving boot on top. A good bit of kit.</span></div>","author":"Steve Holland","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_74372","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Number 1, stay warm, if it is hot I don't bother with waterproofs, I also wear quick drying clothes (it prevents chaffing). Everything is double bagged, once by the pannier, then again with bin bags, but remember to replace the bin bags regularly as friction will make holes in them. Money and docs go in a ziploc bag, again, replace when needed. Remember, nothing is 100% reliable.</div>","author":"Steven Hawkswell","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_645143","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Wicking fabrics, wool or synthetic.  jacket and pants are wind barrier only, 'cause you're going to be wet no matter what. Wicking and windstoppers control evaporation to keep you from getting too hot or too cold. keep a spare dry set if stopped for a long time in cold weather if you don't wear wool.</div>","author":"Larye Parkins","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_273934","type":"fbcomment","data":{"text":"<div class=\"comment_text\">When it is really hot, and there are downpours during rainy season, I use a rain cape. It is fairly heavy but 100% waterproof, and lots of air gets underneath and around my body to keep me cool. It is also bright yellow, so that I cannot be easily missed, even by vehicles with poor windscreen wipers.\n\nIf it is moderately warm, a waterproof jacket with pit zips, and shorts. Underneath I wear wicking layers. Usually a merino base layer. If  I know I will be in the rain all day, waterproof socks. Yes I will get moist from sweat, but the wicking keeps the skin relatively dry, and merino wool is warm, even when moist.\n\nf it is cold I will also wear waterproof rain pants, mostly to avoid wind chill on my legs. And a waterproof thermal skull cap under my helmet.</div>","author":"Mark Perry","gender":"UNKNOWN","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_86775","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Just keeping pedalling. You can only get so wet. As long as your bags are waterproof it's full steam ahead.</div>","author":"Jason McMahon","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_60453","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Rain cape for me. On and off literally in a few seconds. I drape it over the front bars. Plenty of air flow.</div>","author":"Pedaling Pete","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_61517","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I wore a raincoat and legs just got wet</div>","author":"Kevin Voll","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_960832","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Cheap poncho worked great with my helmet clipped over top so it didn’t blow off. Covered most of the rear panniers as well.</div>","author":"Jeff Kalmus","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_976374","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Plastic bags\nGear goes in them\nCamping\nTwo plastic traps\nFirst one gets placed between trees above where tent goes\n2nd on the ground\nThan tent goes up\nThan sleeping bag in tent\nIn morning reverse \nFirst wipe down any wet items with a towel\nTraps in plastic bags\nAt some point during the say need to stop and get out wet items and let dry in the sun if rain possible that nite</div>","author":"Charles Nighbor","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_130794","type":"fbcomment","data":{"text":"<div class=\"comment_text\">gear aside (because it's packed in waterproof panniers) I personally wear a light rain jacket and don't mind if my legs get wet. I add bodega bags to keep my feet fry if it's really coming down- Socks, then bags, then shoes.</div>","author":"Lindsey Hamma","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_149564","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I also try to ride int he rain as much as possible and call it conditioning 😉</div>","author":"Lindsey Hamma","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_810314","type":"fbcomment","data":{"text":"<div class=\"comment_text\">You are going to get wet. Find a way that you can also stay warm while you're riding wet and get warm quickly after you are done for the day</div>","author":"Tony Dangerfield","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_239646","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Columbia rain gear and a nice shade tree and some hot coffee or just a trash bag under my shirt if I don’t have rain gear it will keep you warm</div>","author":"Doug Hubbard","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_276330","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Shout at it!</div>","author":"Gregg Bragg","gender":"UNKNOWN","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_36935","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Rain = free shower</div>","author":"Miro Rakic","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_415832","type":"fbcomment","data":{"text":"<div class=\"comment_text\">On one of my tours of the PNW, I rode with a lot of rain. I remember stopping at a Mom &amp; Pop shop and I seen a newspaper on the counter and I asked what the forecast was. The lady told me, Honey, this is the PNW we don't care what the forecast is, we are going to do whatever we were going to do anyways regardless of what happens with the weather. I appreciated the logic in that. I decided to ride in the rain and keep my clothing in my panniers dry. It worked great until I ran out of clothes, then I rented a room and washed and dried all my gear and started again in the morning. It took a while but I got used to it and the only other problem was the saddle sores from riding in the wet clothes. I really got to get back out there and do some more touring.</div>","author":"Michael Miller Sr.","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_861565","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I have a Showers Pass jacket and Columbia rain pants that both breath really nice. Even in the humid south, Louisiana and Florida, never sweated as I rode through hurricanes with 90% humidity.\n\nI usually keep riding though as it doesn’t bother me much.</div>","author":"Ty Dawley","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_744624","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Groundeffect’s anti cyclone jacket and just keep on riding.</div>","author":"Geoff Semon","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_107332","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Get wet. Make sure I have dry things to put on at night/when stopped. \nIf your kit doesn't dry overnight, put it on wet. It's gross for about 20mins but you'll dry it quicker by wearing it/keep getting wet anyway because its still raining.\nBeing wet is ok (if a little uncomfortable) as long as you're warm as stated before</div>","author":"Hannah Milton","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_684448","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Rain coat, helmet cover. Wool socks/ sandals. Depends on temps. For when it’s warmer, just a 1/4 zip wool t shirt.</div>","author":"Lee Hollenbeck","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_675771","type":"fbcomment","data":{"text":"<div class=\"comment_text\">As long as I am not cold, I don’t wear rain gear! Rain is nice and refreshing on a hot day. If it’s chilly, yeah rain gear including shoe covers. Of course keeping your luggage dry is your utmost priority. And if it rains a lot sometimes it’s better to stop and wait it out!</div>","author":"Anita Ferlandez","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_313894","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Frogg togg jscket..cheap and works</div>","author":"Marcus Wisdorf","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_469649","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Rain jacket and pants if necessary, waterproof bags inside waterproof panniers …clean and lube chain the next day if needed</div>","author":"Michael Clyde","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}