{"time":1655550127439,"version":"2.23.2","blocks":[{"id":"id_348780","type":"header","data":{"text":"Cancelled My Bikepacking Trip Out of Fear","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_280627","type":"paragraph","data":{"text":"<i>Hey everyone,\n\nI’ve got kind of a weird question for you today. Long winded background, I apologize.\n\nI tried bikepacking for the first time (solo), loaded up, weather looked great spirits were high, and I was about 15 miles from my campsite when suddenly the weather took a turn for the worse. It was pouring rain, whipping wind, with a bad thunderstorm directly overhead. A couple trees came down across the trail I was on, at times gusts almost knocked me over, and despite all my rain gear my shoes and socks became a puddle. I took shelter under a bridge, where the thunderstorm got much worse (I’m terrified of lightning). My electronics bag also soaked through, because it was out of my dry bag when the downpour started.\n\nBetween the wet shoes, the wet electronics, the anxiety from the thunder, and a closure of part of the trail due to downed trees, when I got a gap in the weather I ended up bailing and going home by train. Now that I’m home, I kind of regret that decision. The weather eventually passed, and all the problems that I had could have been easily overcome. But in the moment I was overwhelmed and didn’t have the resolve to push though. \n\nSo my question is this: for those who have struggled with this or something similar in the past, how do you get over it? Any advice to follow through and actually finish trips? I know there’s nothing wrong with bailing, and it should always be considered when safety is an issue, but what about when discomfort is the biggest risk?\n\nThanks in advance.</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_737279","type":"delimiter","data":{}},{"id":"id_28118","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Maybe you should road bike....</div>","author":"Evan Johnson","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_510880","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Evan Johnson\"> not the answer I was looking for. Fuck out of here with your negativity.</span></div>","author":"Tyler Newcomb","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_721316","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Evan Johnson\"> what an absolute knobhead answer.</span></div>","author":"Ben Krantz","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_337213","type":"fbcomment","data":{"text":"<div class=\"comment_text\">That experience made you much more ready. I guarantee your next trip will be a huge success. Good job!</div>","author":"David Gleason","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_502167","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"David Gleason\"> do you think it just comes naturally? Like do you think your resolve builds on its own, or do you need to work at it?</span></div>","author":"Tyler Newcomb","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_476383","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tyler Newcomb\"> no it doesn’t come naturally. It comes from experience, which you have more of now. That is the work.</span></div>","author":"David Gleason","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_528614","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"David Gleason\"> thanks!</span></div>","author":"Tyler Newcomb","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_439768","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Don't listen to aholes like Evan, we all have fears to overcome and personal demons to persevere against. The secret is pretty simple....believe in yourself. Just tell yourself \"this too shall pass.\" You are stronger than you think! Now get back out there and send it!</div>","author":"Trey Freeman","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_727073","type":"fbcomment","data":{"text":"<div class=\"comment_text\">There is no shame in bailing. You learned some important lessons and will be better prepared next time. I have had to be rescued a couple times on long rides in the middle of nowhere with a mechanical, and I have also pushed through on rides where it looked like there was no way to continue.</div>","author":"T.j. Oehmen","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_882116","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"T.j. Oehmen\"> How were you rescued? Who one can ask for help in the middle of nowhere?</span></div>","author":"Viktor Umanskiy","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_586757","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Viktor, I had to call my girlfriend who had to drive over 200 miles to pick me up and take me back to my truck. It would have been a 9 hour walk if she had not.</div>","author":"T.j. Oehmen","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_223922","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Hindsight is always 20/20. In the moment, it was more than just discomfort. It got real out there. Lots of opportunities for future rides. I’ve toiled and painstakingly planned trips just to bail due to unforeseen circumstances. A “tactical retreat” is nothing to be ashamed of. You gave it an honest effort. Reflect, learn and ride another day.</div>","author":"Robert Pelton","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_199932","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Doesn’t sound like you made a bad decision given the conditions. But then FOMO caught up with you. Been there! Perseverance comes with experience, IMO. One trick I use to keep going is to tell myself that everything is temporary. A little (a lot) of suffering makes the rest of the experience richer, and always improves the stories. 👌</div>","author":"Neil Doran","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_584243","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Neil Doran\"> I’ve never let type 2 fun get in the way backpacking or climbing, but something about today really just got to me. The FOMO definitely hit as soon as I bought the train ticket back 😅. Maybe I’ll try the same route next week.</span></div>","author":"Tyler Newcomb","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_613609","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Was your first go. Ease up on yourself. Next time you’ll have this experience to call upon.</div>","author":"Dennis Mashue","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_900442","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Nothing wrong with bailing as long as you reflect on it and plan for the situation where you cannot bail.</div>","author":"Brent Clark","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_520100","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Brent Clark\"> yeah, I think looking back I just feel frustrated at myself because I didn’t need to bail. I was decently prepared, just a little uncomfortable. At the time I couldn’t see myself continuing in that discomfort, but now it seems meaningless.</span></div>","author":"Tyler Newcomb","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_481796","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tyler Newcomb\"> keep the electronics in a dry bag, get better rain gear (and put it on sooner perhaps) etc…</span></div>","author":"Brent Clark","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_512744","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Brent Clark\"> yeah the electronics was foolish. Definitely learned my lesson there. \n\nAs for rain gear, what do you recommend? I had a cleverhood rain cape, which I commute with without any issue. I’m particularly interested in how you keep your feet dry in sideways rain, since that’s the most uncomfortable.</span></div>","author":"Tyler Newcomb","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_438656","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tyler Newcomb\"> I bought the best rain gear I could afford is the best answer. I don’t have enough experience yet in wet riding conditions to give advice. Personally I don’t mind getting wet or getting cold but both is hard hence why I tried to get good gear at a reasonable price. Found deals on marketplace as well as online. To answer your question Arc’teryx alpha goretex shell, MEC Aquadash pants and I concede that my felt will get wet. If winter I would wear neoprene overshoes</span></div>","author":"Brent Clark","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_980182","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Brent Clark\"> I’ve been a big fan of the cleverhood. It’s far from aerodynamic and pretty, but it gets you great coverage of your whole body (hands, legs, and all!) while still allowing some airflow. I think the lack of fenders contributed to the wet feet, as I was going through some ~2 inch puddles.</span></div>","author":"Tyler Newcomb","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_274756","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tyler Newcomb\"> here (western Canada ) the last two days it felt like summer. Perfect riding conditions.</span></div>","author":"Brent Clark","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_296261","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Brent Clark\"> we had some great weather here (East coast USA) for a while, like 3 weeks or so, but of course I had a crash a bit back and was recovering from a concussion. Now that I’m back on the bike it’s like 85-90°F, humid, and stormy.</span></div>","author":"Tyler Newcomb","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_289381","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tyler Newcomb\"> one last thing from myself, always bring an emergency bivy just in case. One of those things (like bear spray where I live although never had a problem with our black bears) you bring but hope to not need. My emergency bivy cost me 10 bucks Canadian and cheaper options are out there fwiw</span></div><div class=\"comment_attachment\"><div class=\"comment_photo_attachment\"><img class=\"comment_photo_image\" loading=\"lazy\" src=\"/images/community/cancelled-bikepacking-trip-out-of-fear/image_1655550127_5687718721.jpg\" alt=\"\"></div></div>","author":"Brent Clark","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_770722","type":"fbcomment","data":{"text":"<div class=\"comment_text\">You are young.. have lots of experiences like this and it just gets easier and easier. The key is not to quit. My first experiences with adversity in the outdoors were at 16.. wanted to quit. Now almost 40 and I’ve had so many shit shows not much bothers me anymore. As long as I’m not in absolute grave danger, discomfort is just an experience and fear will fade when you realize the only thing worth fearing is your self.. unless you are in an active conflict zone or a place where people want to hurt you. Then you should be affraid. But that’s pretty rare and you can avoid those places with research. Good luck!</div>","author":"Joe Connolly","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_648980","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Joe Connolly\"> thanks. It’s been a while since I’ve done anything in the outdoors, so I guess I just lost that thought process from not using it.</span></div>","author":"Tyler Newcomb","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_513188","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tyler Newcomb\"> also one other note - in retrospect, some of my favorite memories are the crazy “bad” things. Not my favorite experiences at the time.. but a month, year later.. you’re like “holy crap.. and then this happened” - makes for good stories, builds perspective, and makes the “good times” that much more valuable and you realize it can’t always be “easy” - gotta earn it with some sufferfest. With time, you may enjoy the sufferfest itself. Then the “bad” things just become interesting. Like when you are in the middle of nowhere Montenegro near the Albania border and you have a catastrophic bike failure and have to hitch-hike to a bigger town to get parts. 20 year old me would have hated it. 35 year old me was like “here we go!”</span></div>","author":"Joe Connolly","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_66129","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I have not bikepacked yet, BUT I’ve paddled a canoe 120 miles non-stop for 18 hours straight and ran 3 full marathons and I’d say stubbornness is a trait to really allow to shine in these scenarios. Tell yourself continually that quitting is NOT an option. But also it’s important to continue to see what’s fun about it rather than keep repeating what you hate in that moment, because the storm always passes. Get back out there and best of luck!</div>","author":"Nicky Krucinski","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_840130","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Nicky Krucinski\"> thank you! How do you force yourself to think “quitting is not an option” harder than my natural thought of “well the train is right there, and in 2 hours I’ll be home and dry, with a nice hot meal and a warm shower?”</span></div>","author":"Tyler Newcomb","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_585763","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Oh trust me. 9 hours in to the canoe race (it had been pouring all night) there was a woman sitting at a fire pit by the river wrapped in a blanket, drinking a cup of coffee. I instantly wanted all of that. I wanted to stop right there and be done. \n\nBUT, I felt like I would let myself down so much for not seeing this through. All the preparation I’d gone through to get ready would have been a waste. Not to mention the crushing guilt of not finishing wouldn’t be outweighed by the instant comfort of a warm fire and a cup of coffee. \n\nThose things would be quite the reward for finishing though! \n\nThe train ride needs to be seen as the treat you get for a job well done. You just have to power through and treat it like it’s the carrot. \n\n(And once again, also enjoy everything that’s beautiful about the adventure!)</div>","author":"Nicky Krucinski","gender":"FEMALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_175023","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Lots of empathy for you Tyler. I recently bailed on a solo bikepack trip myself.I started my ride the day after leaving my job, and for the first day and a half of a three day ride, I was in a really, really negative headspace. A place I had never been before. I was miserable the whole time, despite the fact that the ride was gorgeous, and physically I felt great. But mentally, I was having a terrible time for some strange reason, and just wanted it to be over. \nUltimately, I decided to pull the plug on the ride about 60% of the way through. I didn't see my mental state changing. I decided to call it because I ride bikes to have fun. That's my goal. I have nothing to prove to anyone, and I know that physically I could have finished the ride. I regret nothing. Sure, it was a bummer and it was a sad experience, but I am glad I called it.\nWhen I was deciding whether to call it or keep riding, I got so hung up on the idea of \"what's the right decision??\", when in reality there is no right or wrong decision! It simply doesn't fucking matter. We act like people give a shit about what we do. They don't. Only we do, and we gotta do what makes us happy. Your route, and my route, will still be there in the future, and I definitely plan to redo my trip in the next year.</div>","author":"Chris McGurrin","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_948552","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Chris McGurrin\"> thanks so much for sharing this, Chris. That’s a really good point, I ride for fun, I don’t want to ride not fun stuff. There’s definitely something to be said for type 2 fun, but I knew I was going to be miserable so I bailed. \n\nAnd absolutely, mental health comes first. Now that you mention that, it’s my first big ride back since a bad crash, so I’m sure the stress of that contributed too.</span></div>","author":"Tyler Newcomb","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_267635","type":"fbcomment","data":{"text":"<div class=\"comment_text\">It happens. On some trips you will bail, on others you'll go through hell and not care about it. Every day is different - as long as you're in one piece and kinda healthy, everything is good.</div>","author":"Pierre Moreels","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_465146","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Happens to everyone at some point. Not just in bike packing, but life in general. We've all been deterred by fears of some sort, rational or otherwise. The choice for you now is if you let that stop you in the future, or it spurs you on. Only you'll know. Best of luck.</div>","author":"Matt Wayne","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_618402","type":"fbcomment","data":{"text":"<div class=\"comment_text\">A long time ago I used to psych myself out and bail on trips.. What I did to overcome this probably isn't the best advice but it's what I did to get over it.. I started planning routes with no bailout points and no cell phone reception. I'd plan on and push to the middle of the route to camp. Psychologically I just had to deal with it.\n\nI've had some really (in the moment) awful trips that are now super rad stories of overcoming obstacles and the elements. I live in the Rockies and all my routes go up to at least 8,000'. It's rare when a trip doesn't suck for at least a few hours. You learn how pack better, or mentally/physically (emotionally when you're alone in the middle of nowhere and you're doubting yourself) push through it.\n\nI'd happily do every trip I've ever done over again. Regardless of how bad some of them have been.</div>","author":"Dustin Schulten","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_951446","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Dustin Schulten\"> yeah maybe that’s the advice I need to take. I think I knew then, and I definitely know now, that I could do it, but the option to bail was just so easy. If it wasn’t there I would have just done it.\n\nThe other problem is that I live in the NYC area. There’s nowhere remote enough I could get to in a 2 or even 3 or 4 day trip to have no cell service and no bailouts 😂</span></div>","author":"Tyler Newcomb","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_487272","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tyler Newcomb\"> yeah! That's a different ball game entirely. I can be in the middle of absolutely nowhere in a couple hours from the house here on Colorado's Front Range.</span></div>","author":"Dustin Schulten","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_168496","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tyler Newcomb\"> if I got on a train on any of my routes it would probably cost me a few hundred dollars and take me nowhere near home. 🤣 a different adventure entirely.</span></div>","author":"Dustin Schulten","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_154603","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Dustin Schulten\"> in some ways I’m jealous, in other ways I’m so very not jealous. I’d love to have that big of a playground, but I’ve got a ton of adventures at my fingertips without even needing to own a car. Makes one way rides possible solo.</span></div>","author":"Tyler Newcomb","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_24097","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Sounds as if you reasoned it out and did a sensible action. Since you were not that far into the ride.</div>","author":"Michael Hammon","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_894667","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Go again.  You'll be fine and with experience,  more prepared.</div>","author":"John Bube","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_222338","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Living in Alaska for the last 47 years I have learned many things from all the time spent outdoors. You need to always be prepared for adverse weather and always have a backup plan. I always carry an emergency bag with a few essential items. Several times I have aborted trips as things just didn’t look good. Most those times were while touring in my sea kayak. I have come close to becoming hypothermic several times. You learn by experience when to call it quits snd what items are really needed on trips and what aren’t.  When you are in remote areas like here it’s extremely important. Look at your recent trip as a lesson learned. You don’t learn much when everything is easy and the weather is perfect.</div>","author":"Brian Owens","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_956815","type":"fbcomment","data":{"text":"<div class=\"comment_text\">ADVENTURE AND ADVERSITY!</div>","author":"Danya Anderson","gender":"NEUTER","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_190983","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Discretion is the better part of valor!</div>","author":"John Heaton","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_951428","type":"fbcomment","data":{"text":"<div class=\"comment_text\">A group of 7 of us just bailed on a trip yesterday. It was just supposed to be a 2 night/2 1/2 day bikepacking trip, but we encountered multiple downed trees, and after bushwhacking for almost 3 hours, and only making it a few miles, we decided to turn around. Could we have continued? Probably. Was it fun? Not really. And that is the thing. Granted, our definition of fun as bikepackers is a little different from the general population, but in the end, this is supposed to be fun. If it’s not fun, then why do it? Yes, we can do hard things, and in a certain frame of mind, we find fun in those hard things, but sometimes, it’s okay to just say this isn’t fun, so I’m bailing. The more trips you go on, the more times you will be in situations where you don’t have the choice of bailing. In the meantime, learn from the experience, and move on.</div>","author":"Colleen Welch","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_840786","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Have a backup buddy/friend. When tough things happen(life) call them or text and have them give you the nudge you need to keep on the right path. \nBest part is let them know ahead whatever you’re doing that you might need a nudge for!</div>","author":"Doug Riegner","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_699017","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Doug Riegner\"> ha, I called both my boyfriend and my father (the standard two people I leave a trip plan with) and neither of them pushed me on 😂. I’ll need to find someone less compassionate to tell me not to chicken out.</span></div>","author":"Tyler Newcomb","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_164046","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tyler Newcomb\"> yup, a crazier friend to call is helpful, I have one but often have to tell him “ no, I’m not doing that”, lol. Safety and knowing your limits is also good, it’ll give you more confidence and wisdom to avoid the big mistakes 🤞</span></div>","author":"David Haughton","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_947051","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tyler Newcomb\"> being able to make the call is great.  👌🏻</span></div>","author":"Doug Riegner","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_23807","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Seek shelter for sure. I almost got hit by lightning once. Missed by about ten metres. Fuck being out in a storm</div>","author":"Matt Willis","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_1487","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Matt Willis\"> yeah I found a place under an overpass on the trail and hunkered down for a bit. I have no problem seeking shelter during a lightning storm, my problem is continuing once it’s passed.</span></div>","author":"Tyler Newcomb","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_502963","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tyler Newcomb\"> part of the journey man. I know the feeling thought hey. When it's wet it fucking sucks lol I spend a whole day in a subway recently because I got rained out. Then camped in a gazibo in town that night lol</span></div>","author":"Matt Willis","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_791967","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Knowing when to bail is critical, don’t judge yourself. You need to trust your readiness, skills, gear and risk appetite. Sounds like you made a good call. Pre planning off risks and mitigation and improved weather Knowledge of areas etc will change this equation for future trips. Practice will only make easier, and, to be honest, it’s much harder to unpack scary situations by yourself. I would say like when lost, next time stop, have a warm drink and something to eat as it slows you down to think better, it’s what I tell my scout troop to do when lost bush walking. Sounds like you learnt a lot. Great work, chin up and I say you deserve a good pat on the back. Next time you will likely overpack based on this trip to try and over solve risks, but practice makes perfect. Make sure you go out as soon as possible so the gremlins of this trip don’t niggle. You could always go with a group next time to build some confidence, but just go. Good on you for sharing your experience. This group is generally very supportive, ask questions and learn. Congrats on first trip, even with the issues!</div>","author":"Ryan Winn","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_382364","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Ryan Winn\"> thank you. I hunkered down under an overpass on the trail for a bit in a dry spot, set up a chair, and was about to cook food, but I got a gap in the weather and was focused on getting to the closest town (where I planned to decide whether to bail and go home by train, camp somewhere, or possibly even stay in a hotel) and once I got there the train was calling me haha.</span></div>","author":"Tyler Newcomb","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_75193","type":"fbcomment","data":{"text":"<div class=\"comment_text\">As a friend said, “attitude is the difference between an ordeal and an adventure”. Not reaching the finish line as you initially hoped does not mean you fail, sounds like you have the right attitude and understand the journey you are on, especially in learning skills and developing knowledge. Not all trips will go as planned but the stories will be awesome 🙂 Key riding!!</div>","author":"Ryan Winn","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_69527","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Start small and simple and build up. Check forecast before you go. Best to go with others when you are starting out...... Good luck bouncing back overnighters are worth it!</div>","author":"John Jakimyszyn","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_415116","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"John Jakimyszyn\"> this was the simple trip 😅 just 55 miles day one and 70 day 2, with one night of camping. \n\nAs far as weather, up until 30 minutes before the severe thunderstorm and downpour it said “chance of showers.” I can deal with showers lol. I had rain gear, but any advice for keeping feet and shoes dry?</span></div>","author":"Tyler Newcomb","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_357377","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Take thongs or crocs with you. I have cycled in crocs in crazy conditions. There are waterproof overshoes but this in my opinion is another bit of gear you will rarely use and still have to carry. Distance planned is not always indicative of all the environmental and circumstantial things that can crop up. Some 30km days become epic days. All the best in the future! 😁🙃</div>","author":"John Jakimyszyn","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_229039","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Imo, it's best to keep going even if you improvise. No shame in changing plans due to discomfort, circumstance, a bad decision, or just cuz you feel like it. Stay in a motel if you want, eat at a restaurant if you want, bum a ride from a friend or a stranger if you want, spend a couple extra nights at a great campsite if you want, it's your trip!</div>","author":"Adam Pagenkopf","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_127196","type":"fbcomment","data":{"text":"<div class=\"comment_text\">When trees are being blown down, that's the time to bail! And then pick yourself and go adventure again. But if trees are coming down, get the hell outta there! Lightning is also a serious danger. Lots of people dismiss it, but there's a reason people use it as a comparison... because your chance of getting struck and dying from lightning is a lot higher than other things like sharks or bears. Those are two things to be very scared of in the outdoors, lightning and trees/tree limbs.</div>","author":"Doug Gudfred","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_152429","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Doug Gudfred\"> definitely agree, both are terrifying. When I saw those two things, I found a bridge pretty quickly to get shelter under. \n\nThat said, I waited it out and both the wind and lightning died down, but I still couldn’t get myself to keep going. Once the danger is gone, how you push through that remaining anxiety about it?</span></div>","author":"Tyler Newcomb","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_983168","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tyler Newcomb\"> that sounds like a pretty serious day! I'm not sure I'd even try to keep going. I have PTSD about lightning from being stuck in mangroves during a squall. It's taken me years to be able to deal with lightning. It's very hard.</span></div>","author":"Doug Gudfred","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_19618","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Just power through it. Probably not that helpful but I have also had a tendency to bail out but the times I don’t, those are the best trips. Working that mental game as well</div>","author":"Erin Tetro","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_348091","type":"fbcomment","data":{"text":"<div class=\"comment_text\">The best deterrent for going home is to recognise that 9 times out of ten you'll regret it. I'm not saying don't, some situations demand you do, just remember that even the bad days get better with time.</div>","author":"Keith Foskett","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_54799","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I like travelling solo for that reason.  It forces you to talk to people.  Whether it’s simple directions, or random conversation in a restaurant etc.</div>","author":"Tim Attwood","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_172341","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Plan a train journey and ride home. Focus on the advantage x</div>","author":"Debs Phil Walton Smith","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_330848","type":"fbcomment","data":{"text":"<div class=\"comment_text\">My first trip did not go as planned and I ended up cutting off the last 20 miles of my second day due to flooded roads that left my only route option to ride alone a highway in pouring rain. I was already soaked and cold so I opted out and had my father come pick me up (since my trip was to bike to his house anyway). The highway had a wide shoulder and would have been rideable, but I just didn’t want to do it. If I hadn’t had my dad to come get me, I would have been getting a hotel. Of course I would have loved to have finished, but it still was an adventure for my first trip, and many lessons learned. \n\nWhen I heard your story, it reminded me of that trip. If I had been in your position on your trip, I would have likely made the same choice. The whole point of bikepacking is to enjoy it. I don’t mean you have to enjoy every second and that there won’t be any challenges, but only you know your limits and what you want to push through, and what you don’t.</div>","author":"Megan Polney","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_425681","type":"fbcomment","data":{"text":"<div class=\"comment_text\">No problem all with changing your plans. You left home on your bike, you had an adventure, and you want to do it again…who can ask for more?</div>","author":"Katie McTavish","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_790481","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Tactical decision given the conditions, you may well have suffered from wet feet for the duration if you’d continued. I’d have done the same. Dry off and go again. Top job 😊</div>","author":"Phil Scott","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_599153","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Sounds like you already got a lot of good advice about handling the question of bailing, so I'll just add a practical tip: put every piece of electronics in its own little Ziploc bag, so if your electronics bag gets soaked, the items inside will stay dry.</div>","author":"Brian Ritzel","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_436921","type":"fbcomment","data":{"text":"<div class=\"comment_text\">This is a very good question and there's no perfect answer, but my tip would be:\nTry to find a traveling companion. Those situations which feel pointless and miserable when you're alone can be the ones you laugh about, if you have company.\nIf going alone, stick to generally less challenging stuff.</div>","author":"Colin Gilbert","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_19313","type":"fbcomment","data":{"text":"<div class=\"comment_text\">You didn’t bail, your adventure just took on  a different direction. If it was adventure you were looking for you nailed it!  (after all, an adventure which is formulaic and goes to plan is more like a simple holiday - yawn 🥱 )\n So look back, learn ( double bag anything you want to keep dry ) and smile - the worst moments always make the best stories .</div>","author":"Anne Usher","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_607796","type":"fbcomment","data":{"text":"<div class=\"comment_text\">If this doesn’t stir someone up nothing will.....\n<a href=\"https://youtu.be/unkIVvjZc9Y\" target=\"_blank\" rel=\"nofollow\">https://youtu.be/unkIVvjZc9Y</a>\nIf you are Australian, you will love it. Other nationalities well. \nBy the way Tyler.......right call.</div><div class=\"comment_attachment\"><div class=\"link-tool\"><a class=\"link-tool__content link-tool__content--rendered\" target=\"_blank\" rel=\"nofollow\" href=\"https://l.facebook.com/l.php?u=https%3A%2F%2Fyoutu.be%2FunkIVvjZc9Y&amp;h=AT3giMdyH2RSSRgv__I8Nc0MNNNsq7NKXjUgaAJom8Y4Pq1O-HGrAC5NigFIa7Nkfi49utTe2bIYcPR_KPaAAxCvBF0MJAV45tiSN0KEbJfFyUuaXw701wuzXv4sv_tBXPSaK-Ag9nSwLGk&amp;s=1\"><div class=\"link-tool__image\"><img loading=\"lazy\" src=\"https://i.ytimg.com/vi/unkIVvjZc9Y/hqdefault.jpg\" alt=\"\"></div><div class=\"link-tool__title\">Ronnie Johns - Chopper - Harden the Fuck Up</div><span class=\"link-tool__anchor truncate\">youtube.com</span></a></div></div>","author":"Michael Charles","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_348268","type":"fbcomment","data":{"text":"<div class=\"comment_text\">If one always rides in perfect conditions, ways to deal with adversity cannot be learned. Consider your ride a success!</div>","author":"Dave Anning","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_658386","type":"fbcomment","data":{"text":"<div class=\"comment_text\">You survived! Try again.  You could have camped under the bridge if you thought it was safe . But to be honest that sounds like quite a cool adventure just the way it was</div>","author":"Will Ginger","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_653454","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Will Ginger\"> I thought about it, but the ground was slightly sloped, so although it wasn’t the flooding the floor was wet. I also had a hammock and there was no truss or anything to attach to to get off the ground</span></div>","author":"Tyler Newcomb","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_758658","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Solo, I might have done the same. But with at least one other person, I probably would have embraced the suck and pressed forward. Maybe consider bikepacking with others first?</div>","author":"Andrew Heindl","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_737763","type":"fbcomment","data":{"text":"<div class=\"comment_text\">You did what you felt was right at that moment. Don’t beat yourself up about it. Enjoy planning you next adventure. Kudos to you. 👍</div>","author":"Michael Harper","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_39775","type":"fbcomment","data":{"text":"<div class=\"comment_text\">As long as you felt you did the right thing!      IMHO if it matters, here's what I always think.....hiking or biking, if I get soaked I always always always bring a quick dry towel in my packs, and I make sure it never gets wet unless I'm using it.  Reason for this is for situations you just described.  If I'm soaked I can set up camp, get naked get dry and toss on my dry pair of sleep clothes and crawl into my sleeping bag...boom back to normal and no worries of hypothermia.  \n\nIn regards to the lightning, yeah it scares me as well lol but you could have waited it out, or set up quick camp under the bridge and do what I stated above.  \n\nFor shoes I recommend a dedicated pair of biking waterproof shoe. I have the adidas 510 trail cross Gore-Tex shoe. They are tight around the ankle and fully waterproof yet look like a basic shoe.  I've never had a problem.  Or!!!!!! I have a pair of showers pass waterproof socks.  Guaranteed dry feet!!! I recommend!!!!</div>","author":"Elijah Rosgard","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_775342","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Elijah Rosgard\"> not able to find the waterproof adidas shoes you mention, do you have a link by any chance? And do you find you sweat or chafe at all with the showers pass socks? I normally wear wool (even in day to day life) because my feet have various problems with cotton or synthetics.</span></div>","author":"Tyler Newcomb","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_399784","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tyler Newcomb\"> adidas 510 trail cross Gore-Tex.  Amazing shoe!</span></div>","author":"Elijah Rosgard","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_714917","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tyler Newcomb\">no issues to date with the showers pass socks.  A little sweaty, although that goes for anything waterproof. Haha</span></div>","author":"Elijah Rosgard","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_472447","type":"fbcomment","data":{"text":"<div class=\"comment_text\">You already passed step one, you got caught in one and survived. Sure it hurt but that's cause you are afraid, there is no shame in that. Now if you get caught in another one just try to think \"I did it before I can do it again\". I'm working on my fear of heights so I can bikepack up a mountain.</div>","author":"Gabriel Smith","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_751845","type":"fbcomment","data":{"text":"<div class=\"comment_text\">This sounds like one hell of an adventure and gives a great story</div>","author":"Justin Woodhouse","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_89554","type":"fbcomment","data":{"text":"<div class=\"comment_text\">You made a solid judgement call for yourself. Now you take lessons learned from that trip and apply them to the next ! The beauty of bikepacking is supposed to be the freedom, if you're not having a good time within the structure of what you personally enjoy, what's the point? There's no failures, just learning opportunities 🤙🏻</div>","author":"Ben Krantz","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_3075","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Every experience (or failure) is lesson and a building block for your next ride. For next time, you might re-evaluate your shoes for dryness, be sure electronics are stowed in a dry bag, remain patient because everything passes. I am glad you are safe and a little wiser. BTW, I did my first bikepacking trip this past weekend. We had stellar weather. I packed too much clothing, and my sleeping pad  was crappy. I also thought that the one person tent was a little difficult for me with dew on the sides.   My mountain bike with 2.8 knobby tires was also difficult on the 50 mile leg of the ride. We will be all the wiser on our next trips.</div>","author":"Robert Lyon","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_492641","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Discomfort isn’t a risk, it’s a guarantee. The more you get out of your comfort zone, the easier it will be to deal with those feelings.</div>","author":"Carter AL","gender":"NEUTER","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_305791","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Stop, find shelter, wear something warm, eat something, reflect on the magnificent ride you’ve had, and remember that discomfort will pass. But only if you have the clothing, food and shelter. \nI’d say at the time and with your experience, you made a good decision, and you’ve gained from the experience through reflecting on it. \nThis is all part of the personal growth of a bike packer. \nThank you for sharing. 🙏</div>","author":"Steven Fish","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_379726","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Sounds like overall you had an experience that adds spice to life- great adventures make great stories! As you hinted at, safety is the number one thing. Get yourself safe, make the assessment. We don't know our boundaries until we push them- and it sounds like you're ready to continue on! Live in the moment - someone, maybe on this form, said something about the difference between fear and caution - that fear leads to lost experiences, caution opens the door. Good on you!</div>","author":"Hank Rowe","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_523215","type":"fbcomment","data":{"text":"<div class=\"comment_text\">2 phrases someone once told me that I now live by,….”There’s no failures in bikepacking, just lessons for the next trip” and “every trip is a shakedown ride for the next one”.  They have served me well in getting more comfortable on my bikepacking adventures, and building skills. Good luck!! You can do this <span class=\"ce-fbcomment-quote\" data-quote=\"Tyler\">!!</span></div>","author":"Allen Green","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_3578","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Just keep at it. Don’t look at it as a fail…look at it as an experience. You’ll get it, just don’t be so tough on yourself! It happened to everyone at some point, when we were just learning. Myself included. Besides, it’s WAY smarter to bail on a situation you don’t feel comfortable in, than it is to have a “do or die” mentality…you’re awesome, and you’ll figure it out! Just keep trying, and remember- it’s about having fun, so if it’s not fun, change it up so that it is!</div>","author":"Rollin Downhill","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_579151","type":"fbcomment","data":{"text":"<div class=\"comment_text\">80%fun and exciting 20%drudgery</div>","author":"Gary McClintock","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_942485","type":"fbcomment","data":{"text":"<div class=\"comment_text\">You did the right thing.</div>","author":"Bob Cox","gender":"UNKNOWN","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_159386","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I just saw this. First thanks for sharing and I'm glad you are ok.  The second part is that I believe everything happens for a reason. At the end of the day if you get badly hurt then there might be no next time.\n Take it as a learning experience. No you know what is like to be under those conditions. \nThink what you would done differently. Your clothes and equipment.\nDo you have a weather app that would help you anticipate how bad the weather was going to be or where were you in relation to the storm.  \nI use My Map app on Android OS. It have helped me many time take shelter before the storm hits or keep moving knowing the storm was heading in the opposite direction.  Just an idea.\n\nAbout regrets, it's normal. Everytime I come back to the apartment I go thru a process of reset. Thinking I could have stay longer. \nAnyway. Stay positive, better prepare next time and be safe.</div>","author":"Murati Humberto","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_667304","type":"fbcomment","data":{"text":"<div class=\"comment_text\">We have regrets about something when Bikepacking . You make a decision if it really ans issue for you and figure out how to get past it otherwise don’t bother going out if it gives you too much anxiety. This is supposed to be fun , relaxing , challenging  either all or one . Keep at it . Oh ans if you don’t like bears wolves ans cougars don’t come to the Canadian Rockies we have plenty of those here 😉</div>","author":"Aydin Odyakmaz","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_71034","type":"fbcomment","data":{"text":"<div class=\"comment_text\">What doesn’t kill you makes you stronger? 😏. I too( as assume most) will shelter with active lightning. Always be ready for plan B, C, D. Lean to or motel for a nights stay sometimes. Zip lock bags are great for electronics too.</div>","author":"Lee Hollenbeck","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_784137","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I think your experience is much more common than people like to admit. Bikepacking is a learning experience with almost unlimited variables . Every time i do a big adventure, something that has never happened before, happens. So it’s an interesting mix of learning from your mistakes, improving your adaptability, gaining confidence in overcoming adversity , and trusting your instincts to bail when you should bail. \nIt wouldn’t be fun if everything went perfectly according to plan.</div>","author":"John Stamstad","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_9612","type":"fbcomment","data":{"text":"<div class=\"comment_text\">John Stamstad I definitely agree with you on all this BUT I personally don't believe in or teach to bail...even if instincts say so...  that IS the biggest one to contempla and overcome IMO. The mind is tricky and we can all do more then we think we can.</div>","author":"Jay Petervary","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_564516","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jay Petervary\"> , I think John is aware of all of that! Look him up!</span></div>","author":"Ron Watts","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_278663","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Rain\nNeed to prepared for that happening\nElectric items in a plastic bag when not in use\nRain gear packed so very easy to get to\nKeep in mind you got into some very serious weather \nThat doesn’t occur that often or bike touring, hiking wouldn’t be that big of a sport \nWhen the storm passes you have to first get dry and your equipment also\nAt minimum stop and let dry in sun\nNext choice a self service laundry shop\nNext a motel \nIf you can’t get the equipment dry in a day\nThan decide what to do next</div>","author":"Charles Nighbor","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_267572","type":"fbcomment","data":{"text":"<div class=\"comment_text\">No cotton \nWear fabrics that dry fast</div>","author":"Charles Nighbor","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_813538","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Two tarps \nIf possible first tarps if raining goes up above tent between trees\nThan ground tarps\nThan tent\nThan gear out off bike into tent\nDinner next\nBreak down tarp above tent comes down last if still raining\nWet tarps go into a plastic bag’s</div>","author":"Charles Nighbor","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_250035","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Keep in mind that is in very bad \nWeather conditions can require bail outs\nIn your case you needed to get to a town Dry gear\nCheck weather \nThan decide call it quits or keep going</div>","author":"Charles Nighbor","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_93012","type":"fbcomment","data":{"text":"<div class=\"comment_text\">When you get stuck in really nasty rain, I find the best thing to do is find a huge puddle and full send roost that sucker. You'll be laughing your arse off afterwards and it goes from misery to fun real quickly.</div>","author":"Brett Hack","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_698152","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Bailing\nWhen touring the first place is the next town.\nGet gear dry\nGo thru your equipment to see if all go to go\nIf not can it be replaced \nThan replace it in that town or soon down the road\nOr my next mail order\nYes cost is a factor \nFactor all that in\nAnd decide\nI bailed once has my tent leaked and no answer to solve it</div>","author":"Charles Nighbor","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_476335","type":"fbcomment","data":{"text":"<div class=\"comment_text\">You conquered!!  Maybe not what you set out to do, but hey, you got on your bike and rode into the sunset.  Win, in my book.  Next time it might go better.  You can check the satellite weather, pack differently, many things you could change to overcome those experienced challenges.  But, you may find that every time there could be something your forgot about.  Give yourself credit for what you did achieve.</div>","author":"Stephanie Allen Fuller","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_376589","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Lightning is what it is. If it doesn't cause a little anxiety, you're not self-aware. That said, at least here in the states, you can pull up weather radar and see storm pattern to assess what you're looking at to decide if it's worth waiting out. As far as discomfort, it's just a judgement call. Once you get dumped on, it's uncomfortable in any direction. It's gonna pass eventually. Just need to decide which direction is worthwhile. Nothing wrong with bailing if it makes the most sense. Route will still be there later.</div>","author":"Barkley Phan","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_697597","type":"fbcomment","data":{"text":"<div class=\"comment_text\">It’s situational and always best to make a decision based on your safety. It’s very easy to get into trouble especially if alone and wet/cold. Being close to home can give a false sense of security. \n\nI honestly think you made the best choice. Getting hurt by a falling try whilst alone and cold could have dire consequences. \n\nThat said. If I need to motivate myself I think of those times I went for a ride in bad weather and something amazing happened. Or I stop and call someone for moral support or to get a second opinion.</div>","author":"Mark Vernon","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_940558","type":"fbcomment","data":{"text":"<div class=\"comment_text\">While out on the bike, in a forest, lightning once struck next to me about 30 yards away…. while in a sudden torrential downpour. I had an out of body experience and once I returned to my skin, I assumed it a message from God! I could not pedal fast enough to get home!! Safety first!!</div>","author":"Jimbo Pike","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_544411","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Anxiety is probably more common than many like to admit. I understand your concerns. I have two little mantras that I use to push me through:\n\nIf afraid to go, go anyway. Go with fear.\nIf one person can do it, so can another.\n\nThe second one informs the first. I am astounded everyday when I read what others have done bike packing. Sub-zero weather, bears, war zones... I am pretty sure that most had some anxiety around the first step of that journey. They started anyway. Look at all that bike packers (and humanity) have accomplished. It is highly probable that you will survive your adventure. If not, you will go down in legend. \n\nPrepare the best you can. Trust that you will make it.\n\nLong may you ride!</div>","author":"Chuck Perry","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_515997","type":"fbcomment","data":{"text":"<div class=\"comment_text\">If trees are being blown down, not only is the weather not cycling weather, but it's really dangerous. So stopping ride was the sensible thing to do.</div>","author":"Jeremy Lawrence","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_135577","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I have bail before because of a thunderstorm. Like you, ￼I wish that I hadn’t.￼. Oh well, do overs.</div>","author":"Sheila Kitchen Irvin","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_117752","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Adventure sports are 95% mental, the other 5% is mental. You’ll learn to manage weather and other events as you become more seasoned</div>","author":"Bob Eiserman","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_831896","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I’ve regrouped in a hotel bar, stranger’s garage (local police chief), cave, ranger station, fire station, and up a tree. A couple times I misjudged and weather turned better. \n\nTwice, I likely avoided needing a rescue or multi-day shelter in place as those who proceeded were snowed or rained in for a few days. \n\nYou have to make a decision with imperfect information and I’d rather try again later than be the story rescue trainers tell to trainees,</div>","author":"Jim Lee","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_194998","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I wonder how you'd feel about trying the same route again under different conditions (i.e., more experience, different weather, etc), and whether that might provide you with some of the answers you're looking for. Good luck out there!</div>","author":"Jeff McDavison","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_671944","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jeff McDavison\"> I was thinking about going Tomorrow and Thursday, but I don’t have waterproof socks yet and the wind is expected to be strong</span></div>","author":"Tyler Newcomb","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_19809","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I always make my bail out plan somewhere in the nonexistent to really inconvenient range so it’s way harder to bail out than stick it out. That being said I have had to pull the plug on bike packing trips and I am always bummed even if it was the best decision. I think the best policy is to always keep your safety in mind first and foremost. If you feel like you might get wounded and need to be pulled out by emergency workers then you probably should rethink your plan. Otherwise the inconvenience factor always works for me.</div>","author":"Andy Phillips","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_186013","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Next time you will go armed with the experience from this time..... You will know it's ok to carry on, there will be other challenges but you'll overcome those as well.\nEnjoy 🤘 🚲 🏕️ 🚴‍♂️\n<a href=\"https://youtu.be/0oCnpAvtS34\" target=\"_blank\" rel=\"nofollow\">https://youtu.be/0oCnpAvtS34</a></div><div class=\"comment_attachment\"><div class=\"link-tool\"><a class=\"link-tool__content link-tool__content--rendered\" target=\"_blank\" rel=\"nofollow\" href=\"https://l.facebook.com/l.php?u=https%3A%2F%2Fyoutu.be%2F0oCnpAvtS34&amp;h=AT1fYQXrfl15tOCCPqSQIIKgL3N6LHWXD-XynWtmZNXLbvDI6yBC58j7N11tLatAybq4Am8q7at11u5sHwhSJqJJzdMhSJINMEATXQxtujByqQW8HSD1VturoaOaCovxvcU3HwYxbQKkA48&amp;s=1\"><div class=\"link-tool__image\"><img loading=\"lazy\" src=\"https://i.ytimg.com/vi/0oCnpAvtS34/hqdefault.jpg\" alt=\"\"></div><div class=\"link-tool__title\">Cycling the JOGLE for Charity | DAY 10 Cheshire &amp; Shropshire | Amazon Distribution Centre Wild Camp!</div><span class=\"link-tool__anchor truncate\">youtube.com</span></a></div></div>","author":"Mark Randlesome","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_869859","type":"fbcomment","data":{"text":"<div class=\"comment_text\">No worries thats how we learn. Experience is a better teacher than any advice someone can tell you offhand. Having said that, I've made sure every one of my bikepacking bags are waterproof, and I pack them so worst-case scenarios can be dealt with quickly. Raincoat and first aid is at the top of any bag they live in. Electronics can be convenient to get but protected from water when not in use. Knowing that if it starts dumping rain I don't need to worry about anything except getting to safety makes me feel better than having to think through all the vulnerable equipment in a moment of panic.</div>","author":"Mike McChesney","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_456105","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Don't worry we all bail in one moment or other, nothing to be ashamed. Just have your belonging in the right bags, what can get wet doesn't matter, but electronics, wallet, cellphone,etc alway in plastic or drybags. Try to get cover when you see is getting bad, don't wait till is a nightmare. I talk to myself like:If you quit now, for sure in 3 hours is the sun out or tomorrow will be better. Find refuge where you can let it pass, don't take important decisions in stress, sleep it over, if you have to get a hotel...do it, the next day you will feel better and if not...then get the hell out, I always hear to my inside voice and til now never regret it, better sad and safe than sorry! Safe rides!</div>","author":"Olie Grønn","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}