{"time":1658905437740,"version":"2.23.2","blocks":[{"id":"id_956944","type":"header","data":{"text":"Crossing the Iran-Pakistan Border by Bicycle","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_374615","type":"paragraph","data":{"text":"<i>Hi everyone...Has anyone here crossed borders between Iran and Pakistan by bicycle? apparently it's a dangerous crossing especially the Pakistani side seems to be an issue.  Any advise, tips or alternatives are more than welcome.  Thanks  😄</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_806757","type":"delimiter","data":{}},{"id":"id_745057","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Seems like a convoluted way to die.</div>","author":"Bry Dickerson","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_41149","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Alternative is don't attempt, go anywhere else. Westerners are a target for ransom kidnappings. Even if you manage to get someone to pay, you still might not leave with your head attached</div>","author":"Adir Sharon","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_444936","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Prepare for the best</div>","author":"Tedi Kresna Wardhana","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_212876","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Avoid risks my friend. Better pickup another path, afterall we are all out for enjoying ride, avoid places with conflicts</div>","author":"Sriram Mutnuri","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_97348","type":"fbcomment","data":{"text":"<div class=\"comment_text\">It would be interesting to read feedback from people who have actually done it as the OP asked, otherwise the comments above are as valuable as if i say there have been terrorist acts in most of the western world main cities and shootings in schools in those \"safe\"countries ...</div>","author":"Tomas Aperlo","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_702069","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tomas Aperlo\"> You are mistaken. If you do not believe me, read the official tourist travel recommendations about Iran from the Belgian government. Luc lives in Belgium according to his profile, so he is likely a Belgian. It is currently NOT safe for Belgians ! All other nationals : do not hesitate ! It is my number one destination.</span></div>","author":"Bart Viaene","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_346473","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"<span class = \" ce-fbcomment-quote\"=\"\">\"&gt;Bart Viaene I am not sure Luke cares about travel state recomendations neither do i, this might be the reason he is here asking for first hand opinions from travellers,  Iran is perfectly safe, actually it is ussually among the top countries for world travellers and often rivals with Turkey as been the most hospitable people, i had several warnings from visiting certain countries like Venezuela, but then i only met amazing people, on the other hand i got a bike stolen in the usa and several times about to be run over by crazy traffic, and i guess Venezuela is as well within the \"axle of evil\" countries ... by the way i also dont understand why you say by my comment before that i am mistaken, about what ???</span></div>","author":"Tomas Aperlo","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_947456","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tomas Aperlo\"> You are perfectly right but it is NOT safe at THIS moment for BELGIANS. We are about to deliver a convicted Iranian terrorist linked to Swedish bombings to justice. Iranian government has taken several Belgians hostage on accusation of spying (!) : they hope to exchange them. Belgians should steer clear of Iran until this is resolved.</span></div>","author":"Bart Viaene","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_718127","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Bart Viaene\"> i wasnt aware of that, probably he wouldnt even let in the country anyway if it is so, same happens with the uk and usa it seems, all politics more than safety concerns in the streets, i dont imagine the common irani people targeting him because of being Belgian, a shame</span></div>","author":"Tomas Aperlo","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_32847","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I never said anything about Iran being dangerous! I've been to many places that are considered dangerous by media, governement... but had some of the best experiences at those places.  That's indeed why I put this question here.  According to the replies here I think it's wise to avoid Iran for the time being.  and with many landborders being closed in that region it won't be easy to cycle to India any time soon it seems.</div>","author":"Luc Hapers","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_557376","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Luc Hapers\"> govmt's will even consider dangerous when i post on fb about the use of medicinal herbs and how they helped me with my chronic lyme disease, let alone going to iran or pakistan or venezuela which i loved 😂, but in this case it seems it would be more of a political trouble for you better to avoid, enjoy it wherever you go, im thinking of doing morocco to senegal</span></div>","author":"Tomas Aperlo","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_421472","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Thanks for the replies. My initial plan was to cycle Pamir Hwy and/ or Karakoram Hwy to get to Pakistan and India but october-november might be too late to cycle either one of them...Or not?</div>","author":"Luc Hapers","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_168266","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Luc Hapers\"> Luc Hapers sounds like a great plan !!! I havent been in that corner of the world yet so i cant give you advice on safety or weather (though november sounds as it can be snowed in already) but i ve read of people that crossed all those borders and also did pamir in winter, anything is possible i guess, take in account the risks (from people who actually have been there in the recent time) and get ready as best as you can for whatever you choose</span></div>","author":"Tomas Aperlo","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_734127","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tomas Aperlo\"> i love how you jump to conclusions. I've done both the Pamir and rode through Pakistan. The area from Iran into Pakistan (and many other parts near other borders is very dangerous these day. Years back the Pakistani police would escort you through the danger zones. No questions asked. They put you in the truck with your bike and drive to the next checkpoint, switch cars with a new armed guard police unit, and keep going. They wouldn't let me ride while they follow me like the police in Egypt do now because they were worried we'd all be in more danger. There were areas that they told me these are no stop zones, even for them regardless if it's an emergency unless the car dies.\n\n2. Pamir highway is still closed to tourists. They are not issuing GBAO permits for about a year now. Taliban has issued statements of aggressions to the Tajik govt towards Westerners traveling by the border. The police and military used to tell cyclist/hikers/cars to not take pics, go in the river, stop or camp were they can be seen from the other side of the border to not trigger Taliban before they decided it's safer to just not permit entry to tourists, period. Than there's a different independent terror org in Afgan that has taken responsibility for firing a rocket into Tajikistan. And of course, the riots and backlash between the people of the GBAO and the Tajik police that lead to a few deaths. I was denied access a few months ago. Others I'm in contact with were denied more recently. As of now Pamir is closed until further notice.\n\n3. Regardless the Pamir being open or not, the border between Tajikistan and Kyrgyzstan is still 100% closed.\n\n4. Azerbaijan just extended their land border crossing to remain closed until Sept 1st. A tourer I met in Turkey 1.5 months ago just reported this. He and a few other tourers took a flight yesterday out Tbilisi, Georgia. \n\n5. Do your research first and don't accuse others for not having the $%#&amp;ing personal experience!</span></div>","author":"Adir Sharon","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_189363","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tomas Aperlo\"> who did the Pamir in winter? Where did they get food supplies? How did they handle the -30C temps, winds, and snow storms? sometimes it snows at the +3500 in July and August. Sept is the last month you want to reach the summit by - with a lot more likelihood for snow. Nov to March is the snow season. The road remains open but there is bare any traffic through it. Is it possible? Yes. But it is a miserable unnecessarily dangerous experience like climbing Everest in winter. Summer is cold enough. Winter it flirting with death</span></div>","author":"Adir Sharon","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_654413","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Adir Sharon\"> but it is possible, i personally know 3 people who have done it, lorenzo barone (he also did the transiberian and also reached the artic north of yakutia just following frozen rivers), the other two a couple i personally know too, pedaleando sueños, yes, it is not easy, ive camped out at -20 c several times too, met some armed druglords in colombia, crossed the mojave desert in august riding 330 km in one day and night, it is life you never know when things can go wrong, in the end what f...ed me was a tick bite at the perfect and peacefull bike paths of central europe so now i got chronic lyme disease and have several health issues because of that, this is what i mean, there will always be some unexpected things, if i was to set off to ride the pamir in winter i would have a good chance to get ready for that, now to avoid getting sick with this thing there were not much alternatives, it is life ...</span></div>","author":"Tomas Aperlo","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_604962","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tomas Aperlo\"> bravo. You're a badass. I crossed Death Valley with a 55kg loaded bike in August when it broke 50C. So what? Heat is easy. At night it cools. You just need water. Cold is a lot harder to survive. \n\nI served in an IDF elite special force unit. Been shot, stabbed, beaten, and done things I never thought my body would ever manage physically in unimanageable conditions in training or during acrice service, combat, or war as a draft soldier and as a reservist years after active duty was over. So what? My experiences and background are nothing similar to the average person on this forum who just wants to enjoy exploring the world safely while they have a few months time and the means to do so to have a \"once in a life time\" unique experience to be proud of their physical accomplishment or broaden their cultural interactions with different peoples to learn we are all one people with the same hopes and dreams and love for humanity but our govts or small fanatical groups screw it all up. for the rest of us.\n\nAfter our active miltary duty service, my childhood best friend and I trained a few militaries and militias in a few South American countries for 2 years. After our contracts I went home but he wanted to trek through Peru with his girlfriend. He got pneumonia in the jungle but was too remote to get to a proper hospital with the meds he needed. The insurance company was too cheap to fly him by helicopter over the mountain range despite having the most premium expensive insurance to cover EVERYTHING. Took over 6 hours to reach the hospital by ambulance. The helicopter ride would have reached it in about an hour. It was too late. He died a few minutes before reaching the hospital. Eventually, after reaching the Israeli supreme court, the insurance company lost the case so hopefully it won't happen again to anyone but it won't change the fact that he is still dead. \n\nDoesn't matter what a hardcore bad ass mother fucker he was in the military days hunting terrorists all over the world, suviving the mortor shells and gunfire we had to escape from on our own without a large scale miltary rescue option - he survived finding his way back to Israel through hostile enemy land when he was separated from the rest of us. He survived the conflicts we had in South America during our contract when our convey was attacked once in the jungle and a different time when a guerrilla force attacked a military base we were training SF soldiers out of. \n\nHe survived all that. But a tiny little invisible bug killed my \"superman\" brother-from-another-mother. We were inseparable since we were born all through school and managed to both be selected and passed the trainings into a very hard to get into unit until his untimely shockly death. That stuff doesn't happen to us - was our arrogant way of thinking back then. I travel around the world now for 5 years so far with no date of when I'll stop because of him, and for his memory.\n\nYes, life happens. Guess what? Most people on this forum aren't bad ass mother fuckers with speicalized training or experiences wanting or willing to risk their life because they are young with an ego that \"it\" won't happen to them and want to prove that they can be one of the few to survive crossing the Pamir in winter, walk the frozen ice sea from Alaska to Russia (despite it being illegal with both countries having military outposts on the islands between yet it's been done before by a handful of people) or want to be the ones to cycle through Afghanistan, pakistan, Yemen, Syria etc to prove it's \"safe\" because they were the lucky ones to manage to not get caught by different fanatical terror groups.\n\nAnything is possible but not everyone wants to risk their life to do so. And I doubt the OP, with how little he even knows about the region he wants to explore understands the risks or challenges because his western privilege upbringing makes him think/believe he can just travel to any country or area in the world because his passport permits it. \n\nYes, most of the world is way safer than the media makes it out to be and most people are terrific, friendly, kind, and hospitable. Unfortunately, not everyone or everywhere is like that. The very few places it's not safe for a white privileged westerner like us to be happens to be where he wants to travel to because it sounds cool to go where many of us haven't. There's a reason for that. Govts don't randomly put x countries or regions on a travel ban... Yes, most times the likelihood of a bad encounter is slim but it increases drastically when you're alone in a remote area on a bicycle in a region terror legs hide out control, or operate from. It's different than being one of millions in the middle of Islamabad…\n\nIsrael will start an international conflict to rescue any of its citizens. They will negotiate with terrorists (they do it on a daily bases) and will pay a ransom to save a beheading. The US will not. \n\nWill your country come to your rescue? Will your insurance actually pay for what you assumed they would?\n\nI feel \"safe\" knowing as an Israeli citizen my country will come to my rescue. I mostly use my Israel passport to enter countries. I use my American passport and citizenship privilage to enter countries i can't on my Israeli passport like Malaysia, Indonesia, etc. But I won't enter the fsnarjcal one like Syria, Iran, or Lebonon that would use any Israeli citizen caught within their borders as an excuse to start a war regardless if the people of Iran are the best in the world and it's super safe therr for cyclists, their govt isn't so friendly or hospitable. If they discover I'm an Israeli citizen, regardless my military background of days long passed, I'll be locked up, beaten, tortured, and used as an excuse for Iran to start an international conflict or possibly a war claiming they caught a spy. \n\nAgain, just because \"some\" have been there or done that, doesn't mean it's possible or safe for others to do it now. Right now, every single western country, and most of the world, has a strict travel ban for its citizens to enter Pakistan by land borders. A non-Pakistan citizen might not even be permitted entry if it's a hot zone by x border. And that can change daily based on their country's intelligence community information and recommendations.</span></div>","author":"Adir Sharon","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_165272","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Adir Sharon\"> i think anyone is free to cycle the pamir in winter and even enjoy it, people in this forum are more adventurers than tourists, later on everyone will take its own desitions, it is not on you to decide is something is worth it or stupid for someone else, or if we can even enjoy it as there are many proffesionals dying in the army or climbing everest or driving a truck, i can also say that to me risking your life in the military would be stuppid and also unnethical, but i didnt so my opinion doesnt count on your actions, only yours, clear as water, again open the window, people are getting shot in schools in safe countries, risk assesment = have a gun in your pocket? I dont think so, then, have you been to Pakistan or Iran with a bike? This is what the OP is asking here, dont try to lecture people about things you didnt even do, you did plenty it seems, but not that</span></div>","author":"Tomas Aperlo","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_70789","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tomas Aperlo\"> Pakistan on bike yes. Iran no. Iran is very safe for cyclists but Iran won't allow me to enter because I was born in Israel. Like I said, in Pakistan, the police forced me to get into their pickup trucks (with the bike) and took me to an area they deemed safe. This was 4 years ago, when it was safer then today. Now it's a war zone. But unlike the war in Ukraine (or if you go to Israel during a war), where either side will let you be. In Pakistan, and Taliban controlled Afghanistan, a western tourist is a wet dream. It does 2 things: raise money if a ransom is paid or increases fear to the enemy after a beheading if ransom isn't paid.\n\nYes, you can get hit by a truck. There are many ways to die. But they're are only 2 branches - ones you control, and ones you don't. You drastically reduce your chances of death by not entering war zones or areas controlled by terrorist groups from ISIS to the Taliban, to Hamas and everything in between. When you enter a country your country has a do not enter ban on, should anything happen, they aren't coming to save you to avoid an international incident. The only country that does, if a covert operation is possible, is Israel. But no Israeli is dumb enough, or selfish enough, to enter a banned country. No one wants to be the reason for a war with more people needlessly dying. It's enough we have to join the IDF to protect ourselves from countless enemies who want to finish what Hitler started.\n\nGo cross the Pamir in winter. Climb Everest in dead of winter - you won't have to wait in line for a selfie on top. 4 cyclists were killed in the Pamir by Taliban a few years ago. It was a on time time. I'm used to terrorists. They used to happen a lot in Israel. It's a risk we can't control because we live there and the odds are small you will be killed in an attack. Same for the Pamir (which again, is closed to travel right now). But the odds of getting kidnapped now in Pakistan, Afghanistan, and Yemen are extremely high. 1. Most of us here are white. 2. We're on a loaded \"fancy\" bike. Both = money. Money = buying more guns or bombs. We are a walking lottery ticket in a desert where we can't simply blend in and get lost in the crowd where there is safety in numbers.\n\nI responded to the OP because his complete ignorance in his post demanded that. Professional tourers/adventures don't ask dumb ignorant questions. They have enough knowledge of the world we live in and they do their research, they don't ask on a Facebook forum. That's what your regular tourist does…\n\nAnd no, bike tourers aren't much more experienced than regular tourists. Maybe 20 years ago, that was true. Today, with so much expendable income, and a change of priority for experiences over materialism, most bike tourists are regular people looking for a different way to tour. They come across YouTube or other social media pages like this one and thing, wow, that will be fun. Let's do a trip like that. Most don't do more than a month. Much fewer travel continuously around the world or go to areas Westerners can be targets. A few, like the OP want to adventure into areas others don't to be one of a \"few\" but there's a reason there are just a few travelers crossing borders into no travel ban areas. \n\nSo many backpackers and bike tourers today do the same route. The banana pancake in SE Asia, and the Eurovelvo routes. That's not very \"adventurous\" IMO to go where everyone else goes and see the same things. that's a tourist, not an adventurer bushwhacking through areas not on the Google map or going to none tourist places. Even the Pamir in the last 5 years has turned into a tourist attraction rather then the unique adventure it was 20 years ago where the nomads hosted you for free - now many of them turned their genuine cultural hospitality into a homestead business. Our tourism boom is chsnging their way of life. And not for the better IMO</span></div>","author":"Adir Sharon","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_332013","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Adir Sharon\"> i appreciatte that you share your experiences and agree on some things, some other i dont but this is ok, the safety concerns also depend what is your personal situation as i come from a country where you can easily get killed over a cell phone regardless of if you travel by bike or not, it is just an every day thing as are the school shootings at the usa etc, i wouldnt go in a region in conflict not only for my personal safety but also because i think it would be a bad thing to go there if i am not doing it to help with consequences of that conflict in any way, there are some regions in pakistan that are ok to go some others not, ive been to venezuela and had an amazing time and people where amazing to me, on the other hand i was not welcomed and close to near death situations at the usa midwest.\nNow about the safety concerning physical challenges, you could do pamir and siberia in winter, of course it is clever to think the risks beforehand and of course i wouldnt call for help if something happens, ive been at desolate places for weeks at a time where there would be no way to get help anyway if anything happens and i was carrying all my food, water, tools, i was as much prepared as i could be, then some like you might think iam taking unnecesary risks or that i am plain stupid but it is all matter of perspective, because an obese guy in his couch watching tv, smoking might think the same about other person on an easy trip on the danube in austria, or drivers in israel about cyclists on the roads ... i have enjoyed much the nights camping out at -20 and desolate places, not trying to impress anyone but myself with all the feelings and sensations of doing that, i do both the danube like trip and the other kind and i can tell you that i enjoy much much more the second one and that the handfull of \" near death\"  situations i got in my life so far where all in a ussually very safe places in all its aspects, natural, geographical, political and crime wise.</span></div>","author":"Tomas Aperlo","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_321745","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Adir Sharon\"> What gives you the right to call me ignorant? You  have no clue at all of what I've already done in the past! 😉</span></div>","author":"Luc Hapers","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_737047","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tomas Aperlo\"> so far of the 81 countries I've been to on a bike + the other 32 I've been to when I was a backpacker, the US is still the most dangerous country I've been to where I felt unsafe. I grew up there from 11-17. I that time I was robbed at knife point in NYC outside port authority at 8am (hundred of thousands of people go through that station daily) with cops standing on the opposite street corner and not a single person helped or went to the cops. I had black kids point a fun at me twice thinking it would be funny to scare me. A gang had one of the new recruits beat me up for his initiation. I've been doing krav maga and traditional Japanese karate since I was 7. I was 15 at the time. I put him in the hospital and they tried to recruit me. A kid I thought snowboarding was gunned down a year later at a movie shooting in Aurora Colorado (the Batman movie). The GM of the slide sort I worked out was shot in the cheat and head when a liftie had a metal breakdown and was tripping on some anti religious tirade looking for 2 other employees that skipped town before he found them. The daughter of a business partner in a different venture I was co-founder of was murdered in Phoenix because she didn't have cash to give the robber. But I've also been to all 50 states and these things are rare and only happen is certain areas. Middle of nowhere US is pretty safe. You just need to know where not to go which is why many if not most Americans think the US is safe and the rest of the world is dangerous - they know where to not go and stay within their bubble suburban communities. I was on a bus through Columbia when a guy got on, shot the driver in the head then told us to give him is money. Regardless my military experiences and training hand-to-hand combat to SF soldier and presidential body guards in s. America, I was not going to risk my life or the other passengers for a few dollars. He killed the driver so we know he means business. His intentions after that weren't to kills all of us so not worth the risk. I don't live in movie. I only use my skills if it's life or death which so far has never been the situation. Everything except my life is replaceable.\n\nPakistan borders are steep mountains. Rebels, terrorists, whatever you want to call them hide out in those regions. Almost all the borders are currently deems too dangerous. If you fly in, you'll be fine. But if you cycle you will eventually reach the danger zones. Safest borser is the border with india but Kashmir has a lot of civil unrest and terror activity with tensions between the two countries and military operation can explode any day. But if it's safe enough for the people who live there,  it is an acceptable risk for people like you and me. But when the police were afraid to stop anywhere between the checkpoints when they escorted me, that a big tell the place isn't safe for anyone</span></div>","author":"Adir Sharon","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_86493","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Unfortunately Taftan seems the only border you can cross. Highly recommend to take the bus to Quetta. After these town you have to decide what to do.</div>","author":"Peter Richter","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_860899","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Peter Richter\"> How about the Iran/Turkmenistan border? I'm not able to take a bus because of the trailer attached to my bicycle. It's too big to be put on a bus.</span></div>","author":"Luc Hapers","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_982604","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Iran/Turkmenistan already closed. Nobody knows when it will be reopen.</div>","author":"Peter Richter","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_724251","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Avoid</div>","author":"Wayne Croning","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_638292","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Are you a Belgian ? Then stay out of Iran until the situation about the captured terrorist is resolved because Iran has imprisoned random Belgians to try to exchange them for the terrorist. Once it has cleared, by all means go visit Iran : it is really beautiful ! I've been in Kerman lately, which is close to Pakistan. The Kalut desert is absolutely gorgeous !</div><div class=\"comment_attachment\"><div class=\"comment_photo_attachment\"><img class=\"comment_photo_image\" loading=\"lazy\" src=\"/images/community/crossing-the-iranpakistan-border-by-bicycle/image_1658905437_7272085216.jpg\" alt=\"\"></div></div>","author":"Bart Viaene","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_707761","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Yes I am! That's a shame! I would've loved to visit.</div>","author":"Luc Hapers","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_453653","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Just make a detour until the situation clears.</div>","author":"Bart Viaene","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_298265","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Someone posted about Iran yesterday. Depends on your nationality \n<a href=\"https://www.facebook.com/groups/bicycletravellers/posts/1000710190637767/\" target=\"_blank\" rel=\"nofollow\">https://m.facebook.com/groups/bicycletravellers/permalink/1000710190637767/</a></div>","author":"Monique Menard","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_895581","type":"fbcomment","data":{"text":"<div class=\"comment_text\">With the present Political situation, it's best to avoid. FLy to India and continue. \n\nIf you are planning to travel further east to SE Asia, Myanmar is also best avoided right now. Or take the longer route through Nepal - China etc.</div>","author":"Junaid Parvez","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_483322","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Junaid Parvez\"> Well, flying is not an option in my case because I have a trailer attached to my Bicycle. My plan is indeed to travel further to SE Asia.</span></div>","author":"Luc Hapers","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_22288","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Luc Hapers\"> hmm. As people have already commented and are aware that there some are issues in all the countries North of Afghanistan.\n\nIt’s best you check with the officials those countries and plan out properly.\n\nThe last options are,-\n-  send the trailer through courier like DHL etc to India. Get the bike along on flight to Mumbai. Travel in an around Mumbai. Later travel further, once the trailer arrives.\n\n- work out something with some shipping company and travel to Karachi / Mumbai.\n\nI don’t know what’s the ground reality in Pakistan is. News media always exaggerates.\n\nBest of luck. Hope something works out and you’re able to make your travels. 🍻</span></div>","author":"Junaid Parvez","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_955783","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Junaid Parvez\"> Thanks for your reply.  I'm thinking of travelling without the trailer, put my bike on a plane to Pakistan or India and start riding from there.</span></div>","author":"Luc Hapers","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_364903","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Luc Hapers\"> That's actually a good idea. But, do keep on monitoring situation in Pakistan right now. If not stabilised, conditions may turn similar to whats happening in Sri Lanka right now.\n\nI'm sure there are many Pakistani riders here as well, who would be able to tell you about the situation on ground.\n\nAs such because of the high population density as well traffic density in most of the South Asian and SE Asian countries, riding with a trailer won't be a great idea.\n\nWhen in India, do join a FB group called Cyclop, its the most active group and there are riders form all over the country. For any info or help in any corner of the country, just post it there. Someone or the other will help you out.</span></div>","author":"Junaid Parvez","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_846401","type":"fbcomment","data":{"text":"<div class=\"comment_text\">You are more likely to be involved in a road traffic accident than shot kidnapped or blown up by terrorists. Wear a helmet and cross tbe border. The pakistanis are extremely welcoming and helpful.</div>","author":"Tim Hobin","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_670233","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tim Hobin\"> It depends where you are ofcourse!</span></div>","author":"Luc Hapers","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}