{"time":1655143302127,"version":"2.23.2","blocks":[{"id":"id_720814","type":"header","data":{"text":"How Do You Finance a Long-Distance Bicycle Tour?","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_812939","type":"paragraph","data":{"text":"<i>Greetings 🙂\nI have a question for all of you who travel and maybe live \"on wheels\". How you finance your long tours and that style of living? Is there any way that you can travel on budget without working and being modern slave of job? Any solution for stable money income that can provide you to live like you want? I can't wait for retirement, I want to enjoy life while I'm young and healthy....\nI don't need much, just as modest as possible, food, water, shelter for sleep and it's enough\nAny solutions for this problem???</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_98484","type":"delimiter","data":{}},{"id":"id_392685","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Make some savings and you can travel with not really that much</div>","author":"Mattis Blÿ","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_787496","type":"fbcomment","data":{"text":"<div class=\"comment_text\">You will need money for legally crossing any borders. \n\nYou might need first aid,  a doctor and/or vaccination as well.\n\nMaybe your dreams are not realistic.</div>","author":"Taraneh Wilden","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_357720","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Taraneh Wilden\"> he didn't mean travel for free but on a budget. It's realistic. Have been doing that for 8'5 years and know many others</span></div>","author":"Ewa Świderska","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_640024","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Ewa Świderska\"> how did u started?</span></div>","author":"Игор Лепушина","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_536764","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I sold my business and nonprofit but don't use any of my savings. Last 5 years of continuous travels, I work winter seasons as a full cert snowboard and ski instructor trainer and freestyle/freeride coach and guide in Japan to ride out the winter months, get a break from being alone on the road, and do my other passion - passing on my winter sports passion. \n\nWhat I earn in Japan is more than enough to fly anywhere, afford hotels when I need to be spoiled, and even save more than half my earnings. And the best part, I get residency there to compliment my other 2 citizenships. The company takes care of my work visa and finds me an apartment. I just need to show up :)</div>","author":"Adir Sharon","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_102474","type":"fbcomment","data":{"text":"<div class=\"comment_text\">And I take one credit card (Venture by Capital One) that has zero international charges and earns me miles. When I need cash, I use a Schwab debit card. They don't charge ATM fees anywhere in the world. At the end of each month, they pay all the ATM fee charges I incur so I don't need to think about the high costs of pulling out small amounts of cash in the currency of the country I am in</div>","author":"Adir Sharon","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_907285","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Adir\"> they hiring ski instructors? 😆</span></div>","author":"Jeff Roe","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_468651","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jeff Roe\"> they still have closed borders to tourists so it's been a difficult 2 seasons</span></div>","author":"Adir Sharon","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_667320","type":"fbcomment","data":{"text":"<div class=\"comment_text\">find a sugar daddy.</div>","author":"Richard Reitman","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_475792","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Work some months and go ride for a while. Perpetuum mobile. And so on.\nIt's about sacrifice, or you live a normal boring uninteresting life or you live free, it's all up to you.</div>","author":"Nicolas Ossysek","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_85384","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I am lucky to own a small studio flat that I've been renting and that's the only but best stable income that might be, even though we talk about like 300 EUR/ month. Enough to live on in many countries like SE and Central Asia.\nApart from that I started to work a bit online, but with that you have to rent a place and plan. \nAnd last 3 years lots of housesitting.\nHave been doing that for 8,5 years.\nGood luck.</div>","author":"Ewa Świderska","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_17717","type":"fbcomment","data":{"text":"<div class=\"comment_text\">If you want to travel because you dont want to be a modern slave to a job. Then find a job that you love and enjoy going to work to do. I have been a sailmaker for 18 years. I work 5 hours a day 5 days a week. My job is what stops me travelling as I like going to work. But I may retire next year. We have savings, good pensions, no children, the house is paid for. Your question is often asked. But few attain it and even if they do it is only for a short time. Im glad we did it our way.</div>","author":"Steve Lindley","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_659829","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Work as a farmer.... Pay every month for visas, food, drink, if necessary, hotels, approx. 10.000 thb on one side. The cost of flying, and emergencies, insurance, repairs, you have to charge extra. On a tour to tumien (ccp) I had to go to the hospital for 2 weeks, during which time my bike was stolen. Extra expenses!!!!! Those who are not foreseen.... Always have a good trip, and greetings from Thailand</div>","author":"Mic Hale","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_970813","type":"fbcomment","data":{"text":"<div class=\"comment_text\">At 20 yrs of age I was already of the mindset that 12 hrs of work per week was enough to keep me going. I valued my free time more (to read, to sleep, to travel) than working the standard 40 hrs/week. So I reduced my needs, always sought out cheaper accommodation, etc. Of course, over the years I had periods when I worked a lot, even 60+ hrs/week (especially when I had my own business), or in \"corporate\" jobs, but in the end that never made me any \"happier\" nor did it change my lifestyle much. Once or twice I was able to live for a year or two years solely from my savings, but eventually I got back to a \"normal\" lifestyle/budget of 300-400 EUR per month, including the occasional flight, bikes, accommodation, internet, food, everything. For the past decade I've been mostly making that amount by translating or teaching languages via Skype. And now, with Covid, less \"work for money\" but fortunately I'm receiving (started at 62+) a \"pension\" (retirement benefits, so, some advantage from being \"old\"!) and that basically covers my budget. So as a young person, which I assume you are, my advice is: work hard at whatever jobs you can get, save money, travel with that wisely while at the same time investing or developing some sort of passive income (like renting out an apartment, or having some kind of business that doesn't require your constant presence, maybe with a partner, and you take turns traveling), and find some work that you can also do online as you travel (e.g. when I'm cycling, I often have to stop for an hour or two and connect with my clients during the morning or afternoon, or I'll work on translations from coffee shops or rent a room for a few weeks if I need to concentrate on a big job).</div>","author":"Ignacio Duran","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_823129","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Adrian Lancaster\"></span></div>","author":"Amanda Walker","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_355652","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Sell your trip on YT like most do, just one video a week and you’ll have enough to live ok while cycling. About 500€ a month is what most YT bikepackers receive</div>","author":"Marcel Oudhuis","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_392976","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Marcel Oudhuis\"> what is YT? You Tube? How can people make money out of it exactly?</span></div>","author":"Vera Albuquerque","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_745495","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Vera\"> ads get played on your videos and you make money from them</span></div>","author":"Jeff Roe","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_658586","type":"fbcomment","data":{"text":"<div class=\"comment_text\">And donations via Paypal or Patreon are accepted by them.Some bikepackers dont ride for their own pleasure anymore primarily (obviously), Because their main focus is describers hence YT income</div>","author":"Marcel Oudhuis","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_863184","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I would get people's opinions with a grain of salt as the economic situation (jobs, salaries, opportunities, security, etc) vary greatly between countries so some people are more privileged in this regard than others just because of pure luck. I know this from personal experience as I'm Brazilian and lived 15 years in Australia - so I know it's way easier to have a job, earn good salaries, save and have support from the government (if need be) in Australia than in Brazil.</div>","author":"Vera Albuquerque","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_903828","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I totally agree....I'm from Bosnia&amp;Herzegovina, here you hardly can make enough for living, I'm saving many years and didn't save a thing.....so if you live in poor country it's way harder but not imposible</div>","author":"Игор Лепушина","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_17932","type":"fbcomment","data":{"text":"<div class=\"comment_text\">No, definitely not impossible. But not as easy as it is for some who take this fact for granted...</div>","author":"Vera Albuquerque","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_148982","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Hi <span class=\"ce-fbcomment-quote\" data-quote=\"Игор Лепушина\"> ,\n\nI started building my future long before I was ready to travel!\n\nI advise you to start now. You can start your own business and slowly develop it until it can replace your current income. \n\nYou need to have all your processes automated so that your business generates passive income, even when you are sleeping or riding your bike. \n\nIt won't necessarily be easy, let's be clear about that. I'm not offering you a magic solution that will make you financially-free overnight. But I can offer you a business model that works like that. That's what I've been doing for a little over a year and I can work from anywhere, knowing that my business is working for me, even when I'm not in front of my computer. But yes, it takes work. But at least you're working for yourself and not a slave to the system as you say.\n\nIf you think this is something you might be interested in, you can tag me in the comments. I'll be happy to give you access to a free training that explains in detail how it works. For me, it was really eye-opening. \n\nEither way, I wish you the courage to follow your dreams. There are ways to get there and you can be the hero of your own movie. With hard work and determination, anything is possible!\n\nHave a great trip!</span></div>","author":"Patrice Audet","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_559825","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Patrice Audet\"> hi can you give access to the free training  thank you 😊</span></div>","author":"Habibe Chaoui Boudghene","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_66212","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Habibe Chaoui Boudghene\"> sure! It's in your inbox.</span></div>","author":"Patrice Audet","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_318329","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I got tired of working 12 hours a day in a factory...days , nights, always switching.  After 22 years of this, I called it quits and took early retirement at 58. Now I want to travel and see as much as I can, preferably by bike..(first attempt) If I watch my spending and camp/rent hostel rooms,  I may just be able to live my dream.</div>","author":"Wayne Croning","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_381889","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Travel until you run out of money, then find a job for a few weeks and continue, rinse and repeat</div>","author":"Mindaugas Jokubonis","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_147091","type":"fbcomment","data":{"text":"<div class=\"comment_text\">My husband and I have been bickpacking through California for a while. He walked from Idaho to San Diego where he met me and from San Diego we headed North. When we began, our ultimate destination was Talkeetna Alaska but now we'd like to start a home base in Montana. However we are in no hurry as we have been working professionals most of our lives and ultimately decided that we didn't want to get to the end of our lives and only have mediocre jobs that paid measly shillings and caused a lot of stress as the only thing that we did with our lives. I made the decision to take a leap of faith and just know that somehow we would be provided for and we would figure it out along the way which we have. In order to support a very simple but fulfilling lifestyle. What I usually do is I post in each community's Facebook page that we are backpacker/bikepacker's  traveling the coast of California and living off grid in an attempt to discover all that we can about living free and unbound whilst discovering some of the most beautiful coastline in the world. I would post that we could do odd jobs like house cleaning,  landscaping, building projects, pet sitting, catering help,even shopping.Or if any local businesses need any assistance for a meal or anything else that we may need. The response has been overwhelming. We have not needed or wanted for anything. Instinctively people genuinely want to help. And then by helping you out you are in return giving them a gift of being able to help. Also we go through all the local churches and food donation Banks. Bike co-ops are usually where we do our tune-ups or trade in our bikes. I like to refer as our means of travel as hobicycling since I lovingly refer to our journey as \"On Hobo Road\".</div>","author":"Gabrielle Jackson","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_88767","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Bike not bick...lol</div>","author":"Gabrielle Jackson","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_589917","type":"fbcomment","data":{"text":"<div class=\"comment_text\">never heard of anyone in a developed country who have starved to death because lack of funds. People are very kind to others. With that perspective, living with small amount of money might not be a problem.</div>","author":"Sebastian Frenzel Gabrielsson","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_958158","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Yes. Work hard and put away as much money as possible. Buy the gear you need. Quit when the weather breaks and travel till your money runs out. Then repeat. Work winters travel summers. Keep your eyes open for opportunities along the way to make a few bucks. Or be a trust fund baby. Maybe a rich girlfriend  \ncould be an option. \n  Your welcome!</div>","author":"Ed Weingarten","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_416566","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Ed Weingarten\"> poor girlfriend is hardly a option 😅</span></div>","author":"Игор Лепушина","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_217881","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Depends</div>","author":"Ed Weingarten","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}