{"time":1655553068442,"version":"2.23.2","blocks":[{"id":"id_695196","type":"header","data":{"text":"How Do You Deal with the Rain when Touring / Bikepacking?","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_29092","type":"paragraph","data":{"text":"<i>How do you deal with the rain? I'm planning a couple of trips to Norway and Scotland, both very wet places. I have a Gore ShakeDry jacket and waterproof socks. I also have lightweight Outdoor Research waterproof trousers. Is there anything else you recommend?\n\nI have a treated down quilt, but it always gets wet when it rains hard enough and I worry if the sun doesn't come out the next day (which I have yet to face).\n\nDo you wash your bibs when it rains day in day out? Is it better to wash them and wear them wet? What about wet feet?</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_32078","type":"delimiter","data":{}},{"id":"id_378997","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Maybe a stupid question, but how does your quilt get wet? When I'm bikepacking my quilt is either in my drybag strapped to my bike, or inside my tent (which shouldnt be getting too wet on the inside no matter how hard it rains, otherwise you need a new shelter for such wet conditions).\n\nAs for wet feet, I have not had the chance to test them in wet conditions but I have bike-specific gaiters to cover my feet and calves. I use flats, so I can wear them all day while biking and setting up camp.\n\nThere's two ways to deal with rain for every piece of gear. You can either use drybags, ziplocks and other methods to keep something dry that must stay dry at all costs (phone, electronics, etc.) or pick gear which won't ruin your day if it gets wet (wool vs. cotton since it retains heat while wet, polyester/nylon clothes that dry fast, etc.). \n\nYou can't keep everything dry in rainy conditions, so it's just about protecting the stuff that REALLY has to stay dry and minimizing the impact of soaked gear on your experience otherwise.\n\nPersonally I would make an effort to make sure my quilt stays dry because trying to sleep in a soggy quilt sounds awful but everyone has their own personal comfort zones/tolerances for that kind of thing.</div>","author":"Ian Mark","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_305603","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Gaiters also known as \"overshoes\"</div>","author":"Ian Mark","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_608363","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Ian Mark\"> quilt gets wet from condensation. Not soaked, but wet enough to be a real problem if it was cold.\n\nI agree with everything else you said. Most of that I do already, except when I know it's going to be wet I take waterproof socks. I didn't with me this trip and the rain surprised me.</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_48737","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Ah that makes sense. Sounds like a tricky issue to deal with. We get plenty of rain in Michigan but not to the same degree as Scotland/Norway. I'll stay tuned as I'd like to learn as well, only other thoughts I have are maintaining any DWR on the coating of your quilt and keeping it away from the walls of the tent/shelter if possible. Might have some better luck if you can keep any wet clothes in a vestibule or sheltered area outside the tent too</div>","author":"Ian Mark","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_818168","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Ian Mark\"> I mostly wild camp, so don't have access to a sheltered area. But I do try find shelter when I can. Good point about wet clothes. Oddly hadn't considered that. I tend to travel without the inner tent layer, but will certainly take it for the wet trips. Perhaps that'll make the difference.</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_210954","type":"fbcomment","data":{"text":"<div class=\"comment_text\">By \"shelter\" I meant tent or bivouac or tarp or whatever you use to hunker down for the night! Anyway good luck and hope you have awesome trips in both areas!</div>","author":"Ian Mark","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_295836","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Typically when it's wet where I ride it's warm. I use synthetic quilts with my hammock this time of year. I wear clothes that dry quickly and plan on getting wet. I do make an effort to keep a set of dry clothes to change into when I set up camp for the night. I hang my wet stuff  on the straps for my hammock under the tarp at night.</div>","author":"Douglas Miner","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_874478","type":"fbcomment","data":{"text":"<div class=\"comment_text\">If I have a wet pack up in the morning then I make an effort to stop and dry out my tent and anything else over lunch if there's a break in the rain. I wash my shorts every other day and wear them wet if I have to. I don't take waterproofs for riding in, but on my current tour I wish I had a poncho or something I could wear to the loo so my PJs don't get wet between the tent and the toilet. I wish I had my overshoes with me, my feet have been wet for days!</div>","author":"Helen Colson","gender":"NEUTER","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_400982","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I don’t ride anywhere that it rains (much)..</div>","author":"Adam Macer","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_694178","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I just get wet and wait for the sun to dry off.</div>","author":"Gerald Raton","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_459120","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Gerald Raton\"> problem is when you have near endless rain. Norway has towns where it rains more than 250 days of the year.</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_320284","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Make a lightweight Bivy sack from tyvek house wrap,  or just a small sheet of tyvek to use as a water proof sheet to cover over your bag/quilt to keep moisture off it. Tip if you wash a sheet of tyvek in a heavy wash cycle it will be soft and quiet.</div>","author":"Matt Chaney","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_592722","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Use a tent with good ventilation.  When it's 90% humidity cheap tents (and all bivies) will just make everything damp.</div>","author":"Timothy Faust","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_538182","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Following this thread</div>","author":"Johan Nordlund","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_932438","type":"fbcomment","data":{"text":"<div class=\"comment_text\">For me personally the most important thing is the gloves. As silly as it may sound but I actually use neoprene gloves for swimming in cold water! Yes, I also own those waterproof SealSkinz but prefer the swim gloves. The rest I can handle unless it gets below 5C at which point I seek shelter.</div>","author":"Pavel Klinov","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_165844","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Hate to break it to you, but there is no dry in these situations, just warm. I live in the PNW between the mainland and the Olympic Peninsula and one thing I do a lot of is bikepack/camp in the rain and cold. I have a three-pronged approach. 1) Start with a lightweight summer kit. 2) Add warm layers - expedition weight arm/leg warmers, light weight vest, midweight gloves. 3) Add rain/wind gear - Gore shakedry jacket (I like the trail running version), light weight rain pants (I added brass grommets to the bottom of each leg and tied on cordage to act as stirrups). light weight waterproof over-mitts, and waterproof socks (I like the thin SealSkinz midcalf ones) to fit over your thin wool summer socks. I too use a treated down quilt and while it does get damp overtime, it has never gotten to the point of soaking. I do carry SOL emergency bivy that I cut open and made into a blanket to throw over my bag in case things get too cold.                         As far as bibs are concerned, I carry an additional par and wash/switch every day/other day. I have a smallish polypro camp towel that I use to wring out most of the moisture after washing and then store the clean bibs in the towel and wring it out a few times during the day. Wet feet are no joke! Carry a pair of wool socks to sleep in (nothing else, just sleeping). Clean your feet every night with wet wipes and let them dry before putting on your dry sleeping socks. Lastly, something like a Patagonia Nano-Puff jacket with a hood is worth its weight in gold. Keep it accessible (but in a waterproof bag) to throw on when you stop (I sized up on my ShakeDry jacket so that it can be worn over a puffy coat if necessary). Whew! I hope some of this rambling helps and enjoy your trips!! You'll have an awesome time 🙂</div>","author":"David Whitlock","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_351744","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"David Whitlock\"> thanks this helps a lot! Some of this I already do. And I agree that keeping warm is more of a priority, as it's wet and cold that's bad. I'll have to think through what you've shared more thoroughly. Thanks for sharing!</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_949538","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"David Whitlock\"> ok I have a few questions since you seem the most knowledgeable here. Let me start with sleeping gear.\n\nYou mention having a dry pair of wool socks for sleeping in, and cleaning your feet before wearing them. Sounds great, as I'm guessing that ensures your feet are dry at least while sleeping. What about when you need to leave your shelter to pee for example? The socks would get wet then.\n\nWhat do you do with a wet tent if there's no break in the clouds? Do you just keep it packed wet?\n\nWhere do you store your wet clothes at camp? I currently store them inside my tent, but I now realise that is very likely contributing to the condensation.\n\nAnd then more of a mental question. How do you muster up the will to pack up when it's pouring rain? So far I've had the luxury of being able to monitor the weather forecast and wait out the worst of it.</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_291505","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Moinudin Gallotta\"> Well, I’m a guy, and during the worst of seasons I carry a 500ml soft flask pee bottle (with a large X on it). If I  must go out, I wear my MTB shoes without the insoles and don’t wander too far. 😬 Yes about the packed tent. I have single wall tent and store it in a dry bag (so two small dry bags for a double wall). If the weather clears or a shelter of some sort appears I’ll unfurl it to dry for a bit. At night all my riding clothes go into the dry bag that houses my tent and becomes my pillow (4L Sea to Summit dry bag). The last question is the hardest. I bring caffeinated chocolates called Rocket Chocolates and eat one or two of those. After they kick in I’m not really able to stay in the tent. 😁 But if I really don’t need to stick to a schedule, I use my buff as an eye mask and have wax earplugs, so I’ll just sleep until the weather clears.</span></div>","author":"David Whitlock","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_33425","type":"fbcomment","data":{"text":"<div class=\"comment_text\">A helmet cover is awesome if your jacket doesn't have a hood. It's basically a glorified shower cap but it works surprisingly well.</div>","author":"Jacob Ashton","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_942339","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jacob Ashton\"> I have a cap from Gore that goes under the helmet. Works great and I also get a little face protection.</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_867590","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Question about socks- my waterproof socks have seams cutting into my feet.  ISO Recommended brands.</div>","author":"Darcy Clarke","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_729821","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Darcy Clarke\"> I see most people recommend sealskinz. I use showers pass, and love them.</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_343976","type":"fbcomment","data":{"text":"<div class=\"comment_text\">At one time Sealskins were the only seller of such things. \nThey then changed their designs and socks were a much poorer fit. Found other brands instead which have proved to be excellent, even the cheapo Aldi ones. which sadly like most Aldo goods by the time you realise how very good they are, you can't buy any more. \nOtherwise Dexshell make really nice waterproof socks.</div>","author":"Jeremy Lawrence","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_593539","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Cedar Ridge makes a pretty decent synthetic quilt that does much better in wet weather.</div>","author":"Michael Armalavage","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}