{"time":1659790809474,"version":"2.23.2","blocks":[{"id":"id_453888","type":"header","data":{"text":"Is It Safe to Bicycle Tour in the Middle East","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_16259","type":"paragraph","data":{"text":"<i>Near and Middle East information search.\nHi lovers of life in motion.. Do any of you have up-to-date information on the following countries, obviously to get there and cross them by bike from France..😋 Tunisia, Libya, Egypt, Israel, Jordan, Iraq, Iran and or sub-Saharan East Africa, whatsapp group eastern Africa by bike??. I know that these are sometimes complicated regions but i am looking for concrete feedback from the field, spare me the traditional fears without experience.. thank you everyone.. it's for the resumption of my travels in September 2022.. 👍😘 kisses and good walks on our beautiful planet.<div class=\"post_attachment\"><div class=\"post_photo_attachment\"><img class=\"post_photo_image\" loading=\"lazy\" src=\"/images/community/is-it-safe-to-bicycle-tour-in-the-middle-east/image_1659790809_7729264428.jpg\" alt=\"\"></div></div></i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_29525","type":"delimiter","data":{}},{"id":"id_568678","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I cycled Oman - Israel this year. All fine no major hassle. So Oman, UAE, Saudi Arabia, Jordan, Israel all open, easy to cross even on bicycle. Also Qatar, Bahrain, Kuwait open, no problem. Crossing Israel/Egypt should be possible, if not there is for 100% a boat from Aqaba to Nuweiba. Iran, Turkey easy. Syria is actually possible but only with a guide so it means lots of money. Libanon probably partly possible but its a dead end. Iraq... Kurdistan Iraq is possible but rest of the Iraq is more difficult but probably possible. I've read few posts from the people traveling Kuwait/Iraq and Jordan/Iraq by car/motorcycle. But nobody by bicycle so far. (Please, give me a favour and do that. Thanx) Afghanistan...? I would be scared to go...\nEdit. I forgot Yemen. In Salalah (Oman) locals told me that it's not a problem to enter Yemen. But not all the way to Sana. But if it's really possible for a foreign traveler i have no idea</div>","author":"Beggard Beggar","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_708223","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Beggard Beggar\"> good report my friend and accurare..</span></div>","author":"Craig Martin","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_520658","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Beggard Beggar\"> wahou...very interesting  informations. I didn t think about this yet, but i am not vaccinated against covid, i don t know if it changes something...anyway thanks a lot for ur feedback..👍</span></div>","author":"Samy Jousse","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_199671","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Beggard Beggar\">  that's what I call information. Not like <span class=\"ce-fbcomment-quote\" data-quote=\"Phil Kneen\">  scaremongering rubbish.</span></span></div>","author":"Josef Machek","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_984515","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Hels On Wheels\"> knows a lot about this region</span></div>","author":"Josef Machek","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_253307","type":"fbcomment","data":{"text":"<div class=\"comment_text\">All of those countries mentioned are ok except for Libya as far as I know.</div>","author":"Craig Martin","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_293717","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Can't enter or leave Israel into or out of Lebanon or Syria.\n\nIsrael into Egypt is not a problem at the Taba border from Eilat into Sinai. But be prepared to have police follow you the whole way, checkpoint to checkpoint outside the cities to protect you from kidnappings. One bad situation with ISIS kidnapping and killing a foreigner resulted in Egyptian authorities doing everything they can to protect tourists and stay out of the news in the negative light of terrorism. Some of the checkpoints have areas to setup your tent and you'll be drinking a lot of tea or coffee with them. It can get annoying but turn it into a fun experience and accept it :)\n\nIsrael doesn't stamp your passport. They give you a separate paper with the stamp so you can trash it after you leave but Jordan and Egypt don't. What does this mean? If you go to Qatar, Iran, Iraq, lybia, kuwait, Syria, Lebanon, and Pakistan after using these land borders from Israel into neighboring countries (Jordan and Egypt) they will not permit you entry because to them, you could be a spy. \n\nMake sure you plan your route accordingly. Qatar and Iran immigration officers look for the Jordan and Egyptian stamps diligently. I can't say how close the other countries look but they all belong to the Arab/Muslim group to blacklist not just Israelis, but anyone who visited Israel for fear of letting spies into the country because unlike Hollywood, this is how real spies get in - legally! Fake passports are impossible to make these days since 9/11. Technology improved a lot.\n\nIf you are American, you can get a 2nd identical active passport printed specifically for this. Just make sure you use it properly which might mean having to fly into a country to avoid land border stamps in Jordan or Egypt adjacent to Israel…. \n\nSome of these countries in the middle east trace your trip if you entered by land so if all of a sudden they see you entered Saudi Arabia from Jordan by land but don't see how you entered Jordan (land, sea, or air, they will assume you are trying to hide your way because you obviously came through Israel so you must be a spy for the Zionists. To reiterate, if Iran or Qatar don't see a stamp into Jordan or Egypt from air land, or sea port they will assume you're a spy. You will be interrogated for hours to days or detained for even a long time. It's serious and not a joke. Not worth the time or fear you'll face until they reach their own conclusions that you aren't a spy and let you continue your travels. And probably have their secret police follow you to make sure but you won't even know\n\nYou can ask the land border officers in Jordan or Egypt to stamp your Israeli paper stamp instead of your passport. Make sure to tell them BEFORE you give them your passport. They are understanding and accommoding but again, this will help with some of the other countries in the ME or Pakistan/Afghanistan, but not Iran or Qatar for sure and possibly also in Iraq or Lybia.\n\nThis is why not many ride their bikes from Africa through the middle East without a fly over..\n\nIsrael has done a few covert ops in said countries in recent decades to bring terrorists to justice or disrupt nuclear power operations to preemptively defend themselves. They won't wait until after its too late. They learned to take the crazies seriously when they say they want to kill us all. Since WWII, never again regardless left or right wing govt, security in Israel is the least politicized. They will do what needs to be done to prevent another hitler. And that might make bike tourers routes a bit more challenging without flying over a the only democratically free country in the ME.  \n\nSorry. Govts suck. But the people are awesome. Hope it goes well for you.\n\nP.S. - If you fly over Israel from Egypt into Jordan or the other way for example, you'll get bonus points iN Iran or Qatar. They will see the stamps and dates of the airports and will assume you also \"hate\" the Zionists. Play along, get out of the port, and enjoy the people in any of those countries. They are the complete opposite of their oppressive, fearful, paranoid govts. Especially the Iranian people as I'm sure you know.</div>","author":"Adir Sharon","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_138781","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Adir Sharon\"> i am coming from north of France and would love to go to middle east without crossing Europe, reason why i was thinking to go through north eastern Africa first... i don t know yet wich way i could go, maybe i have to avoid Lybia, and go through Niger then Egypt and start with France then boat to Algeria or Tunisia...🤔</span></div>","author":"Samy Jousse","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_656277","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Samy Jousse\"> if you thought you could ride from Morocco to Egypt through north Africa, unfortunately you can't. Libya is closed. On a bike in the middle of nowhere where govts are weak and terrorist/freedom fighters roam, we're a lottery ticket on a bike. Easy picking. Odds are low but the risk assessment is yours.  \n\nSince Iran just arrested a Swede for visiting Israel in the past, I recommend you fly over Israel. If they can't verify how you entered Jordan or Egypt with they see you left said countries by land without seeing an entry stamp, you'll be arrested too for being a spy for Israel. \n\nIt's best to fly into Iran first and ride the other way until you are blocked in lybia and fly over or go home if you don't want to do the Egypt - S Africa route. Than you are free to go to Israel without any problems or worries of stamps. But, DO NOT go to Iran or Qatar ever again on this passport - get a new one. Problem solved :)</span></div>","author":"Adir Sharon","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_274294","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Adir Sharon\"> so do you avoid Israel then? If you do you're fine? What's the best way if you want to visit Israel?</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_443417","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Moinudin Gallotta\"> fly in, fly out. I'm Israeli American duel citizen with residency in Japan. My American passport says born in Israel so a lot of the middle East is closed to me</span></div>","author":"Adir Sharon","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_502518","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Adir Sharon\"> from Morroco no, but Tunisia, Algeria, Niger  maybe...</span></div>","author":"Samy Jousse","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_251760","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Moinudin Gallotta\"> or, you start in the east, go through Qatar, Iran, Iraq, etc and ride westward towards Israel. Just in the future, if you want to visit the 8 countries blacklisting anyone who visited Israel, have a new clean passport that doesn't have stamps from Jordan or Egypt land crossing into/out of Israel. Doesn't matter if you're a Muslim Arab from Morocco or even a Palestinian with a blue passport (those born in israel or the West bank in zone C or B), can't visit said countries for fear of being a spy for Israel.</span></div>","author":"Adir Sharon","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_228817","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Samy Jousse\"> at your own risk. See what your country has Niger etx listed as. For Americans, Australians, Canadians, govt is strongly advising not to travel to Niger due to armed robberies and increased threats to kidnap foreigners. If I were flying and visiting cities by car or tour, I wouldn't care about the warnings unless there is a ban because than my country won't come to my rescue if I need it. If you visit for business, the company in Niger will hire your a driver and armed protection so that tells you a little bit of the situation on the ground.\n\nOn a bike, where I will be alone in remote parts where the weak govt has no control of the rebel groups, terrorists, or freedom fighters (you pick the term to fit your ideology), I wouldn't take my chances because now, as I reached my 40s, I know that \"it won't happen to me\" belief system is nonsense. But you do you. I just hope you won't turn into a statistic</span></div>","author":"Adir Sharon","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_290538","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Adir Sharon\"> ok I'd probably be riding eastwards so should be fine. But otherwise, would it work with dual passport?</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_726994","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Adir Sharon\"> i am french but also tunisian from father, living and borned in France..</span></div>","author":"Samy Jousse","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_912771","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Moinudin Gallotta\"> depends how you use it but best to not risk having an unexplainable gap imo.  Countries know people have multiple passports. Some like Iran, Russia, China, Afghanistan, etc who are extra paranoid about spies might dig deeper so I would recommend you use one passport for your tour and the other passport for future travel to those countries. It's not unheard of those countries to detain people with multiple passports until they can prove to themselves you aren't a spy. I have 3 passports, 2 citizenships. I only travel with 2 of them because of this. Dont want to risk to prove my innocence but can't either the US or Israel without my passports since I'm a citizen of both it's illegal to enter as a foreigner</span></div>","author":"Adir Sharon","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_619271","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Samy Jousse\"> if u have a Tunisian passport no problem for Tunisia. Niger is different. The other countries on the path across the middle East are also different. Your French side = potential big money for a ransom in some of the hot zones out of the control of local govt/military/police which are usually in deserts or mountainous areas near borders where they (terror cells, rebels, freedom fighters) can hop over the border for safesty since x country can't have its military go to the neighbor country as it is a sign of aggression and could lead to war. But it's your life your choice. \n\nI've done my research traveling for 5 years now second time around the world. I learned a lot and am trying to help you but I can only lead you to water. You will learn with your experience or research. Call your embassy for advice on your route. ask if you get kidnapped if they will come to your rescue. They might say yes for x country but not for y.. than make your mind. \n\nOne friend and another tourer I met on the road weren't so fortunate as others who assume the risk. They didn't think it could happen to them. One disappeared and never heard from again presumed dead in Syria. The other, a friend since college, was released after 6 month in prison. They said he smuggled drugs (he was a straight edge Christian - didn't even drink or smoke cigarettes). Either someone used him as an unaware mule or a corrupt immigration officer set him up to get a bonus. When he got back to the US, after 6 months of US negotiating with their geopolitical power for his safe return, the trauma of the prison beatings and torture led to his suicide 2 months later</span></div>","author":"Adir Sharon","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_587397","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Adir Sharon\"> thank you for sharing ...i will take risk and see wich way is better...i do not count on my embassy .😉</span></div>","author":"Samy Jousse","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_56560","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Adir Sharon\"> all good point however Israel can also interrogate visitors for hours even holders of an  American or European passport because of their birth place. My wife missed her flight getting out and had to leave the following day on a business trip.</span></div>","author":"Ali Albayrak","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_651211","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Ali Albayrak\"> my only problem now is to cross Lybia from Tunisia, Israel i can avoid..</span></div>","author":"Samy Jousse","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_521076","type":"fbcomment","data":{"text":"<div class=\"comment_text\">This just happened yesterday before anyone jumps on my comment for being too \"over the top\":\n\n<a href=\"https://www.timesofisrael.com/iran-says-swede-who-previously-visited-israel-arrested-for-alleged-espionage/\" target=\"_blank\" rel=\"nofollow\">https://www.timesofisrael.com/iran-says-swede-who-previously-visited-israel-arrested-for-alleged-espionage/</a></div><div class=\"comment_attachment\"><div class=\"link-tool\"><a class=\"link-tool__content link-tool__content--rendered\" target=\"_blank\" rel=\"nofollow\" href=\"https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.timesofisrael.com%2Firan-says-swede-who-previously-visited-israel-arrested-for-alleged-espionage%2F&amp;h=AT2OKpb7xRtcUsU1nZnd3O1OVqThzDGTVpruaehNf0-uvEjK9Ay234IQbgCE3xYCMybvXOInqMNQ3G6ilwqRHPYcZCK3Xk0rjO3jo8k-47wMSqztApFBjIOqe2QthoeRqMG5WF17v2aPOqc&amp;s=1\"><div class=\"link-tool__image\"><img loading=\"lazy\" src=\"https://static.timesofisrael.com/www/uploads/2012/10/F080821OF07-e1377892006396-1024x640.jpg\" alt=\"\"></div><div class=\"link-tool__title\">Iran says Swede who previously visited Israel arrested as alleged spy</div><span class=\"link-tool__anchor truncate\">timesofisrael.com</span></a></div></div>","author":"Adir Sharon","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_747267","type":"fbcomment","data":{"text":"<div class=\"comment_text\">NB There are seversl of those countries that will  not allow you to enter if you have visited Israel first (have an Israeli passport stamp) Those are Libya, Lebanon, Syria, most of Iraq except Kurdish areas, Iran and Afghanistan.</div>","author":"Kjell Hamran Vegge Ødegård","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_190119","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Kjell Hamran Vegge Ødegård\"> yes ..i should avoid Israel</span></div>","author":"Samy Jousse","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_469398","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Samy Jousse\"> To my knowledge, Israel no longer stamps passports to avoid this kind of misadventure to travelers. They give a kind of entry visa (parking ticket) that is attached to the passport and most importantly you shouldn't lose.</span></div>","author":"Gilles Steinberg","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_444476","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Gilles Steinberg\"> yes, but it's apriori easy to determine that we went there even without a stamp during further checks... in the absence of traces of roads avoiding Israel... That's what they explained to me here yesterday. by plane to the limit I would see the interest but by bike we take only one road..</span></div>","author":"Samy Jousse","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_594448","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Kjell Hamran Vegge Ødegård\"> Israel hasn't stamped passports for years. They give you a separated paper that get taken back when you leave the country</span></div>","author":"Muriel Zaccuri","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_74296","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Currently in Iran (coming from Turkey, Georgia, Armenia) heading to UAE, Oman, Saudi, Jordan, Israel, Egypt. Was in Lebanon December 2021. Happy to answer any specific Qs on the regions I’ve been lately 😊🚴🏻‍♀️</div>","author":"Hels On Wheels","gender":"NEUTER","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_859970","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Hels On Wheels\"> i have seen ur amazing trip ..personally i was thinking to start from the other side, i am in France, and could reach Tunisia, but then to go to Egypt through Lybia looks a little complicated and after it sound better for me to avoid Israel to go to Iran after all that..let me know if you have some advices, your experience is a treasure to me🤗😘👍😉</span></div>","author":"Samy Jousse","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_207200","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Samy Jousse\"> wow! Im sorry I have no accurate advice or experience for those areas.. Sounds like an amazing trip! 🚴🏻‍♀️</span></div>","author":"Hels On Wheels","gender":"NEUTER","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_367507","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Hello.. also trying the europe africa crossing through turkey iraq jordan israel egypt in september october</div>","author":"Mathieu Chesneau","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_526557","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Mathieu Chesneau\"> I'm bored of having to start with Turkey, I went there in October from Lille already, for that I would like to start with Tunisia to avoid Europe and its overloaded auto traffic and cooler climate in autumn, Tunisia that I rej I would eat by boat from France, after crossing France but it gets complicated with Libya afterwards.. if you have any ideas... welcome👍</span></div>","author":"Samy Jousse","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_125375","type":"fbcomment","data":{"text":"<div class=\"comment_text\">My country Türkiye is not a Middle Eastern country.  It's a European country.</div>","author":"Mehmet Binali","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_229173","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Mehmet Binali\"> that was Atatürk plan not Erdogan's 😉</span></div>","author":"Muriel Zaccuri","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_730607","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Muriel Zaccuri\"> It's not a plan it's a fact. Turkey has land in Europe and considered as a European country as far as World affairs including sporting events.</span></div>","author":"Ali Albayrak","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_185524","type":"fbcomment","data":{"text":"<div class=\"comment_text\">My country Türkiye is a hospitable country and you make a very relaxed, peaceful species 🤗🇹🇷🇹🇷💗</div>","author":"Mehmet Binali","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_668110","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"<span class = \" ce-fbcomment-quote\"=\"\">\"&gt;Mehmet Binali i know</span></div><div class=\"comment_attachment\"><div class=\"comment_photo_attachment\"><img class=\"comment_photo_image\" loading=\"lazy\" src=\"/images/community/is-it-safe-to-bicycle-tour-in-the-middle-east/image_1659790809_5545086644.jpg\" alt=\"\"></div></div>","author":"Samy Jousse","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_718716","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Samy Jousse\"> Thank you...🇹🇷💗🤗 #mebicycle \n#Samsun  #Yakakent Asmapınar Village Canyon #Blacksea</span></div><div class=\"comment_attachment\"><div class=\"comment_photo_attachment\"><img class=\"comment_photo_image\" loading=\"lazy\" src=\"/images/community/is-it-safe-to-bicycle-tour-in-the-middle-east/image_1659790809_2665499504.jpg\" alt=\"\"></div></div>","author":"Mehmet Binali","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_955469","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><a href=\"https://chat.whatsapp.com/IpeE7GxIYdbJrhJjh6hY14\" target=\"_blank\" rel=\"nofollow\">https://chat.whatsapp.com/IpeE7GxIYdbJrhJjh6hY14</a> a conversation on whatsapp of bikers crossing Asia</div><div class=\"comment_attachment\"><div class=\"link-tool\"><a class=\"link-tool__content link-tool__content--rendered\" target=\"_blank\" rel=\"nofollow\" href=\"https://l.facebook.com/l.php?u=https%3A%2F%2Fchat.whatsapp.com%2FIpeE7GxIYdbJrhJjh6hY14&amp;h=AT2NbjvhrqOGUsZ7lpP5_fK8ze4Sl6UWdN4u07M0ErGEeZQV-4LRk7yGZKa2IGoKN_bl4yyPm7KmDK0hKu_yg-FEPeRV9IGZtjTl_Vyb--0mpwb9_uGdPs3QnC0T6N7oGhiIMUyemc66igc&amp;s=1\"><div class=\"link-tool__image\"><img loading=\"lazy\" src=\"null\" alt=\"\"></div><div class=\"link-tool__title\">Zijderoute / Cycling East</div><span class=\"link-tool__anchor truncate\">chat.whatsapp.com</span></a></div></div>","author":"Julien Rdg","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_994939","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Lybia is open..i have called Lybian embassy in Paris yesterday.👍</div>","author":"Samy Jousse","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_466888","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Samy Jousse\"> can you get visa?</span></div>","author":"Beggard Beggar","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_271073","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Beggard Beggar\"> yes with invitation required as french , but may be i will not need visa at all. I am also tunisian and have 2 passeport</span></div>","author":"Samy Jousse","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_384947","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Samy Jousse\"> excellent!!! I wish you could go there. Never heard of anybody cycling there!!! Go for it!!!</span></div>","author":"Beggard Beggar","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}