{"time":1657788514470,"version":"2.23.2","blocks":[{"id":"id_178406","type":"header","data":{"text":"Ischial Bursitis/Sitz Bone Bursitis when Bike Touring","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_983768","type":"paragraph","data":{"text":"<i>Anyone ever have ischial bursitis/sitz bone bursitis? \nI took off a few months on the bike trainer and did a short ride on my hybrid (I have  same saddle - Sella Italia Diva Gel Flow on my road bike too) and my sitz bones, particularly left side was sore and then rode a few days later 2x on the trainer prior to a 25 mile bike event on a hybrid a week later. My sitz bones were so sore after the event and then took off a week until I did a short ride again on my hybrid and my sit bone was still sore. I took off another week until I got on the trainer again yesterday and only last 30 minutes due to left side soreness again.\nOther than ice and rest is there anything else I can do? I’ve never had this issue with recovery  (except with doing a Half Ironman 70.3 several years ago with a different saddle and visible sit bone bruises) I have another leisurely 25 mile ride in early August and want to continue to get back on the trainer during the week. I also have a 150+ mile ride on my hybrid over several days in mid-October.\nThis has been so frustrating and I’ve been riding for years with no issues. I’m totally stumped as to what’s causing the issue and how to resolve it other than with ice and rest. The saddles seem to be in good shape and they’re only several years old and my Terry Chill shorts seem to be in good shape too.</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_90598","type":"delimiter","data":{}},{"id":"id_890213","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Do you need to tighten your seat so your sit bones are in the right place?  The leather selle anatomica seats need adjusting every so often as the leather softens and stretches.  Do you ride with padded shorts?</div>","author":"Kim Wallace","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_183103","type":"fbcomment","data":{"text":"<div class=\"comment_text\">My sit bones created an indentation in the leather, and you can visably see the change as the leather softens and stretches…this is when/how I know to tighten the leather.</div>","author":"Kim Wallace","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_275083","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Kim Wallace\"> I just checked both saddles and I didn't see any indentations on either seat and they are still really firm. I I ride with Terry chill padded shorts as they have no seams which I like. I used to ride in tri shorts and after having bruising after the Half Ironman, I switched. Also, do you have padded shorts that you like? Thanks!</span></div>","author":"Stacy Dietzler","gender":"FEMALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_584","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Stacy: there are gel saddle covers that can offer more comfort to your current saddle. It can be added or removed as needed.\nI do wear padded shorts most of the time but in certain weather unpadded pants. I can't recommend specific shorts as I don't have any of your issues.\nMy thought is you have bruised your sitbones and need time for that to heal but your impatience to ride is not allowing that to occur. As suggested shorter rides and stopping before pain with more repeats is far better for healing than longer rides to pain with greater rest intervals.\nThat gel cover should allow your body more time to heal while allowing your mental need to ride.\nYou may also get help from a look at your bike fit. None of this issue is likely a singular issue.</div>","author":"Bill Dove","gender":"UNKNOWN","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_732977","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Bill Dove\"> Good idea! I actually have a Lycra cover I use as my shorts were getting pilled from the saddle stitching. I like the  I have a cut-out saddle - would I need to find a gel cover that has the indentation as my current thin Lycra cover fits fine. I look back now and wonder how I rode in tri shorts all those years without issue and those just have a piece of felt for padding:-0 Appreciate your help and I will definitely rest as it's not worth feeling such soreness - Ouch.</span></div>","author":"Stacy Dietzler","gender":"FEMALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_574766","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Age and likely modified body from years ago may not be your friend. I'm 77 and am fortunate currently I don't have those issues.\nBTW that gel cover won't be negatively affecting your cutout current saddle.</div>","author":"Bill Dove","gender":"UNKNOWN","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_742582","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Bill Dove\"> You are very lucky! I just ordered a gel seat cover that should fit my small/narrow saddle and has the indentation. I'm hoping this will help and since I'm not racing this year, and just doing leisurely rides other than the last 150+ mile segment of the Katy Trail, MO - 237 miles, comfort at my age (60) is key:-) Way to go with your continued cycling!</span></div>","author":"Stacy Dietzler","gender":"FEMALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_111812","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Stacy Dietzler\"></span></div>","author":"Bill Dove","gender":"UNKNOWN","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_928110","type":"fbcomment","data":{"text":"<div class=\"comment_text\">A couple thoughts here: \nThe hybrid probably  has a more vertical position than your Ironman tri bike, so the two aren't necessarily comparable because you're sitting more upright on a hybrid.\n\nBased on what you stated above, it sounds like you're just riding one long ride a week and taking a week off to recover. Have you considered multiple shorter rides during the week to build up your sit bones area?</div>","author":"Shawn Punga","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_823671","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I have a road bike in my trainer and I'm sitting up most of the time vs. being in an aero position and not cycling very hard. The first time I did the 15 mile ride outside, I took a week off and then rode 2x for 45 min each and still had some soreness. I tried a 30 minute ride last week and had to bail due since I still felt soreness. Thanks!</div>","author":"Stacy Dietzler","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_226415","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I don’t think a gel seat cover will help. As you ride your sit bones dig into the gel and the gel goes where you don’t want it. Did someone diagnose you with bursitis? Cortisone shots usually settle bursitis if you have someone who can do that for you. Otherwise rest and ice followed by short rides once it settles. Another thing we should probably all do is lift off the saddle a bit starting from the beginning of the ride. This allows blood flow to the area and can help problems from developing.</div>","author":"Lynne Meredith","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_584590","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I have had similar issue.  I changed to a new saddle and played around with different padded shorts.  The body does change and can only let you know from pain sometimes.</div>","author":"Karen Kingsbury","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_315341","type":"fbcomment","data":{"text":"<div class=\"comment_text\">The bursitis in the ischial tuberosity often is not the primary problem. Often the primary problem is actually tendonitis in the conjoint hamstring insertion, which inserts into the ischial tuberosity. The bursa then gets inflammed secondarily. So it could well be your hamstrings. In cyclists the commonest problem that causes this is a seat that is slightly too high, or badly angled seat. Even though you may be certain about your seat height, try lowering it by 5mm or so as a temporary measure, to relieve the strain on the hamstrings.</div>","author":"Andrew Robinson","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_640074","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Andrew Robinson\"> Thanks for the helpful info. My chiro worked on my hamstrings and I have a Theragun which I’ll use there as well. I’ll have my husband lower the seats a tad so see if that helps. Appreciate it!</span></div>","author":"Stacy Dietzler","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}