{"time":1655736074789,"version":"2.23.2","blocks":[{"id":"id_581437","type":"header","data":{"text":"Lateral Knee Pain due to Tight Hamstrings: A Bicycle Fitting Issue?","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_870041","type":"paragraph","data":{"text":"<i>Does anybody here struggle with lateral knee pain due to tight hamstrings? How do you defend against it on multi-day rides?\n\nStretching sounds obvious. I also find that cold aggravates it, hence I always cover my knees unless it's very hot (I'm in Norway). Ibuprofen is a blessing when it happens mid-ride.\n\nHow about sports tape? Any pro tips?\n\nI think my bike fit is pretty much dialed in. My seat is a little lower than average due to the tight hamstrings. I don't have any issues in the front or back of the knees. I ride with cleats as far back as they go, in order to defend against ankle/achilles pain.\n\nWhen googling lateral knee pain, IT band syndrome is regularly reported as the most likely issue. But I went to a physio who quickly pointed out that my issue was tight hamstrings.</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_979270","type":"delimiter","data":{}},{"id":"id_670545","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I would still see a professional bike fitter.</div>","author":"Wai Sing Lee","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_378938","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Ride with your feet free. The right stretches can help. The calves are also involved. Away from riding use a massage gun.</div>","author":"Michael Manning","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_55648","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Having a pedal system that uses a tighter \"float\" can cause all sorts of issues if your feet need to splayed out like a duck or pointed in. If your cleats lock the feet in straight, you'll suffer! I like Crank Brothers pedals and cleats, as they have a lot of float compared to other pedals. As alluded to above, if you have a set of flat pedals lying around, try them with running shoes and see if the problem disappears.</div>","author":"Chris Blacklock","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_825826","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I would try switching to flat pedals, or even flats with toe straps/cages. Maybe do 500km to see how different that is. Personally I would forget about the arguments for clipless and put my knees first. \nBeing locked in one position with clipless puts a repetetive strain on a very specific range of motion. Other choices give a bigger range of motion in all three dimentions and your body has more chance of finding its natural position.</div>","author":"Mark Perry","gender":"UNKNOWN","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_882533","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Downshift. Ride more slowly. Throw the piano off to the side of the trail. Take a rest day.</div>","author":"Rian Mintek","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_17935","type":"fbcomment","data":{"text":"<div class=\"comment_text\">A very slight saddle height can sometimes also make a big difference.</div>","author":"Todd Burgman","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_805793","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I get issues in my left knee and found that having dual mountainbike peddles/shoes sorted it.  I clip in on the right foot and ride on the flat side on the left foot.  When climbing I clip both in as it is only when the left foot is clipped in for a couple of hours that I get issues.</div>","author":"Stewart Blake","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_356524","type":"fbcomment","data":{"text":"<div class=\"comment_text\">about to turn 40 and i just started getting knee pain while cycling....and here i thought that wasnt going to happen like pain stopped me from running years ago.</div>","author":"Joe Iverson","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_42961","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Front, back or side of knee? Most of the time it can be sorted. I like your profile photo, by the way!</div>","author":"Tor Hovland","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_703553","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tor Hovland\"> back, behind the knee on the back side of the leg.</span></div>","author":"Joe Iverson","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_586645","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Cyclists do have a 'tight' musculature. Lateral knee pain may well be tibial band syndrome as well. If you have been to a physio, his advise should be sought and the exercises they recommend used. In my case I had the same symptons and this was Tibial Band Syndrome. The 'cure' was to lie on a bed and hang your leg over the edge to stretch the muscle. The key question, is does the pain flare then die away after a maximum of a days rest? If it does then I feel tibial band is involved</div>","author":"Neil Wheadon","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_382139","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Neil Wheadon\"> isn't it the ilio-tibial band, as in ITB syndrome? I had that, and it was cured in one day by doing those two simple stretches I mentioned above.</span></div>","author":"Chris Juden","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_567629","type":"fbcomment","data":{"text":"<div class=\"comment_text\">You're right, stretching is the answer. I've had two kinds of knee problems, one of which sounds just like yours, and both were rapidly solved by doing two simple stretches at bedtime. \n     One is crouch with palms of hands on the floor and then straighten legs, as straight as you can, hold for a count of ten, relax down again and then repeat two more times. \n     The other is lie face down on bed, bend knees, reach behind for both ankles and pull heels toward buttocks. Hold for a count of ten, let go, relax and repeat two more times.</div>","author":"Chris Juden","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_28216","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Would highly recommend getting a professional bike fit including cleat set up if you ride clipless pedals, if you haven't already</div>","author":"Mike Plant","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}