{"time":1658743369495,"version":"2.23.2","blocks":[{"id":"id_978440","type":"header","data":{"text":"Permethrin: How Do People Prevent a Tick Bites when Camping","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_134522","type":"paragraph","data":{"text":"<i>Edit: I'm primarily concerned about ticks, not mosquitos.\nI’m planning on using permethrin for the first time for an upcoming trip. How do folks apply it to prevent the most likely scenario where a tick lands on your shoe/lower leg and crawls up your leg?\n\nDo you apply it to long socks, or use some sort of leg covering?\n\nWhat garments DON’T you spray it on?</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_791198","type":"delimiter","data":{}},{"id":"id_994636","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I “soak” almost everything in it and let it dry. Socks, pants, tents, whathaveyou. It has always done the job I needed. Soak meaning just spray it all down to kind of damp, and then let it dry naturally.</div>","author":"Scott Rasmussen","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_525125","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I’m with Scott.  I do similar as a loved one was severely debilitated for several years.  from Lyme and 2 other common tick borne infections.  Shoes, long socks, baggy shorts, and jerseys all get sprayed about every 6 weeks.  Haven’t bike packed in years, but have also sprayed down my Hennessy Hammock sleep system with permethrin before a trip.  All clothing and shoes would get a fresh spray before heading out on an overnight.  \n\nMy observations have been that this works well for me…and even on day rides it seems I need less mosquito repellent if I’m wearing gear with a fresh permethrin application.</div>","author":"Sam Cordero","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_808474","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Just so your aware, there are garments (pants, shirts and hats) that are treated to kill ticks. Here in Canada Mark's Work Warehouse or Mark's sell those items. Because they are owned by Canadian Tire they may also sell some items.</div>","author":"Bill Dove","gender":"UNKNOWN","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_581978","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I read that the persevering disrupst the ticks nervous system or some sort. I treated some clothes, socks and my tent. The mosquitos didn't seem to mind much. The first time using it I treated my tent twice. Just so you know you shouldn't treat clothing side that touches your skin. I noticed some irritation from my pants that came through the legging. If your hiking in brushy areas pants seem to be great for keeping a barrier to poison oak. Also there's a 10hr. Spray for ticks, and says good for mosquitos that you can spray on your body, other than diet, or permethrin. Handly tiny spray tube bottle. I think the best bug spray is the natural, all-terra brand for mosquitos. Don't inhale the fumes when spraying permethrin.</div>","author":"Aaron Wissler","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_454495","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Also a trick I try is to shower with mosquito soap before</div>","author":"Aaron Wissler","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_492706","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I use this, all natural, works great.</div><div class=\"comment_attachment\"><div class=\"comment_photo_attachment\"><img class=\"comment_photo_image\" loading=\"lazy\" src=\"/images/community/permethrin-how-do-people-prevent-a-tick-bites-when-camping/image_1658743369_8961924794.jpg\" alt=\"\"></div></div>","author":"Steve Jones","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_495688","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I spray clothes 24 hours before I need them. I don't spray camp gear. I avoid deet based repellents because they break down nylon fabric (aka, sleeping bag) over time.</div>","author":"Mark Laken","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_138118","type":"fbcomment","data":{"text":"<div class=\"comment_text\">All my clothing is polyester. My primary guard against bugs including ticks is cycling leggings tucked into my socks. Has worked so far. A little bit warmer but not much. And I just spray the stuff as needed. Has worked well so far.</div>","author":"James Mcginley","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_71487","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"James Mcginley\"></span></div>","author":"Steve Jones","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_671021","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Permithren on everything your wear. Wear long pants or leggings if really worried about tick exposure. If legs are exposed, Picaridin lotion/spray for the skin.</div>","author":"Aaron Crawford","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}