{"time":1656105680676,"version":"2.23.2","blocks":[{"id":"id_346237","type":"header","data":{"text":"Planning Bicycle Trips is Not Easy!","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_811859","type":"paragraph","data":{"text":"<i>Hey everyone. I want to share my thoughts on planning bicycle trips.\n\n**The problem with planning**\n\nI think that planning the route with too many details is a waste of time. Things are always changing and you can't prepare for everything. Also, planning the trip too thoroughly is time-consuming and eliminates the fun part of going on an adventure.\n\nBut you must plan with some level of detail, right? At least you should know where you start and the goal of your trip. Also, it's nice to know some points worth visiting on the way.\n\n**My story**\n\nOn my first trip, I planned the track and booked all places on Airbnb on the way. It worked great but required a lot of preparation and it was not flexible.\n\nThe second time, I became more confident and booked only the first two places. The rest I booked on the way the day before the arrival. So I shaped my route according to the circumstances.\n\nThe last time, I used the same method but faced problems. I felt really sick in the evening after riding too big a distance with a headwind. That was not great. I decided to plan better the next time.\n\nNow I am thinking about my next trip. I want to go camping, so it is important to know the lowest temperature in the area. But my trip date is in months, the weather forecast doesn't work for such period of time.\n\n**What I came up with**\n\nThe only way to understand what time is the best for camping in the area is to check the average temperature during the year. For that info, you can go to Wikipedia or some weather site.\n\nIf you have a long trip, you need to check a lot of places. I thought that it will be fun to gather all available temperature data and put it on the map. Here you can check out what I came up with https://touringstories.com/map/\n\nThat gave me a better understanding of which places to go to and what time of year is the best to visit them.\n\n**What do you think?**\n\nI would be super grateful for feedback. Is it worth adding other info to this map, like wind and precipitation?\n\nAlso, have you ever had any wishes to prepare better the next time?</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_854374","type":"delimiter","data":{}},{"id":"id_650917","type":"fbcomment","data":{"text":"<div class=\"comment_text\">As to temps...this might be of interest to USA tourists <a href=\"https://www.cyclingabout.com/year-long-usa-bike-tour/\" target=\"_blank\" rel=\"nofollow\">https://www.cyclingabout.com/year-long-usa-bike-tour/</a></div><div class=\"comment_attachment\"><div class=\"link-tool\"><a class=\"link-tool__content link-tool__content--rendered\" target=\"_blank\" rel=\"nofollow\" href=\"https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.cyclingabout.com%2Fyear-long-usa-bike-tour%2F&amp;h=AT3jYGHyA77K2DgCl6Po86wwY6WxRefvjxVwSiUvRmuiC6PM5Jdhmt-z3VzGpK8SKAH6cpZssCUX9mqC7btTYa_oMCqPJP75BgnkUuXVZtVPmysoyOXQSRVseqadcL1vHX2bl1sYIzaftP4&amp;s=1\"><div class=\"link-tool__image\"><img loading=\"lazy\" src=\"https://www.cyclingabout.com/wp-content/uploads/2017/05/USA-Bike-Tour-72-Degrees-Average.jpg\" alt=\"\"></div><div class=\"link-tool__title\">The Year-Long, 12,679 Mile USA Bike Tour With Perfect Weather Every Day - CyclingAbout</div><span class=\"link-tool__anchor truncate\">cyclingabout.com</span></a></div></div>","author":"Tom Watson","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_806913","type":"fbcomment","data":{"text":"<div class=\"comment_text\">What a great planning tool! Thanks for sharing!</div>","author":"Verena Hable","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_427844","type":"fbcomment","data":{"text":"<div class=\"comment_text\">IF one can find the information it may also be worthwhile to find out the prevailing wind direction . Example the South-coast of UK/England &amp; Cornwall has Westwind. \nOn the other hand wind along the Rhine seems to be along the Rhine , no matter what the weather-predictions say .</div>","author":"Andreas Schaefer","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_605756","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Andreas Schaefer\"> I think it's possible to show this on the map too. All weather stations measure wind direction and speed. \nHere is a great website I found to check weather statistics in a particular place: <a href=\"https://weatherspark.com/y/149604/Average-Weather-at-Newquay-Cornwall-Airport-United-Kingdom-Year-Round#Figures-WindDirection\" target=\"_blank\" rel=\"nofollow\">https://weatherspark.com/y/149604/Average-Weather-at-Newquay-Cornwall-Airport-United-Kingdom-Year-Round#Figures-WindDirection</a>\nIt says that Cornwall quite often has west wind, but not all the time 😉</span></div><div class=\"comment_attachment\"><div class=\"link-tool\"><a class=\"link-tool__content link-tool__content--rendered\" target=\"_blank\" rel=\"nofollow\" href=\"https://l.facebook.com/l.php?u=https%3A%2F%2Fweatherspark.com%2Fy%2F149604%2FAverage-Weather-at-Newquay-Cornwall-Airport-United-Kingdom-Year-Round%23Figures-WindDirection&amp;h=AT3OWUf0QIk-iikIdK-xMakrra1DLXt0zZfGGFe2aF6b2npljPtAXHPjICxlmIQY_Z-pwUwEMEWo_bcbOsDyWnaYDltrdOuJedNIvhYtoHEMLuAZqMTtcIoVTY1R1ptqVsbh8TPWVx38IGI&amp;s=1\"><div class=\"link-tool__image\"><img loading=\"lazy\" src=\"https://weatherspark.com/fingerprint/weatherspark_149604.png\" alt=\"\"></div><div class=\"link-tool__title\">Newquay Cornwall Airport Climate, Weather By Month, Average Temperature (United Kingdom) - Weather Spark</div><span class=\"link-tool__anchor truncate\">weatherspark.com</span></a></div></div>","author":"Oleg Beloglazov","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_381659","type":"fbcomment","data":{"text":"<div class=\"comment_text\">It depends, planning is necessary if you are seeking gravel and trails vs asphalt and if reservations are necessary on campgrounds. But things don’t always go as planned, I also had to improvise because I ran behind schedule. On a very long trip and when not seeking gravel, they it’s a lot easier, minimal planning.</div>","author":"Guillaume Dougados","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_439760","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Guillaume Dougados\"> but you always have a high-level plan at least. Minimal planning is possible if you are familiar with the area you are going to and you know what to expect from it.\nWhen you are going to a new country you have never visited before, do you check the weather conditions for the time of your trip? Do you check availability of campsites or hotels?</span></div>","author":"Oleg Beloglazov","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_754828","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Oleg Beloglazov\"> I would, if I had the luxury to do such trips, I'm happy when I can take 2 or 3 consecutive days off work.</span></div>","author":"Guillaume Dougados","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_158431","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I say we plan and pack to the level of our fear, read lack of knowledge.  I mean that the less we know the more we feel the need to plan and carry.  Think about those who plan to the last degree.  They know what time they want to arrive at each night's accommodation.  They have packed every item that, under the worst-case scenario they might need.  They are carrying an extra bike frame.  Well maybe not, but you understand.  \n\nAre they doing it wrong?  Not for them.  First timers, in every field, often over prepare because they don't know what is ahead.  I understand that feeling.  I have been doing this human powered, self supported thing for over 60 years.  Yet, every first day brings a little nervousness.  The first night in my fabric home always brings questions.  Did I pack this, or will I need that, what if?  Those concerns are quickly dispensed because I do know that whatever happens, I can at least, deal with it.  I am mentally and physically prepared.  \n\nNew comers to adventure travel can alleviate this problem to some degree through study and both mental and physical preparation.  Read what experienced travelers have done, what they carry, how they prepare.  Learn how to handle challenges.  I have met many a traveling cyclist who did not know how to properly repair a flat tire!  Guess what?  They were nervous about flats.  Big surprise.   Know how to do at least basic repairs and practice them.  The same with your tent, cooking, and map reading.  To reduce your load, mental and physical make the appropriate preparations.  Learn.</div>","author":"Bill Heimann","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_891139","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Bill Heimann\"> totally agree. When you gain more experience you need less preparation.\nI just want to be sure that my trip will be great because I have quite a limited time in the year for going on a big trip.</span></div>","author":"Oleg Beloglazov","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_424244","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Glad us pilots don’t think that way.</div>","author":"Jeff Neumann","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_730211","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jeff Neumann\"> haha, agree. But they have completely different goals and level of responsibilities. They are paid for making the trip as smooth as possible.</span></div>","author":"Oleg Beloglazov","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_221776","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Oleg Beloglazov\"> so did you load up your refrigerator or a compact light weight camping stove?</span></div>","author":"Jeff Neumann","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_908311","type":"fbcomment","data":{"text":"<div class=\"comment_text\">We plan “flex days” into our trips to allow for mechanicals, illness, bad weather or simply liking a place and wanting to stay longer.  We have a plan of where we are stopping most nights and book the hotel the night before.</div>","author":"Cassy McGuinness","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_158523","type":"fbcomment","data":{"text":"<div class=\"comment_text\">What is important about planning is going to an area were you can enjoy your time there\nTo just pick an area because it sounds exotic isn’t the best approach \nDo research on if cycling is safe and your not on high volume roads most of the time\nAnd type of surface you want to ride on is another big factor \nSo planning a very specific route not required but the area and other major factors are very important</div>","author":"Charles Nighbor","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_518644","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Some of the weather sites have a monthly view &amp; future months will show the average high/low for each date. Great for deciding on gear &amp; layers.</div>","author":"Cordelia Min","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_782643","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Yes, I check them too. But they show the weather for only one place at a time. \nWhat if I want to check the weather on my route for a long ride? Need to check too many points. \nOr if I want to cycle light, how to understand what month is the best to go this route?</div>","author":"Oleg Beloglazov","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_287449","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I plan the first three days</div>","author":"Gary McClintock","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_393853","type":"fbcomment","data":{"text":"<div class=\"comment_text\">The map is great!</div>","author":"Denise Sauer","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_711757","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I ride with a general outline of my route and something if an idea how long I can ride; then, I just go.   If I wanted a planned, scheduled, safe \"adventure\" I'd buy a ticket to Disneyland for the day.\n\nOne of the facts of Life I've learned is that whatever I imagine it plan never turns out exactly right and, the more that I'm transfixed and expectant of some particular result, the greater my disappointment and suffering when it doesn't happen like I planned: it's an axiomatic truth.\n\nSo, my choice is either to make big involved complex plans which inevitably result in disappointment and suffering or, to make general plans of direction and duration and then ride in wonder and anticipation of discovery and enjoying the moments and miracles that happen when we are open to the world.\n\nSchedules and complex plans and objectives.... Post analysis of success and failure.....are the stuff of social Enterprise and business and capitalism..... All the stuff of mundane life as a cog and inmate of this social prison......a prison that I cycle tour to escape.</div>","author":"Samuel Lea","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_898916","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Make God smile.   Make plans.</div>","author":"Roger Leary","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_443181","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I like planning bike trips, it's part of the fun! 🗺️ Plans change but that's okay</div>","author":"Jason Roussel","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_602609","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Cool site!</div>","author":"Margaret Kosmala","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_31640","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I go to Europe July to Sep as I prefer cooler in fall &amp; I only camp &amp; use downfill sleeping bag. Then China in Dec to April. If I wanted to go to Kunming it would be June/July. The USA during summer as I camp too.</div>","author":"Ellen Lee","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_496494","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I look at the historical date for the time frame and pack according to temp.  I only pack a clean outfit (after riding), sleep outfit, riding outfit then layers and rain gear.</div>","author":"Pamela Murray","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_325937","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I enjoy the planning part but quickly realized I needed a Plan A, a Plan B and a Plan C based on timing, weather, etc etc etc. \n\nI tend to make a multi page dossier with printed maps, points of interest, and routes I'd like to take. I then have at least 2 back ups and pre look at stealth options. \n\nIn the past, I've made some ride days too long or too short and there have been a few cases where we had to fall back onto a stealth plan instead of where we'd hope to camp. \n\nMy biggest rookie mistake was getting my atm card shut off leaving me cashless for a few days- now I always hide cash. \n\nI'm digging \"Touring Stories\" I'll have to make an account to see yours I think.</div>","author":"Lindsey Hamma","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_721092","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I have only done short trips, fewer than 10 days, and I probably plan too much. I have been a little flexible, but I mostly travel in areas I know well. I think I need to plan a bit less, if I’m going to be successful in longer trips.</div>","author":"Carlos Alcala","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_113433","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I hardly plan.  Just the date, the start, and the probable end.  And two or three likely routes. A couple of times I ended up at a destination I hadn't planned for.  I do look for places I might like to visit in route.  Regarding stays it depends upon what region in the world.  I look up campgrounds for my trips to Europe and sometimes also in the US.  Central América and SE Asia I generally rely on cheap lodging since there are less campgrounds and lodging IS cheap.  So I do no research.  I stay where I find something.  I always am open to the possibly of wild camping.  In fact that's the exact reason I don't have to plan.\n\nI've rarely ended up following the route I originally thought I was going to do.\n\nI bring the same gear for everything.  Five days or five months.  Clothes layers... No cooking gear.  Just food preparation stuff but without the cooking.  Really.  My biggest planning is simply the probable routes.  In making those i look for interesting things to see and do.  That's it.  I rely on following locals suggestions or other things I encounter to define the actual things I do on the trip.</div>","author":"Daniel Ellsworth","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_337399","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I’m traveling with young kids, over planning (even if reservations aren’t made) will save the trip.\n\nYou also need to know how busy it is. Getting stuck with nowhere, or somewhere far off the path isn’t fun either.\n\nFinally, knowing where sites are and planning for them really helps if you actually want to do them, or even know they are there. Sucks finding out you rode right past something you’d have loved to see but didn’t know it was there.</div>","author":"Kevin Voll","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_791160","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Kevin Voll\"> that's very interesting, thanks for sharing. \n\nIt's possible to make some \"busy area index\". For example, check the total number of hotels and cafes in the area and put it on a map. Will it be helpful?\n\nThe same with points of interest. It's possible to aggregate them and show the list of great places to visit in selected regions.</span></div>","author":"Oleg Beloglazov","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_561018","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Oleg Beloglazov\"> The points of interest are great. As for busy, not sure, it can be so date specific. Last year we were going with the flow as a family, but unfortunately hit one place we wanted to stay on a Saturday in the summer, next closest stop was too far, nearest available hotel was like 30-40km out of the way off the path. Any other day of the week probably would have been fine, but we didn’t realize how popular it was.</span></div>","author":"Kevin Voll","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_685109","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I'm doing Canada to Ushaia next year. I have my start and stop, nothing planned in between.</div>","author":"Brian Sculac","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_490035","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Be careful paying a lot of attention to average temperatures. Also look at recent trends and ranges. I was somewhere last summer that had average highs in the low 80s (F) that time of year, but had several days up around 100F.</div>","author":"Rodney Boles","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_48698","type":"fbcomment","data":{"text":"<div class=\"comment_text\">It’s reassuring to plan the first day or two in a new country in some detail including a plan B or two bit after that I prefer a sketch idea of objectives be that places to visit, circumnavigation or days at the beach. But a degree of planning can save dither or ending up in cycling cul de sacs where the only way forward involves a nightmarish tunnel or highway. But we all find what works for us.</div>","author":"John Knapp","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}