{"time":1655213534834,"version":"2.23.2","blocks":[{"id":"id_43764","type":"header","data":{"text":"Powerbanks in Summer: Any Tips for Cooling?","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_169471","type":"paragraph","data":{"text":"<i>Hi! Question about powerbanks while biketouring in summer: any tricks for keeping them cool on hot days? Thanks!\n\nAnd while I'm at it I might as well ask; do you use chargers of different brands than the powerbank? On the one from Anker that I just bought it says it could be dangerous..?\n\nLeaving in July for my first tour Netherlands-Germany-Poland-Czechia and who knows from there, very excited 👏🏼😁💚</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_639063","type":"delimiter","data":{}},{"id":"id_368021","type":"fbcomment","data":{"text":"<div class=\"comment_text\">A good question. Place them deep as possible im your bags. Dont put them in the direct sunlight</div>","author":"Andreas Morti Lüdecke","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_771596","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I just keep powerbanks rather deep inside my panniers, it never occured to me to worry about their temperature too much. I worry more about food, but a simple and cheap solution is a thermo-isolated bag from any supermarket.\n\nAs for the chargers, I use Anker powerbanks and an Anker charger. But again, rather for compatibility than for safety - my primary concern is the speed and effectiveness of charging (especially with all those various high-speed charging technologies).</div>","author":"Marcin Kysiak","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_945973","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Just like any other electronics, don't let them sit in direct sunlight for too long. Just keep them in your bags and they'll be fine.\nChargers, no, it doesn't matter - as long as you steer clear of the cheapest no-name brands. Though if your power bank has some kind of high-speed charging - the most common now is usb C power delivery, then you might want to get a charger that can do that.</div>","author":"Tom Platts-Mills","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_240293","type":"fbcomment","data":{"text":"<div class=\"comment_text\">USB devices are supposed to \"talk\" and the device needing charging is supposed to tell the charger device how much current and what voltage to use. \n\nA simple way to figure out of to look at charging specifications of the power Bank - 5, 10 and 15 W (for watts) are most common and buy a matching charger.</div>","author":"Mahesh T Pai","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_566046","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I use white powerbanks and keep them in me frame bag or feedbag/bottle cage with reflectix in it i use ugreen 100 watt gan pro charger to charge all 4 powerbanks with max power 30.000 mah takes 6 hours with 22.5 watts charging</div>","author":"Menno Pieters","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_772355","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Menno Pieters\">clever! I should have gotten the white one</span></div>","author":"Juliette Polgár","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_606539","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Juliette Polgár\"> yes and no metal casing like the anker ones if your gonna be flying with them also they cant be bigger then 100wh and my 30.000 mah powerbanks are 111wh so they cant go on most flights but i ride my bike everywhere or take a boat idc hate flying anyway haha</span></div>","author":"Menno Pieters","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_843168","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Powerbanks getting hot during use, or during charging, is normal. Keep them out of direct sun, but if you can somewhere with airflow to cool the battery. Someone has already mentioned white powerbanks. The white shell will reflect more heat.\nPowerbanks getting hot when not in use is not normal. You could have a fault. This might indicate a short circuit within the powerbank, or some other fault. If the unit is in any way deformed, or swollen, immediately replace it. It could catch fire.</div>","author":"Mark Perry","gender":"UNKNOWN","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_991240","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I have never had a problem with powerbanks overheating in the sun just by keeping them in my bar bag. I use Anker and use whatever charger is to hand. Again, never a problem.</div>","author":"Steve Lindley","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_141876","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I like Voltaic.  White, bright capacity meters, and they do passthrough charging.</div>","author":"Gerald Prokop","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}