{"time":1655477272677,"version":"2.23.2","blocks":[{"id":"id_694882","type":"header","data":{"text":"Preparation and Planning for a Bikepacking Trip Before a Month","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_249910","type":"paragraph","data":{"text":"<i>If you’re setting off for a big bikepacking trip (600+ miles), are there any tips for preparation the month before? Or week before? \nI know I’ll want to keep getting stronger on the bike up until the ride, and I’m guessing I’ll want to only do zone 1-2 rides the week before so I can recover but stay moving. But I honestly don’t know for sure. \nThis will be my first multi day bikepacking trip and first back to back big 80-100 mile days. I’ve done multiple longer rides, just not back to back. \nI just want to be properly prepared (getting nervous). Thanks in advance for tips/ advice ☺️</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_299967","type":"delimiter","data":{}},{"id":"id_832890","type":"fbcomment","data":{"text":"<div class=\"comment_text\">The best thing you canndo at that point is to get your mind ready.</div>","author":"Jan Bennett","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_252786","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jan Bennett\">  I’m 50/50 if I’ll mentally burn out or just be so excited to be in nature and not working 🤔</span></div>","author":"Tami Nelson","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_623005","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Following! I’m in a similar situation</div>","author":"Christian Huber","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_142264","type":"fbcomment","data":{"text":"<div class=\"comment_text\">80 miles on a touring bike is a lot of effort \nAnd doing on first days not the best idea out there\nCould get sore knee’s etc\nAnd that isn’t fun to ride with\nReplan 1st days to shorten them</div>","author":"Charles Nighbor","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_699818","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Charles Nighbor\"> unfortunately due to the route my first two days won’t have much options other than pull off the trail and camp. But if I do that, we won’t have resupply options for the night. So they’ll be the longest two days. \n\nI am a bit worried about my knee. The voltaren gel seems to help calm the early arthritis (lady tboned and smashed my femur)</span></div>","author":"Tami Nelson","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_39657","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Ride your bike fully loaded in every condition the month before. Start with new chain, tires and drive train that month.\nPrepare for failures.</div>","author":"Kevin Hinton","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_203513","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Kevin Hinton\"> drivetrain and chain is fairly new and good condition. New brake pads went on last week. New tires will go on though! \nFigured I’ll have the shop do a full look over. \n\nTried to think of all the random things that could fail me</span></div>","author":"Tami Nelson","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_631515","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tami Nelson\">  it’s a mental now</span></div>","author":"Kevin Hinton","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_630162","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tami Nelson\"> gear cable. Take one...unless you run electric shifting 🤪</span></div>","author":"Mark Liddle","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_884366","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Eat.all.the.time.   oh and try to relax and remember you are doing it for fun. What that means in a practical sense is listen to your body and ditch the plan if you need to. There is no way that what you think is your mapped out route and stops are going to actually be the ride you do - but that's part of the fun, oh and just remember to keep eating... literally all the time 🤟</div>","author":"Mark Liddle","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_199844","type":"fbcomment","data":{"text":"<div class=\"comment_text\">My plan is to ride from here in Tennessee to the PNW, so I feel you completely.</div>","author":"Matt Campbell","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_6841","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Matt Campbell\"> holy smokes that will be an epic adventure!</span></div>","author":"Tami Nelson","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_574493","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I’m 10,200 miles into my current tour and I’d say don’t over think it. You sound like you’ve thought it out. Trust yourself. Each day will have challenges you didn’t anticipate and joys you never knew existed. Know you can handle and appreciate them.</div>","author":"Parks Pilgrimage","gender":"NEUTER","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_774519","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Parks Pilgrimage\"> I’ve overthought it lol 😅🙈\nI just want to ensure I’m as prepared as I can be. \n\nI’m mostly worried about the long back to back days with lots of climbing. \n\nThe trip will be in time to celebrate my 2 years of being alive. I was hit crossing the road by a gal doing 60mph- leaving me in a coma for a week and hospital for a month and had to do PT for almost a year to walk again. \nSo I guess mentally I’m so worried about my capabilities since it felt like I had to start fresh building muscle after that</span></div>","author":"Tami Nelson","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_772884","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tami Nelson\"> Whether you hit your daily goals or not will play out. \n  You’ve already triumphed. \n   Celebrate the ride. If you don’t make your intended miles does that mean you failed? If you do, does that make your tour is a success?\n   You sound pretty damn amazing and I am glad you didn’t loss your sense of joy and adventure with the trauma you experienced. \n  I can’t imagine anything will be harder that what you have already been through. My only advice is that tours are organic experiences—they are not a sum total of the miles and the terrain, but an expanding collage of landscapes, weather, mood, people , and a thousand other ingredients that combine into an imprint on your soul. \n\nIt is great to challenge yourself and set hard goals—they help us focus and give us motivation—but it is easy for them to overwhelm what they were meant to prepare us for. \nThe body is incredible. You know.  You’ve had to reteach it everything. \nWhat I have learned is that anxiety can decrease performance. We can talk ourselves into defeat. We can stress so much about achieving our goals that we almost convince ourselves that they are unattainable. \nI’ll go back to my first point. If you don’t make the miles you wanted did that mean you failed? \n  Some days you will hit your miles, some days you won’t. Some days you’ll crush it and make more miles than you planned. What you don’t want to do is dread the days because you might fail. \n You triumph by leaving on your tour. By continuing to strive to be better. You’re riding that razor’s edge between prepared and stressed. Pull back a little. Remember that this is a celebration not a race.</span></div>","author":"Parks Pilgrimage","gender":"NEUTER","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_863246","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Parks Pilgrimage\"> I think the biggest thing I’m worried about is making it into the next town for the night to be able to resupply water and get food. Since it’ll be along gravel fire roads and through remote areas. The first day the first town is mile 106ish. The second day is the same way. \nThe rest are easy to break up if need be. \n\nBut I definitely love that mindset. I’m out in nature and already triumphing!! Great way to look at it! And thanks for the encouraging words!</span></div>","author":"Tami Nelson","gender":"FEMALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_309549","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tami Nelson\"> when I’m crossing long distances with little to no services I carry extra food and water. It may slow me down, but I’d rather over carry than under carry. I ran out of water once doing the Western Express and it got real very fast. It sucks, but it is better than the alternative.</span></div>","author":"Parks Pilgrimage","gender":"NEUTER","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_965273","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Parks Pilgrimage\"> definitely agree! Food is easy to pack extra of. Water I’m hoping I’ll be ok with 2L in my hydration pack, and just shy of 2L in the frame bag (apidura bladder), and then 34oz that I’m hoping I can get on my saddle bag</span></div>","author":"Tami Nelson","gender":"FEMALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_910719","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tami Nelson\"> - look at what you’ve already overcome. You’re awesome, and you must have an incredibly strong will. You got this!!!! \nPost pics along the way, we’d all love to see your journey.</span></div>","author":"Rollin Downhill","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_631211","type":"fbcomment","data":{"text":"<div class=\"comment_text\">80 to 100 miles is ok if you know your route. If you have to stop and look at your navigation device, it's much longer.</div>","author":"Robin Verner","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_867771","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Start out easy the first week or two.  Do 50-60 miles max at the start.  You will gain strength and endurance over time, but let your body (seat and arms get used to holding up your weight as you go). It more important to make certain you have good equipment, tires (spare also), tubes, tools any small repair parts (chain tool, links and a short section of chain), a few spokes and zip ties.  If you breakdown on the road you want to be able to repair to get to next town.  If you're going W2E, work on hills with a test load to get used to climbing and handling the load.  I did a 4,400 mile 11 week your and we started in IN and by the time we hit the Rockies, we had 4-5 weeks of riding, E2W does have it's advantages.  Double check what you think you need vs. what you really need. You don't want to wait until you into your trip to find you've packed too much weight.</div>","author":"Mark Krause","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_762322","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Mark Krause\"> I’ve been doing back to back 50-70 mile rides and that has been ok. But they don’t have quite as much elevation on most of the rides. \n\nRight now I’m doing about 200 miles a week. \n\nHave tools, extra master links, and extra sealant packed. Will put fresh tires on week before. New brake pads. Chain and drivetrain are fairly new and looked good. Spokes are internally threaded, so hopefully no issues with those.\n\nCorrect we’ll be doing W2E. I def think I should be doing a few more days fully loaded. Thankfully when I rode with everything it didn’t feel too terribly much different. \n\nI have my checklist made up, so I think I have it fairly minimal- at least I hope.</span></div>","author":"Tami Nelson","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_368217","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Could you share your checklist with me? I am getting ready for my first trip and my biggest concern is my lack of bike repair experience (aside from fixing flats).</div>","author":"Amad Doratotaj","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_525394","type":"fbcomment","data":{"text":"<div class=\"comment_text\">You’ll probably be fine. If you haven’t already done so try several overnight trips to check out your gear and how it fits you and your needs. You don’t want to get on the trail and realize you are deficient in one area or another or overstocked in one area or another. Enjoy the trail!￼￼</div>","author":"Robert Loftin","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_297400","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Robert Loftin\"> definitely want to do another test run with my tent. But did a test run with everything and used a bivvy (discovered it wasn’t as bad as I thought but also don’t think I’d enjoy multiple days of it).</span></div>","author":"Tami Nelson","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_533195","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tami Nelson\"> I literally hate a bivy. The nights I have spent in them was fine when I was young but as I get older I need more room. I use a big Agnes tiger wall 2 now and enjoy it. ￼</span></div>","author":"Robert Loftin","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_533212","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Robert Loftin\"> I have the BA fly creek bikepack tent. Just need to practice setting it up and see how it fits in the saddle bag or on my bars 🙌🏼</span></div>","author":"Tami Nelson","gender":"FEMALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_812118","type":"fbcomment","data":{"text":"<div class=\"comment_text\">listen to david goggins cant hurt me auidobook a bunch and feel inspired to break your perceived limits</div>","author":"Christian Ramos","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_968796","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Christian Ramos\"> ooooh I’ll have to search for that!</span></div>","author":"Tami Nelson","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_732140","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I would highly recommend doing a shorter overnighter before your big trip to test out gear and see how your body will react to multiple days. \n\nI shed 10-15 pounds of gear from my initial trip to my big ride, and will probably shed another 5lbs or so before my next one. \n\nEven just learning how my body would handle being in the saddle for that long and fine tu ing a bunch of stuff that I wouldn’t have known without a trial run.</div>","author":"Justin Keitch","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_751651","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Justin Keitch\"> I’ve done an overnight trip and feel decent with the gear (minus swapping bivvy for a tent). \nThe body sitting that long is a definite concern. I’m hoping that as long as I take a break and stand every few hours it’ll help.</span></div>","author":"Tami Nelson","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_759833","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Don't forget the suncream. And a spare derailleur hanger. And chain lube. A good jacket, and warm gloves.  Just ride, a bike trip is not really different from daily rides. You just don't come back home.</div>","author":"Pierre Moreels","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_183088","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Pierre Moreels\"> have those on my checklist! \nI made the mistake of forgetting gloves my first overnight and burrrr</span></div>","author":"Tami Nelson","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_507030","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tami Nelson\"> as I am getting older, I notice my hands get cold faster, and I also hate very much to have cold hands. So now packing warm gloves is a very important priority. I don't recommend to get your chest cold, but it can happen - if it happens, try to find some paper. Newspaper or wrapping paper or whatever. Make balls out of it and stuff it inside your jersey. The insulation will keep you warm. I've used this more than once. One time when my kid was a baby and I forgot to pack his jacket, I stuffed spare diapers in his clothes with the same insulation idea.</span></div>","author":"Pierre Moreels","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_680246","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Is this on road or off road and have you ridden your bike 100 miles fully loaded before?</div>","author":"Dave Henderson","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_666189","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Dave Henderson\"> gravel- mostly fire roads. \nI’ve ridden 100+ miles on my gravel bike but not fully loaded. Fully loaded I’ve done 65 and it felt fine. \nBiggest issue was the saddle bag would hit the rear tire on really rough terrain (was on a mtb trail though to be fair) and I’m only 5’2 so I can’t raise my seat anymore 🙈</span></div>","author":"Tami Nelson","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_629931","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Yeah, a lot of shorter folks opt for small panniers instead of the saddle bag for that very reason. Means you can use a dropper too if that's yer bag.\n\nHow rigid is your plan? Because a bunch of 100 mile days on potentially rough terrain will be pretty tough for most people. Doesn't seem like it leaves much wiggle room if something doesn't go to plan. Mechanical issues etc...\n\nSeems like you're physically prepared and assuming you have your gear in order it all sounds good on paper, but if you're set on those big days, I'd have a plan B.</div>","author":"Dave Henderson","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_423298","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Dave Henderson\">  I’m on a gravel bike. So don’t have an option to mount panniers on my bike. And no dropper  \n\nIt’s fairly flexible due to limited time off for this. I have a plan for 6, 7 and 8 days to complete the 630 miles. \nI’m hoping there won’t be any rough terrain or sand to contend with. I’ll have to ask one of the guys who completed it if there was any. \n\nGosh I hope I’m physically prepared. I’m always doubting my abilities though and then surprise myself of what the body is capable of 🙌🏼</span></div>","author":"Tami Nelson","gender":"FEMALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_41604","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Plenty of \"gravel\" bikes have rack mounts, but failing that, the Tailfin system is great! It even has an optional extension to move it further back to help shorter riders.\n\nI'm sure you'll be fine! I'll echo what I saw another guy say and suggest you try not to overdo it on the first day or two. It pays to ease into it.</div>","author":"Dave Henderson","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_60884","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Dave Henderson\"> I have a factor LS. Basically a “race oriented” gravel bike - very similar to cervelo aspero. \n\nI’ll have to see what the tail fin is or if it would work.</span></div>","author":"Tami Nelson","gender":"FEMALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_64590","type":"fbcomment","data":{"text":"<div class=\"comment_attachment\"><div class=\"comment_photo_attachment\"><img class=\"comment_photo_image\" loading=\"lazy\" src=\"/images/community/preparation-and-planning-for-a-bikepacking-trip-before-a-month/image_1655477272_3082024955.jpg\" alt=\"\"></div></div>","author":"Tami Nelson","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_152758","type":"fbcomment","data":{"text":"<div class=\"comment_text\">The tailfin is pretty popular with guys who do the IndyPac and TransContinental and those sorts of ride. Their first product was called the \"Aeropack\" if that's a clue. 😅</div>","author":"Dave Henderson","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_243973","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Dave Henderson\"> not ringing a bell. I’m still fairly new into cycling. I just came over from the moto world 🙌🏼</span></div>","author":"Tami Nelson","gender":"FEMALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_225605","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tami Nelson\"> you can mount a rack on pretty much any bike. Tubus sells a kit to mount the lower end off quick release skewers. And the top can be attached to the seatpost clamp, or to the seatstays etc. In terms of weight, take the Tubus Airy rack and Arkel Dry-Lite panniers, and this gives you a lightweight setup and capacity and convenience that will be very hard to match with frame bags. Very hard to match.</span></div>","author":"Pierre Moreels","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_693731","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Load up your bike and ride on the kind of terrain your trip will be on. Do an over-nighter to see what you can leave at home.</div>","author":"Daren Eaken","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_613825","type":"fbcomment","data":{"text":"<div class=\"comment_text\">In the last 2 weeks, keep training but no long rides. Short tempo sessions are good. Use the time to check out refuel and water stops on route., Knowing where you can find bike shops and accommodation can also be useful. On your first days, don’t push too hard or you r legs will pay after a few days.</div>","author":"Steve Coombs","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_626994","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I put all my bags on my rig and ride fully loaded every day for yhe better psrt of 8 months. someday it's a 25 mile sprint, some days it's 12 hour 100 mile days. depends how the legs are feeling. \n\nonce racing, I set a goal, 65 miles, then 80, then 90, then 100. once I hit those goals I stop. if it takes 8bhours and I get to rest that's OK. if it takes 18 hours as some of those 10k feet days do, then that's OK too. go by goal not by time.\n\nto be specific, the last week before w race I just make sure to eat according to my nutrition menu, make sure everything is just so, and go for easy long but low elevation rides.</div>","author":"Damien Robinson","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_976417","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Plan days off for recovery / repair etc.</div>","author":"Daniel Hawken","gender":"UNKNOWN","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_804240","type":"fbcomment","data":{"text":"<div class=\"comment_text\">after 3 days it doesnt matter</div>","author":"Peter Talley","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_702999","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I usually go easy for about 3 weeks leading up to a big ride. Once a week I’ll do a longer 4-5 hr ride. Sleep lots, eat real clean.</div>","author":"Eddie O'Dea","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_575403","type":"fbcomment","data":{"text":"<div class=\"comment_text\">There's only so much more you can do to get more fit in a limited period of time. One thing you can do to make life easier, is tweak your gear and logistics so you spend less time setting up/breaking camp and planning once you've hit the road / trail 🤔😆</div>","author":"J.c. Mcguirk","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_244840","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Ride, a lot. If you can't do a two hour ride it try getting in two, one hour rides in the morning and evening. Have a few rest days before you start and rest if you get injured instead of trying to push through it. Pace yourself, eat a lot and drink lots of water too when you're touring. As long you're in decent shape, pace correctly, and are properly fueled/hydrated you can keep the pedals turning as  long as you want</div>","author":"Jacob Ashton","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_639714","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jacob Ashton\"> I’ve been doing mostly 2 hour rides during the week and 4 hour rides on the weekends. \n\nWater is my concern for the second day. There is no refill options for 100 miles between towns. So hopefully I’ll have enough. 2L on my back. Between 1.5-2L in the frame bladder. Then an extra 34 oz strapped to the bike. 🤞🏻</span></div>","author":"Tami Nelson","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_402946","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tami Nelson\"> as long as you start out properly hydrated and it's not too hot or on challenging terrain you'll probably be okay. More would be ideal but, chances are, you'll survive 😉</span></div>","author":"Jacob Ashton","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_920480","type":"fbcomment","data":{"text":"<div class=\"comment_text\">stay consistent with warmup and cool down stretching</div>","author":"John Capitan","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}