{"time":1660812017260,"version":"2.23.2","blocks":[{"id":"id_896332","type":"header","data":{"text":"Shorter Stem and Twitchy Steering","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_107549","type":"paragraph","data":{"text":"<i>Got a professional bike fit prior to my upcoming tour.  He recommended a shorter stem for a more comfortable, more upright position.  This was marginally effective.  However, the handlebars were more twitchy. After a few rides, got that under control. Put on rack and empty panniers and the twitchyness was back. Concerned about full load. Could you share your thoughts on stem length and front load.</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_671550","type":"delimiter","data":{}},{"id":"id_896224","type":"fbcomment","data":{"text":"<div class=\"comment_text\">The weight is slowing down the steering.</div>","author":"Broom Wagon","gender":"NEUTER","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_700194","type":"fbcomment","data":{"text":"<div class=\"comment_text\">It will likely never be perfect. Sometimes you just gotta send it</div>","author":"Jeff Roe","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_264868","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Show us the front panniers set up</div>","author":"Tedi Kresna Wardhana","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_594850","type":"fbcomment","data":{"text":"<div class=\"comment_text\">The longer stem slows down the steering. The shorter stem will slow it down less than you are used to. Magic words ' than you are used to'. You will get used to it. The same way as you got used to carrying a load on the front. After a while you won't even notice it. \nLong term you will benefit from the new bike fit, but you won't notice the missing aches and fatigue that will not be there, as a result of the better fit.</div>","author":"Mark Perry","gender":"UNKNOWN","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_722158","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Mark 👍</div>","author":"Lincs Hcrib","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_272172","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Is there not a difference between bike fit and touring bike fit. i.e. touring.</div>","author":"GaryGary Sheridan","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_400528","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Try fitting the rack and bags as low as you safely can \nI found it sorted out the problem</div>","author":"Andy Stupples","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_351753","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Think you’ll be fine. As mentioned earlier you get used to it very quickly. When I move from my road bike to touring bike the steering feels frighteningly twitchy, but within a short period it’s fine. The important thing is that the bike is comfortable for you to ride. Just make sure you balance the weight on each side</div>","author":"Adrian Camm","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_54647","type":"fbcomment","data":{"text":"<div class=\"comment_text\">A bike fit is a good idea. The primary issue is how comfortable you are on the bike. I find a more upright position more comfortable. The twitchiness could just be getting used to it. As people have said, ensure the weight is even across both wheels. I have invested in a steering dampner. I noticed a difference straight away.</div>","author":"John McDermott","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_222477","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"John McDermott\"> I think you got that exactly right.  Mine felt \"twitchy\" at first too, because the shorter stem means the wheel is turning in a smaller circle [shorter radius with short stem].\n\nNow I love it.  It's essentially a kind of \"cyclocross\" setup on a road bike [or endurance road-bike].  The leg and back muscles seem to like it much more.  No more aches and pains.</span></div>","author":"Bruce Conway","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_293171","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Front panniers usually make a touring bike less twitchy, like riding on rails. But they have front end geometry (head tube angle and trail) designed for the purpose. What sort of bike are you riding?</div>","author":"David Backhouse","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_54883","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Flat bars, not too wide, help a lot. I have a longer stem for what they call a more relaxed ride, especially when loaded.</div>","author":"John Mellor","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_505784","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Try with loaded front panniers. If you have large and small panniers try the larger ones on the front.</div>","author":"Hugh Wilson","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_932618","type":"fbcomment","data":{"text":"<div class=\"comment_text\">You will eventually get used to the twitchiness, try balancing the load better as this can help and take your time compared to riding a bike without gear on it, allow for more stopping time/manoeuvres etc .</div>","author":"Scott Jones","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_189489","type":"fbcomment","data":{"text":"<div class=\"comment_text\">You get used to it. I have 15kg on my front. I'm used to it. When I take everything off, which is rare, it's extremely twitchy for a few minutes until muscle memory remembers how ride a \"naked\" bike again</div>","author":"Adir Sharon","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_405724","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Thanks.  As a mountain bike rider have played with stem/handlebar lengths. Some stems were too short and never got over the too fast steering.  So I believe there is such a thing as too short.  Maybe fully loaded will dampen the steering, that makes sense.  As to professional fit, I am not sold.  Told him my goals and he just assumed a more upright position would be more comfortable.  I had rode thousands kms, including a 70 day tour....0 pain, stiffness, etc.  No change in pedal height. We did dial in saddle, but I did that. Just easier with help and a stand.  Got same results solo, just takes a lot longer.  As to flat bars....not enough hand position.  I ride mountain bike more often than touring/gravel bike.  I am intrigued by butterfly bars though.</div>","author":"Tom Watson","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_683550","type":"fbcomment","data":{"text":"<div class=\"comment_text\">'Twitchy' is all you.  Sounds like you were accustomed to an odd fit where you had to over-compensate for a poor posture, &amp; fixing the posture gave you a sudden over-abundance of strength where you could relax a bit.  Just continue to settle into it.  I always want to avoid over-loading the inertia in the steering rotation so I can react easily.  \n\nKeep aware of the fact that on a diamond frame a lot of balance is in micro-cantilever rotations from your feet that you normally don't think about - what I had to re-learn when I switched to a high-racer recumbent where I had to make those same micro-cantilever rotations from my hips instead of my feet.</div>","author":"Mike Dannheim","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_667405","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Twitchiness will most likely be caused by not enough weight on the front wheel. Add paniers to the front and  you should solve the problem. P.S. i've been fitting bikes to their owners professionally for over 30 years.</div>","author":"Ed Hall","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_717611","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I had my stem shortened about a year ago.  Was very suspicious at first because now I'm no longer Tadej Pogacar in the Tour de France, just a regular (cyclo-cross-ish) dude on a bike.  I find it \"extremely\" comfortable. I can go longer distances because of it, but it's probably slightly tougher against the wind, unless you get down on the drops.  Still, 120 km feels like a breeze now.  Just a wonderful ride, without having to stoop down all the time.\n\nBut, I think one has to back up every so often and ask oneself: What am I doing on this bike? before even getting to the bikefit.  So, I try to list the reasons:\n\n1. Health, happiness, well-being.\n2. Pandemic-era transportation and distancing while travelling.\n3. Loneliness: you want to see people, somehow, some way.\n4. Exploration, navigation, mapping, discovery.\n5. Racing?\n\nFor others, they may have different reasons:\n\n1. To deliver groceries.\n2. To walk my niece to school 9 km away.\n3. Travelling about visiting friends.\n4. Going fishing, and back again.\n5. Just for fun, to get out a bit.\n6.  \"Because I have nuthin better to do.\"\n7. To help me think.\n8. To get away from my wife/husband/girlfriend/boyfriend.\n\nSo, whether it's an escape vehicle, or for delivering eggs, or for exercise, or for winning the Tour de France, the bike has to be fashioned into some kind of specialized instrument to achieve that purpose.\n\nIf I'm training for the Tour de France, I'd go for a long stem. All other situations I'd look at shortening the stem, because doing so changes your entire body position and the way the muscles work, to make it easier (in my opinion).  The alleged loss of aero also comes with a gain in comfort.  The gain in comfort alone should provide more speed, even if you lose some from the loss of aero.</div>","author":"Bruce Conway","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_615006","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Over the years of working in bike shops I have encountered many different systems that purport to provide people with optimal fit on their bike.  If optimal fit was science the various systems would all come to the same conclusion, they don’t.\nFitting on a bike changes in the bike industry and among professional riders.  \nMy own position on my bike even changes from early Spring to late Summer as my fitness level changes.\nThat one person who installed that one stem to fit one rider on one bike based on their one system might be wrong.\nIt’s ok to try a new riding position for a while and then decide it doesn’t work for you. Change it again.\nIt can take me over a year to get my position just right on a new bike.</div>","author":"Curtis Evans","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_925937","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Curtis Evans\"> not at $200 a pop. And if there is no science, what's the point in a pro bike fit?  Other than it's faster? Grips on the MTN bike ..can tell if it's not right.   Takes a while cause ride, break out tool, adjust, put away repeat, untill it's right.</span></div>","author":"Tom Watson","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_666149","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I am curious if the fit was traditional road or was it geared towards touring?  In my shop the fits would not be conducive to touring....</div>","author":"Kent Robinson","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_164737","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Kent Robinson\"> touring</span></div>","author":"Tom Watson","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_2113","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Be careful with being too upright. There's a sweet spot for being comfortable after that you are losing so much wattage because of drag due to body position. Biggest gains on the bike are aero gains regardless you are going slow or fast. That's why a lot of tourers are getting rid of side bags and using more and more saddle and frame packs. You ride one less hour to get to your destination you'll be more comfortable and fresh.</div>","author":"Ali Albayrak","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_681148","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Get a box for your bits on the handle bars. Ortleib make a good one that locks on, adds a bit of weight to the front, making it a little less twitchy.</div>","author":"Mountcraig King","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_717646","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Try narrower handlebars rather than a shorter stem. That’ll bring your arms together which lengthens the reach.</div>","author":"David Dancyger","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_418452","type":"fbcomment","data":{"text":"<div class=\"comment_text\">How about get an adjustable stem and tweek out the twitch yourself. Along with some extra weight moved from the back to the front</div>","author":"Dale Nimmo","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}