{"time":1655974891926,"version":"2.23.2","blocks":[{"id":"id_382722","type":"header","data":{"text":"Size of Rear Panniers for Basics Camping Equipment?","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_701034","type":"paragraph","data":{"text":"<i>Hi all, newbie question here.\n\nHow large should rear panniers be to contain standard camping gear eg tent, bag, mat, clothes etc.  \n\nI'm having trouble dealing with litres in my head.  Many thanks</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_66438","type":"delimiter","data":{}},{"id":"id_892812","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Different t foreverybody. It really depends on how much you plan to take and the climate. For eg I think mine are 20 litres and I can get all I need for 2 weeks camping minus food which I buy daily. but if you're going off the beaten track you need extra for food water.</div>","author":"John Axson","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_426356","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I'm having the same issue. Deciding between 32L or 48L? How much is too much? I know it all depends on how much gear and how long you'll be gone, but just for basics, what appropriate?</div>","author":"Darryl Pierce","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_118722","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Darryl Pierce\"> I'd go for 48 litre.</span></div>","author":"Christine Roche","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_420285","type":"fbcomment","data":{"text":"<div class=\"comment_text\">What are you looking at? When it comes to this my opinion is it doesn't hurt to have extra space but it could not to. Personally, I just want a trailer.</div>","author":"Brian Halley","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_181766","type":"fbcomment","data":{"text":"<div class=\"comment_text\">First off, you should always buy the largest panniers as you can get. The quality ones are cut a little differently and do not interfere with your feet when you pedal.\n\nAnd I hate to tell you this but, different camping gear compresses down to different sizes and really the only way to find out is by trial and error. Sorry. 😕￼￼￼</div><div class=\"comment_attachment\"><div class=\"comment_photo_attachment\"><img class=\"comment_photo_image\" loading=\"lazy\" src=\"/images/community/size-of-rear-panniers-for-basic-camping-equipment/image_1655974891_1316271765.jpg\" alt=\"\"></div></div>","author":"Louie Garcia","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_421070","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Travel as light as possible, it makes hills easier, \nThat's just my opinion 😊</div>","author":"Alan Tucker","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_395048","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Better to have larger panniers that you only half fill than smaller pannier that won't fit everything.  Mind you, you could always get another bag that sits on top of the rack, etc... The standard \"ortlieb\" type set up such as that in the pic posted in the comments is a pretty good starting point.  That's what I use and it fits everything in your list plus a little bit more if needed.</div>","author":"Tory Puglisi","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_347422","type":"fbcomment","data":{"text":"<div class=\"comment_text\">\"Standard\" is totally different for everyone.</div>","author":"Carter AL","gender":"NEUTER","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_965503","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Do you have a rucsac with a known capacity, perhaps a medium day pack?  If so, get all your stuff together that you think you will take.  Then put aside anything that's a maybe. (because you probably shouldn't be taking it - cut down spare clothes and footwear especially).  Pack the rest.. see how many of those daysac's your gear fills.  Then you'll know.  But if I had to pick, for someone starting up, I'd guess 20L each side is about right.  That's pretty standard for rear panniers.  Tent can go separate, strapped on top of the rack, so you don't have to include that.  Maybe plus a handlebar bag, say 6L.</div>","author":"Ian Houghton","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_696166","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Ian Houghton\"> thank you for your explanation, yes backpacking wise a 66 litre rucksack is plenty but when I was looking at sizes of 20 litres it sounded so small (I also looked at my dry bag which is 25 lts. Thank you.</span></div>","author":"Chris Innes","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_190002","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Think about a trailer, better handling bike, easier on the rims, easier to take upstairs at a hostel. I've done it both ways, this is where I landed</div>","author":"Dennis Peterson","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_907542","type":"fbcomment","data":{"text":"<div class=\"comment_text\">But if you buy panniers, go big, buy the lightest gear you can stand comfort-wise to go in them.</div>","author":"Dennis Peterson","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_91477","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I am a you tube fan.  I watch a lot  of gear reviews and try to see how they use the gear to see if it fits my needs.  I also go through previous post here to see what others post.  So many ways to research gear.</div>","author":"Jeanette Osgood","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_183983","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jeanette Osgood\"> I did a search in this forum and found plenty of recommendations for brands but no guide on size?</span></div>","author":"Chris Innes","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_200592","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Chris Innes\"> I understand.  That is kinda why I like YouTube.  They don’t answer the question but I can see what they are using how they are packing and for find out what will work for me.  Everyone is going to give you the best answer they can but it comes down to what you are going to be doing.  There is a guy doing a cross country for the second time that has a nice set up Flynscout rider.  And there are plenty of others.</span></div>","author":"Jeanette Osgood","gender":"FEMALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_768302","type":"fbcomment","data":{"text":"<div class=\"comment_text\">The most obvious answer would be: get the biggest panniers you can get. It's better to have packed all the gear and still have room left versus having no room left and still gear to pack.\n\nBut, getting the biggest panniers requires a significant trade: discipline. I see a lot of people stuffing those last free spaces just so the pannier is full. That's ridiculous of course. I always recommend beginners to stuff their panniers with every useful, less useful, and useless item they can find. Then set off on a 1-day tour (better, an overnighter), add in some decent climbs and descents.\n\nWhen they come back, they already have a rough idea of which items are labeled \"useless\" and which ones are \"less useful\" and \"useful\".  Of the \"less useful\" one has to decide if it is worth the effort of bringing along or not.</div>","author":"Axel Knobbe","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_274446","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Axel Knobbe\"> good answer. Take a shake down ride, stay close to home, just to find out. Take a few experimental rides.</span></div>","author":"Robert Gransbury","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_542425","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I'm a recent convert to bike packing. I've done a bit of backpacking though and bought myself a 65 litre backpack for the Camino de Santiago. For the Pennine Way I swopped for a 55 litre despite the fact that I now had to include a tent, food and cooking gear. I'm setting off on the Pennine Cycleway with my bike loaded with two largish panniers and a rackpack. This is a tester for my planned ride from Leicester to Torrevieja.</div>","author":"Gareth Griffith","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_504558","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Liters, especially tequila or similar, will do that to your head. ;-)</div>","author":"Ignacio Duran","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_969382","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Actually tent, sleeping bag, mat, don't belong (in my experience) in the \"bags\" (side, saddle, etc.) but are more naturally set on top the rear rack perpendicularly, in a big bag, something waterproof, or just like that.</div>","author":"Ignacio Duran","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_861215","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Ignacio Duran\"> Exactly! A wet tent in a pannier with a sleeping bag will result in a wet sleeping bag (as well as wet everything else in the pannier)</span></div>","author":"Stuart Black","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_114735","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Ignacio Duran\"> Make sure that the sleeping bag is in a drybag. Also spare clothing.</span></div>","author":"Christine Roche","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_106409","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Where are you going and for how long you will only need 2/3 of stuff you think you need lay it all out on the floor then you will have a rough idea what size bags you will want to take with you on your trip</div>","author":"Peter Tomlin","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_609136","type":"fbcomment","data":{"text":"<div class=\"comment_text\">As I ride a recumbent and there are few choices for a decent sized pannier , I made my own . I based the size on existing camping equipment, not on what is available on the market now. My 2\"thermorest pad is 5.5 \" in diameter by 22\" long and it fits the  inside bottom of my pannier. If I wanted to spend 300+ bucks I could get a new Thermorest that is better insulating , smaller compact roll ,that takes up half the room. Everything I take is inside my panniers and protected from rain without an optional cover. As someone pointed out the last thing you want is a wet tent next to your sleeping bag . Simple cure is a drybag for your tent. \nSo for the person who wants to know how much fits where, you need to take what you think you need to the store and stuff it into the display pannier to get a sense of carrying capacity. Bigger is better as you do not have to carry as much as it holds and later on , after your tour ,you may just need that room for a grocery run instead of using the car to get to and from the store.</div>","author":"Bob Loblawb","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_366839","type":"fbcomment","data":{"text":"<div class=\"comment_text\">For backpack hiking if your kit is more than 10,5% body weight you need to loose some stuff.\n15 kg will be a bit more than 15 litres. More than that you probably going to be dangerous and uncomfortable.\nI sand under correction, some people manage to pack a lot, I just don't see how they can cycle safely and comfortably.</div>","author":"Brian Alexander Langton","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_744679","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I wouldn't put the tent in a pannier. Sit it on the rack.</div>","author":"Huw Thomas","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_634610","type":"fbcomment","data":{"text":"<div class=\"comment_text\">You can never have too much storage space - only too much weight or bulk, or too unbalanced.</div>","author":"Mike Dannheim","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_635503","type":"fbcomment","data":{"text":"<div class=\"comment_text\">As you can see nobody gave you a straight answer. So here it is. First remember that 1 L  is equal to 61 cu inches. For example that would be 4inches x 4inches x 4inches of volume. So 1L is quite small volume. The best long distance touring panniers should be waterproof, preferably with compartments so you do not have to dig all over the place to find what you need and minimum of 35L on each side of your rear rack. You can do with 2 30L rear rack panniers and a small 20L-25L duffle bag. One pannier is for cycling clothes and misc cycling stuff. The second pannier is for street clothes, personal stuff etc. The duffel bag on top would be for electronics, cameras, cords, iPhone, iPad, laptop, a book or map and such small but readily accessible things you may need. That will do just fine if you do not plan to do camping out and cooking out. If you are a camping out and cooking out rider you will need some front panniers as well. Not allowed to spell out manufacturer names but I am sure with some basic research you will find what you need. Hope this helps.</div>","author":"Lou Roussinos","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_444450","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Agree with comments about having too big a bag is better ! Especially on a tour . You'll need a bit of space to fit your food you buy !  I'm doing a three week tour . Sections will be wild camping so having to carry food for a couple of days ! So space in bags will be needed ! 👍🏴󠁧󠁢󠁳󠁣󠁴󠁿🚴🏻‍♀️</div>","author":"Peter Couttie","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_308743","type":"fbcomment","data":{"text":"<div class=\"comment_text\">If you have backpacked  you will be familiar with rucksack capacity in litres.  Even so backpackers use rucksacks of differing capacity. It also depends on the packed volume of a sleeping bag, which can vary a lot according to season and whether downfilled  or not, and size of stove etc.</div>","author":"Christine Roche","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}