{"time":1655471242567,"version":"2.23.2","blocks":[{"id":"id_833805","type":"header","data":{"text":"The Value of Protein Powder when Bikepacking / Bicycle Touring","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_583158","type":"paragraph","data":{"text":"<i>Question about nutrition. I see so many recipes that include protein powder as a supplement. Considering one can only eat so much peanut butter and nuts, does the powder really make that big of a difference. Never been a supplement guy, but have bonked hard on lack of quality nutrition is it worth the investment? TIA</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_415303","type":"delimiter","data":{}},{"id":"id_835825","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Prefer real food, sandwiches, beef jerky etc.</div>","author":"Lee Hollenbeck","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_538771","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Lee Hollenbeck\"> me too, but that’s another question for another day. Lol</span></div>","author":"Chris Larner","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_390558","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Get all essential amino acids from a variety of plants, not even just nuts and seeds. Broccoli is packed with protein. Though I like a raw vegan  'meal replacement' shake that helps me make sure I get some balanced base nutrition.</div>","author":"Andy Decker","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_984113","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Ive been using the raw meal replacement for like twelve years. Love their products</div>","author":"James Madden","gender":"NEUTER","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_381738","type":"fbcomment","data":{"text":"<div class=\"comment_text\">So a lot of studies have been done on this (trail nutrition), particularly in the context of thru hikers. Think 5-6 months on trail in one shot. One in particular stood out. The question was whether a crap diet or a super healthy diet would change the outcome of a group of I believe 20 Appalachian Trail thru hikers in terms of changes to their physical health and fitness at the end. The answer, surprisingly was no, with a slight edge actually going to the unhealthy diet. Basically, the conclusion they came to was that the quantity of calories was far more important than the quality of calorie. When you’re burning 5K-8K calories a day (typical day on the AT hiking 20+ miles) it’s almost impossible to match with your intake no matter what. Sure, you may FEEL better if you’re eating well and not just pounding snickers into your face, but your health itself won’t be any different because at the end of the day, you’re still most likely burning thousands more calories than you’re taking in regardless of the source. Far more important is how you eat off trail in your normal day to day life. Now, all that said, protein and fat is important for two purposes: protein will help you recover and is the most satiating of the macronutrients, and fat will give you a more slow burning consistent source of energy than carbohydrates. Carbs have their place though. When I’m on extended legs on trail, I basically focus on fats and carbs throughout the day, usually in the form of nutty trail mix and chocolate. Then I finish the day with a meal high in protein and fat. Mostly though I’m just trying to get as many calories in me as possible. But that’s not really out of a sense of wanting to eat well for my nutrition so much as the way it makes me feel. \n\nTL;DR eat whatever you want on trail it pretty much doesn’t matter and won’t effect your health in a meaningful way.</div>","author":"Justin Ammerman","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_250398","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Justin Ammerman\"> this is how I always felt about long distance riding. I just want the calories.</span></div>","author":"Drew Van Patter","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_492619","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Justin Ammerman\"> it seems I vaguely remember seeing something like this and I ask this question because although quantity of calories is important it seems junk calories can be an issue as well. I have bonked several times and although some of it maybe from dehydration it many times has come back to food as well. I do eat lighter on the trails which I know is a big no no, so was wondering if going with a protein powder is worth it. (Sorry, trying to keep details short)</span></div>","author":"Chris Larner","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_632175","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Theres an enduro athlete here in the Boulder are that rode to and summited every 14er here in Colorado in 30 days. Didit fueld on snickers and microwave burritos. He was gonna run at a calorie loss every day so he just tried to get as much as he could.</div>","author":"James Madden","gender":"NEUTER","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_943179","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Justin Ammerman\"> great info. Thank u you!</span></div>","author":"John Edward O'Malley","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_354565","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Chris\"> There's a few options for what might be happening when you hit the wall, but one of the more likely nutrition related ones is that you've run out of muscle glycogen. You can try to avoid this in 2 ways - go easier, so muscle gylcogen isn't your primary energy source and/or ensure you're eating to maximise its replenishment (~200kcal/hr of low fat mostly complex carbs - every hour, don't miss any).\n\nWhen I start a tour or do a short weekend trip, I start out eating a mini malt loaf every 30mins. After a few days my body doesn't need that level of strictness in refueling anymore and I swap to stopping to eat when I'm hungry but it definitely helps whilst it's re-adapting.\n\nProtein is much less of an issue for ultra endurance activities. You want some but I wouldn't worry about supplementing. Fat is a much better way to get calories in, just be aware that it will slow down the digestion / absorbtion process and if you eat high fat food whilst riding you might not feel great! (Unless you've adapted to use fat as your primary energy source, which is a whole other topic...)</span></div>","author":"Helen Colson","gender":"NEUTER","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_403717","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Helen Colson\"> exactly this. Chris, on trail I’m basically consuming nothing but carbs and fat at a pretty steady pace all day. Keeps me level and energized. Then a big meal of higher protein content and fats. The biggest things I’m trying to do throughout the day is just get as many calories as possible. So super calorie dense foods are friends. Nuts and nut butter in particular, but also other fats for the most part. Since a gram of fat is worth 9 calories, while a gram of protein or carbohydrates is worth 4, you get over twice the bang for your buck carrying fatty foods rather than worrying about your protein intake. To be honest, the biggest problem I’ve had on trail nutrition wise is getting enough fiber, since I’m getting very few fresh veggies. If you want to bring any kind of supplement, a fiber supplement would be a much better use of pack space and weight than protein powder.</span></div>","author":"Justin Ammerman","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_999667","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"James Madden\"> calorie count &gt; everything\n\nFor real though, Snickers don’t get enough love. If you watch any kind of endurance sport at a competitive level, I guarantee you’ll see a disproportionate amount of athletes popping fun size Snickers or some other variant of candy bar all day. Mat Fraser (most successful CrossFit athlete in history) would pop two in between every event. He won the CrossFit Games five times in a row. Snickers are definitely a thing. Go on the AT and you’ll find them in almost every thru hikers pack.</span></div>","author":"Justin Ammerman","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_511256","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Read the same thing.\n« Good nutrition » is a long term thing. \n\nWhen your body is at war, like it kind of is during long multi day ride or whatever the sport, you need lots of carbs, and lots of calories. \nIf your body takes it, it’s what you need to eat!\nEating enough is the challenge.</div>","author":"Gabriel Sarrazin-Mackay","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_599287","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Justin Ammerman\"> Keep this quiet. You could put a lot of high $$ food supplement companies out of business!</span></div>","author":"Steve Dintaman","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_201749","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I like eating real food, &amp; I’ve found I do better on protein &amp; fat, with minimal carbs, so I dehydrate a lot of my meals, have nuts for snacks, &amp; dry salami &amp; cheese for lunch. I’ll occasionally do an omelette made with powdered eggs &amp; dehydrated vegies that I’ve soaked overnight, but that’s the closest I get to anything powdered.</div>","author":"Cheryl Leskiw","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_654025","type":"fbcomment","data":{"text":"<div class=\"comment_text\">From a weight perspective it’s nice but idk… I eat whatever I want when I’m bikepacking! I’m out to enjoy myself. I was out in the middle of Wisconsin last year and rolled up to a bratwurst fry behind a liquor store at like 11:00am on a Thursday. Definitely had to stop, these are the kind of experiences I’m after.</div>","author":"Quinn Erickson","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_655150","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Quinn Erickson\"> , don’t know what a bratwurst fry is but sounds like some good road calories. 😁</span></div>","author":"Lee Hollenbeck","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_783779","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Welcome to Wisconsin. Brats and Friday Fish Frys!</div>","author":"Chad Weberg","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_962470","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I think I don’t really care what the food is if I enjoy it, but when I’m packing I’m looking for really calorie dense (ie fatty) foods.  Gram for gram you get more calories from fat!</div>","author":"Scott Bakker","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_83608","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Bonking has more to do with carbs, sugar and ATP than protein.  I would research the appropriate amount of those that your body needs to prevent bonking.  But most of these answers you’re getting will depend on what you want to do on the bike?  XC race, endurance, or bikepacking or whatever else.  Each of these types  of events requires a different nutrition strategy to be successful..</div>","author":"Jeff Glessing","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_216820","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Aminos are basic building blocks of protien. So if your using it when you need it it's absorbed in a cleaner cross over. I might be supplemental to have myself protien if I feel I have aches after a shorter day and need to improve the menu. The mt. House meals are designed to have the full protien serving to sustain you. Eating cheese or counting up total protein throughout the day is more of a goal. I like to choose snacks that all contain some protein. If experience is cramps or dehydration you'd eat nutrients for those like apples or some salty stuff. Eating protein I think improves rest.</div>","author":"Aaron Wissler","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_444279","type":"fbcomment","data":{"text":"<div class=\"comment_text\">There's a lot of hype about protein and a lot of money in this type of product IMO</div>","author":"Alan Cole","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_720756","type":"fbcomment","data":{"text":"<div class=\"comment_text\">protein is just one of the macronutrients.  high quality and easy to digest carbs cannot be neglected, and fats rich in medium chain triglycerides have more than double the energetic density of the other two.  all combined with enough fiber to keep it moving, and enough salt to sweat out during the day.  i swear by coconut oil, and always have a jar while traveling, but beef bone marrow lard is even better</div>","author":"Brent Joly","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_128403","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Just snap into a slim Jim.</div>","author":"Erik Jansen","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_339040","type":"fbcomment","data":{"text":"<div class=\"comment_text\">It’s important to eat protein just before or just after exercise if you want to build muscles. \nProtein powder itself doesn’t matter, but there’s a variety of reasons to use it - like you’re not hungry after or before exercise, or your meal doesn’t have many calories.\n\nIf you don’t like supplements, don’t do it. You can absolutely get all the macronutrients from food.\n\nAnd if you choose to do it, be aware that there are plenty of KINDS of powders (and the most popular WHEY might not be for you - if you’re lactose insensitive, like many people are)</div>","author":"Kay Anky JS","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_363524","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Low protein = low/poor recovery and more prone to hunger</div>","author":"Jason Anthony","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_600348","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Your body can’t absorb more than 30g or so of protein per meal anyway. Just eat healthy food and you’ll be fine. Anything heavily processed such as protein powders is to be avoided.</div>","author":"Tom Peacey","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_828360","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tom Peacey\"> That's not quite right, muscle protein synthesis is maximized to around 20-30g depending on protein source, this is in reference to the amount that can be utilized for lean tissue-building purposes in a single meal and anything above this amount is believed to be oxidized for energy or transaminated to form urea in our case the body would burn it off. The amount of carbs we eat would have a protein sparing effect, anyway it's carbs i would be looking at to refuel not protein especially in the case of a 'bonk'.</span></div>","author":"Carlos Asenvader","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_260504","type":"fbcomment","data":{"text":"<div class=\"comment_text\">What’s your hourly carb intake like? You should be aiming for 90-120g per hour for optimum performance, with a 2:1 glucose:fructose ratio, that will definitely help with avoiding the dreaded bonk.</div>","author":"Jon MacKinnon","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_554487","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I put a spoonful of vanilla flavored powder in my oatmeal each morning. It helps me. Everyone’s body reacts differently to different thing. Don’t be afraid to experiment a little in your training before hitting a trail</div>","author":"Jason Durham","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_941115","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Bonking on a ride is more about not getting enough energy from your food, not too little protein.</div>","author":"Jeremy Lawrence","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_562574","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Carnation Breakfast Essentials in my oatmeal works for me.</div>","author":"Bobbie Gullickson","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_567334","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I'm a real food eater. You just need to find what protein/fat/carb combo works for you.</div>","author":"Brandi Jackson Hodges","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_370631","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I prefer real food, but I had change a few years ago to very low carb and so no bonk problem. When I hit camp I usually eat I cook. No more problems with energy.</div>","author":"Olie Grønn","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_273832","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Like many have said, increasing protein won't prevent bonking.  I used to borderline bonk often, here's what works for me, I think it's the same for the majority but it may differ for others... Eat small bits (I don't want a gut bomb mid ride), eat often with a focus on replenishing carbs (I usually go for high carb bars), at least 1 bottle with electrolytes (IE: Nuun), bring some gel packs just in case, a chocolate bar for a treat (attitude upper for me).  End of the day, I fatten up the machine and eat whatever I want &amp; fuel up for the next day! \n\n Supplements, I like Hammer Nutrition's, they work for me and my gut.  \n\n GCN has some good diet tips for big rides/trips, <a href=\"http://Bikepacking.com/\" target=\"_blank\" rel=\"nofollow\">Bikepacking.com</a>, IE;\n<a href=\"https://bikepacking.com/plan/do-it-yourself-rocket-fuel-for-bikepacking/\" target=\"_blank\" rel=\"nofollow\">https://bikepacking.com/plan/do-it-yourself-rocket-fuel-for-bikepacking/</a></div><div class=\"comment_attachment\"><div class=\"link-tool\"><a class=\"link-tool__content link-tool__content--rendered\" target=\"_blank\" rel=\"nofollow\" href=\"https://l.facebook.com/l.php?u=http%3A%2F%2Fbikepacking.com%2F&amp;h=AT3bsPU-odCTIrSw8Sk_Zm2dxfwJnd82gjZtoPt_X3_xALv02hWkAgn3q-sxoTy51PPUp0zXLDo27bnz8wF46N9TOFUqEayTFWdpAkNsMRgigk-XXsNdcwarHrFOV1ovy1VrtCLykIYOXes&amp;s=1\"><div class=\"link-tool__image\"><img loading=\"lazy\" src=\"https://bikepacking.com/wp-content/uploads/2013/06/bikepacking-FB-ad.jpg\" alt=\"\"></div><div class=\"link-tool__title\">BIKEPACKING.com - Bikepacking Routes, Gear, Inspiration</div><span class=\"link-tool__anchor truncate\">bikepacking.com</span></a></div></div>","author":"Darcy Therien","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_749684","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><a href=\"https://www.youtube.com/watch?v=cuIxMWgZbc0&amp;list=PLrKJ0zeMQrI61wqXR8MUBXBHPk5Rli1yH&amp;index=9&amp;t=14s\" target=\"_blank\" rel=\"nofollow\">https://www.youtube.com/watch?v=cuIxMWgZbc0&amp;list=PLrKJ0zeMQrI61wqXR8MUBXBHPk5Rli1yH&amp;index=9&amp;t=14s</a></div><div class=\"comment_attachment\"><div class=\"link-tool\"><a class=\"link-tool__content link-tool__content--rendered\" target=\"_blank\" rel=\"nofollow\" href=\"https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DcuIxMWgZbc0%26list%3DPLrKJ0zeMQrI61wqXR8MUBXBHPk5Rli1yH%26index%3D9%26t%3D14s&amp;h=AT1TO_pdEp1qmQloMHZn2NEYHGBKsIZBQU5ymQf_u6acM9PqiA-j8EmWiylvHsfI3QodBMizHc8bF2AIRRE10Q6e4Fic62j47lqamAD5S6USzEb97qnYZ70KJBEdG0Y3k29OYlMMQ6-U-io&amp;s=1\"><div class=\"link-tool__image\"><img loading=\"lazy\" src=\"https://i.ytimg.com/vi/cuIxMWgZbc0/maxresdefault.jpg\" alt=\"\"></div><div class=\"link-tool__title\">Protein for Cyclists, VO2Max, Training Stress and More – Ask a Cycling Coach 349</div><span class=\"link-tool__anchor truncate\">youtube.com</span></a></div></div>","author":"April Drage","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_574450","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I believe there is a similar amount of protein in milk as there is in 'recovery powder'. I only use a recovery powder when I can't or don't want to eat any real protein, so after a race for instance or after training when I don't want to spoil my dinner.\nAlso they all contain maltodextrin which is linked to certain health issues <a href=\"https://www.mdvip.com/about-mdvip/blog/read-your-food-labels-watch-out-maltodextrin\" target=\"_blank\" rel=\"nofollow\">https://www.mdvip.com/about-mdvip/blog/read-your-food-labels-watch-out-maltodextrin</a></div><div class=\"comment_attachment\"><div class=\"link-tool\"><a class=\"link-tool__content link-tool__content--rendered\" target=\"_blank\" rel=\"nofollow\" href=\"https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.mdvip.com%2Fabout-mdvip%2Fblog%2Fread-your-food-labels-watch-out-maltodextrin&amp;h=AT1C-yysXPI4IcWE_1B3tEE3csiO4npq_tp4hMsGM_0wnjrzAYgArBgXBYn56rs1PjW1Ck1sCyKxSznbr3u7aklwnYa2UxxcD7zSkO2IKuM7SVYsJmlbJSUeY9bNDDbsTPDgBZIG_YNee7o&amp;s=1\"><div class=\"link-tool__image\"><img loading=\"lazy\" src=\"https://www.mdvip.com/sites/default/files/blog/check-your-food-labels-for-maltodextrin.jpg\" alt=\"\"></div><div class=\"link-tool__title\">Is Maltodextrin Safe? – Possible Side Effects of Maltodextrin – Living Well - MDVIP</div><span class=\"link-tool__anchor truncate\">mdvip.com</span></a></div></div>","author":"Steve Tucker","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}