{"time":1658558463043,"version":"2.23.2","blocks":[{"id":"id_729606","type":"header","data":{"text":"ÖNCEKİ POSTA EK:Do You Worry about the Weight of Your Bike Touring Equipment?","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_188790","type":"paragraph","data":{"text":"<i>How much do you guys worry about the weight of your equipment￼￼￼? Say If you were choosing between two pieces of equipment. One of them is one pound and the other is a pound and a half. ￼￼￼￼ If the lighter piece of equipment￼ was twice as expensive, but the only difference was weight. Would you choose to pay twice as much￼ for the lighter piece of equipment? Or would you ride with the extra half pound?￼ For my backpacking equipment.  I almost always go for the lighter equipment￼. ￼ This would be for a bicycle touring not bike packing￼.</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_918316","type":"delimiter","data":{}},{"id":"id_835647","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Depends on my cash flow versus total cost.  A difference between $10 and $20 on my budget is negligible.  A difference between $1000 and $2000 is pretty significant.</div>","author":"John Almond","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_862354","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I’d ride with the extra half pound.</div>","author":"Janie Arndt","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_213123","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I don't worry about weight, but I do worry about room. How much space do I have? On a six week bike trip in France, Belgium and Netherlands, I carried only a D100, 12-24 and a 28-200. That's all I had room for in a handlebar bag. \nFor most of my trips, I carry two pro bodies and 4 lenses including a 200-400, 80-200, 28-70 and 17-35 in a rolling Thinktank bag.</div>","author":"Chris Daigle","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_603022","type":"fbcomment","data":{"text":"<div class=\"comment_text\">That’s the $1,000 dollar question everyone deals with. Good luck</div>","author":"Jeff Stone","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_641531","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I wouldn’t worry about the half pound. Think about how much water weighs and then think about the fluctuations in water in your body throughout the day. Having to pee will easily cancel out whatever weight you might save.</div>","author":"Heather Mroz","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_375694","type":"fbcomment","data":{"text":"<div class=\"comment_text\">If you already have something then use it. I’m a bit of a tech/weight weenie and have generally purchased lighter more expensive in the past. But nowadays there’s a bit more analysis that goes on while putting my kit together \nMore expensive doesn’t necessarily mean it’s better. \nLighter materials aren’t as durable   \nthere are cost effective ways to get lighter starting with yourself. \n. \nDo a cost analysis of weight/dollar and see if it  makes sense for your budget. 1/2 lb isn’t much….(glass of water).</div>","author":"Jordan Schoonmaker","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_855027","type":"fbcomment","data":{"text":"<div class=\"comment_text\">A lot depends on how you tour!\nLong hard days go with light\nJust say 40 to 60 miles a day and not a lot of these /\\’s go less lite</div>","author":"Charles Nighbor","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_810159","type":"fbcomment","data":{"text":"<div class=\"comment_text\">The other solution is lose 10 pounds</div>","author":"Charles Nighbor","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_877682","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Ounces in the morning are pounds at night. I give it a serious consideration but isn't make or breaks</div>","author":"Nick Gallo","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_706525","type":"fbcomment","data":{"text":"<div class=\"comment_text\">All of us worry about weight and space to some degree.  It is just a matter of the level of priority.  My first critieria is, does the item serve the purose well.  The best quality eqipment I can find for the task is always my choice.  Do however take into consideration how much you will use the equipment when decieding on the purchase.  If you are only going on a 2 week tour once a year, most likely a lower quality choice will work well.  Eurieka tents come to mind, as an example.  If you plan on a round the world tour compromising on quality for price might not be a good decision.  \n\nOver many years of touring I have found that a one season tour load normally comes in at about 30 to 35 pounds if camping. That is not including food and water.  A 4 season tour will be 60 to 70 pounds.  These weights include the panniers, handlebar bag and various other dry bags.  \n\nLast note.  Think long and hard about balancing your load front and rear.  Remember that most your weight and that of the bike are already on the rear wheel before you add gear.  Your bike will handle and ride better if the weight is more equally distributed.</div>","author":"Bill Heimann","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_295385","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I'm interested in quality as well as weight then comes value. You don't always get what you paid for but quality often adds greatly to reliability.</div>","author":"Bill Dove","gender":"UNKNOWN","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_883204","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Go light if it makes sense. I still bring a freestanding tent, pillow, and a chair though. Comfort first, then weight and performance,  price is last for me.\n If you give in on weight here and there, before you know it your bike is weighing 70, 80, or even 100 pounds. My bike weighs around 50 pounds fully loaded with food and water in the summer. In the winter it's probably 10 pounds more. The difference between a 100 pound bike and a 50 pound bike is a huge investment AND a huge benefit.</div>","author":"David Baker-Yuill","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_787429","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I use what I have, but if something comes up at a bargain price, or second hand, I will upgrade. The other thing to consider, for me, is that I have bought stuff that I no longer use or did not get as much use out of it as I though I would. Buying top price gear would limit my future purchasing options. \n\nI am a firm believer of buying what is easily affordable, and if I find I get a lot of use out of something, when it wears out I upgrade it. I do not believe in the addage, 'Buy the best and cry once'. For example, for the price of a new Hilleberg tent I could buy a tent, down sleeping bag, good sleep mat, pillow, a set of panniers, and maybe even a second hand touring bike.</div>","author":"Mark Perry","gender":"UNKNOWN","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_42967","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I'd go heavier if it's less bulky. If not I'd go the lighter route; I ride big nasty dirt roads and tracks with a good amount of pushing. Lighter absolutely helps the bottom line.</div>","author":"Derek Poshtar","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_137257","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Perhaps a picture...\n...I did change both tires and had extra water as I was about to find some woods to camp in...</div><div class=\"comment_attachment\"><div class=\"comment_photo_attachment\"><img class=\"comment_photo_image\" loading=\"lazy\" src=\"/images/community/this-is-for-another-post-addition/image_1658558462_9247964482.jpg\" alt=\"\"></div></div>","author":"Whit Elfner","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_278802","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Depends on the weiht savings, durability.  Nothing is perfect.  Not worth it for a significant price increase IMO.</div>","author":"Pamela Murray","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_565993","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I stay in hotels and can be on the road for 6 weeks. I carry 18 pounds and wish it was 17.</div>","author":"Robin Verner","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_560468","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Man, I will always go for the light gear to save a few grams. It would be far cheaper to buy the cheaper, less expensive equipment and lose a bit of weight myself. Actual, I could save thousands!😂😂</div>","author":"Garry James","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_448022","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I guess it depends on the price.  Going from $1 to $2 to save a half pound is worth it.  Going from $1000 to $2000, not so much.</div>","author":"Sean Quinn","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_303520","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I'm a budget guy.  My clothing and gear is lite, is REI quality, and always bought on sale except my 2 man tent, oversized air mattress, and hybrid sleeping bag they're heavy but good quality.  I like my sleeping comfort.</div>","author":"Tony Rice","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_296092","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I never cared about the weight of my equipment, but plenty of uninformed strangers seem too. I've had plenty of comments when I've got all my gear packed on my folding bike. When I have literally the same gear packed on a normal sized bike, no one says a word. It's interesting to live in a world surrounded by 8 billion 'experts'. 😂</div>","author":"Tristan Natsirt","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_515274","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tristan Natsirt\"> people do love to comment on how heavy one’s load is! I’m the one getting it up a hill so who cares? 😜😂🚴‍♀️</span></div>","author":"Adrienne Albright Lehtinen","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_76302","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Everyone is different.  \n\nFor us, we find the optimum load to be about 30kg each.  That's 45kg incl bikes and is light enough to tour with but also enough kit to be comfortable.\n\nWe make a living from film-making so camera kit is always a significant part of that load.</div>","author":"Mark Litherland","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_521264","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Tristan Natsirt\"> I stopped reading at “folding bike” 🤣</span></div>","author":"Norman White","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_405892","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Norman White\">  I got a full-sized bike a few years ago. It was the first time I'd ridden a full -sized bike since I got into touring. Suddenly I was a lot less impressed with people doing 100km rides day in and day out. It's so easy it's practically cheating on a full-sized bike. ;P \n\nI've done enough touring on that little folder to circle the moon. People have crossed continents with them. They're definitely more challenging, but if challenge was a concern I would take a car.  \n\nI've done several international tours with the folding bike where they're simply wasn't an option to bring back a full-sized bike to the starting point without paying hundreds of dollars in shipping fees. A folding bike can disappear into a bag rather quickly and just become 'normal' luggage. You can also bring them into accommodation more easily, and if you ever have a breakdown you can fit them in practically any motor vehicle if need be. No need to hide the bike in the bushes, hitchhike into town, and hitchhike back out with your replacement part, praying that the bike is still there.\n\nPlus, never forget the freak factor: I look like a trained circus bear riding that thing. I meet a lot more people when I'm touring with a folding bike. The touring cyclist is not that unusual in a lot of places. But some weirdo on the circus bike? A lot more invites for accommodation, food and conversation.</span></div>","author":"Tristan Natsirt","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_978730","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Adrienne Albright Lehtinen\"> someone walked up to me the other day and said \"too much gear\". It was funny and he was nice..but I can't help but mention he then told me about a tour that he failed at / left early due to weather / poor planning . Maybe he needed more gear 🙂</span></div>","author":"Lindsey Hamma","gender":"FEMALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_60252","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I tend to go for whatever is most compact if I have choices. However, as my gear also doubles for back packing as well, plus looking at weight for flights, I also  take that into consideration. Over the years, as finances enabled it, I have replaced original items with the more expensive, but lighter more compact items.</div>","author":"Biff Frederikson","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_182142","type":"fbcomment","data":{"text":"<div class=\"comment_text\">i also go for the light products - so i can add more stuff 🥴</div>","author":"Gabi Kundert","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_699509","type":"fbcomment","data":{"text":"<div class=\"comment_text\">If you ride hilly routes, it’s worth paying for lower weight IF quality is at least equal. Don’t compromise comfort or safety for weight.</div>","author":"Steve Coombs","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_234549","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I would choose the heavier one probably. But depends also on how many of these choices you have to make. I look at packed size first</div>","author":"Martien Deijsselberg","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_428619","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Respectfully, Tales from the cheap……</div>","author":"Norman White","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_925930","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Whats the difference between bikepacking and bike touring these days? They're basically the same thing sharing a lot of the same accessories and no difference in the bikes themselves either...or did you mean to say backpacking at the end?\n\nPersonally, I believe the piece of equipment in question matters. So if you're deciding between a 1p UL tent from BA vs a 2p UL tent from NatureHike... I just believe it depends on what your objectives are for the trip....how long the trip is and what elements you may face along the way. If I was caught in a 12hr rainstorm, I may want to ensure I am able to stay warm and dry over save 1/2lb of weight...or be comfortable in the tent for that length of time.\n\nIn my opinion, while bikepacking/touring...weight matters less than having the right equipment and a reliable bike with the appropriate gearing.</div>","author":"Josh Kebschull","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_747025","type":"fbcomment","data":{"text":"<div class=\"comment_text\">50% chance I’d take the lighter version… depending on the other gear choices of course.</div>","author":"William Griggs","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_723488","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Even when bikepacking with my motor-assisted strider bike, I am concerned about gear weight and bulk.</div><div class=\"comment_attachment\"><div class=\"comment_photo_attachment\"><img class=\"comment_photo_image\" loading=\"lazy\" src=\"/images/community/this-is-for-another-post-addition/image_1658558462_8241798625.jpg\" alt=\"\"></div></div>","author":"William Griggs","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_920836","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Quality and durability first irrespective of the weight</div>","author":"Vinay Kumar","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_927103","type":"fbcomment","data":{"text":"<div class=\"comment_text\">If you're racing, ultra, timed distance ect, go for lightweight. If you're touring and have a loose schedule use what you have.</div>","author":"Lee Veinotte","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_44359","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Really depends how much money you're comfortable spending. I was joking around with a friend yesterday because he bought an Absolute Black topcap that saved him about 20 grams, at a weight saving of a dollar per gram.\n\nFor me lower weight = a more enjoyable ride, which means I'm motivated to spend more time riding bikes, which is good for my mental and physical health. I dropped almost 900 recently on a pair of carbon wheels and I am VERY happy with that purchase but I'm sure some people would call me crazy.</div>","author":"Ben Grad","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_465202","type":"fbcomment","data":{"text":"<div class=\"comment_text\">It's the hills that will force you to make these calls all on your own. Most newbies want to bring everything but the kitchen sink with them when they first begin, then they gradually start mailing things back home to lighten the load.</div>","author":"Bob Breeze","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_551409","type":"fbcomment","data":{"text":"<div class=\"comment_text\">If you have to think about the money the extra half pound is fine.  I'd be willing to bet most of us are within 5-8 pounds and if your gearing is good that's not a huge difference for most touring and half pound is nothing.</div>","author":"Daniel Ellsworth","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_565773","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Depends on how much extra it is. Double £1 is totally worth it. Double £500 is not (to me).</div>","author":"Helen Colson","gender":"NEUTER","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_238364","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Depends on expected use.  If you plan to tour only occasionally, one might be concerned about price.  If you expect to be on the bike hundreds or thousands of hours, the cost is insignificant.</div>","author":"Jack Kessler","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_395391","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Take what you want and if you don’t use it send it home</div>","author":"Karl Clark","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_944683","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I never ‘worry’ about weight.\nDepends what I’m buying as to which of these four I’m prepared to compromise on   weight-size-price-quality</div>","author":"Andy Haywood","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_835465","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I’m somewhat particular about where I care about weight. I tend to go as light as possible with gear because I drink a ton of water and carry 3-4liters on a cold day. Also my bike is about 25lbs thanks to being steel and having a Pinion gearbox, so I try to balance that by going with lighter gear. I ride off road a lot and encounter 15+% grade climbs, so I don’t want to be completely loaded down. If I were only touring on road it probably wouldn’t matter so much since road riding tends to be easier. Since I don’t have 2 sets of kit depending on terrain, I will spend more for lighter gear if I can afford it.</div>","author":"Megan Rose","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_992512","type":"fbcomment","data":{"text":"<div class=\"comment_text\">As a backpacker, I learned 3 things about buying gear: quality is key, weight is very important, and the difference between want and need. The gear and the philosophy have carried over to bikepacking and touring.</div>","author":"Cher Barron","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_963140","type":"fbcomment","data":{"text":"<div class=\"comment_text\">It depends on what it is. I average about 70lbs for my full load out. I would pay twice as much for a lighter and smaller sleeping bag for example but then I add in my wooden plates and metal tongs. There's a rhyme to my reasoning.. sorta. Sometimes it's space over weight.\n\nHere's an example of what I pack.</div><div class=\"comment_attachment\"><div class=\"comment_photo_attachment\"><img class=\"comment_photo_image\" loading=\"lazy\" src=\"/images/community/this-is-for-another-post-addition/image_1658558462_7248758709.jpg\" alt=\"\"></div></div>","author":"Lindsey Hamma","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_120736","type":"fbcomment","data":{"text":"<div class=\"comment_text\">It’s not something you’ll ever take backpacking?</div>","author":"Michael Basil","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_158937","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I think what made the biggest difference for us is being more selective in the quantity of stuff we brought. Bring less. You can add things if you need to.</div>","author":"Steve Desrosier","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_964250","type":"fbcomment","data":{"text":"<div class=\"comment_text\">The weight of each piece of equipment is part of the total weight.￼. If you choose the piece of equipment that weighs an extra half pound,  then you need to subtract something else on down the line.￼</div>","author":"Joyce Riecker","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_512789","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Lots of sensible answers above.  I just thought I would add that weight matters but proportionally to your own weight.  If you are above 80kg it's not going to matter as much as if you are below 60kg.</div>","author":"Peter Hardie","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}