{"time":1659022590213,"version":"2.23.2","blocks":[{"id":"id_959012","type":"header","data":{"text":"What to Look for When Buying a Solar Charger for Bikepacking?","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_254967","type":"paragraph","data":{"text":"<i>Can someone explain to me what to look for when buying a solar charger for bike packing. I just want to take some week-long trips and charge my phone for taking pictures. I'm overwhelmed when I look online because I don't know what I'm looking for. Should I be looking for a larger mAh number? 5V? Specific, but not ultra expensive, brands? Thanks.</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_121216","type":"delimiter","data":{}},{"id":"id_927937","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I'd first look at your route. If it entails lots of directly overhead sun exposure, then a solar charger is not a bad idea. If there's likely to be cloud cover or low sun, lots of interrupting tree tunnels or building coverage, or just not many hours outside to get that exposure, prolly better to use a battery pack of sorts.</div>","author":"Aaron Crawford","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_481613","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Aaron Crawford\"> battery packs best option \nSolar panels to be effective need to be big</span></div>","author":"Charles Nighbor","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_292177","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Charles Nighbor\"> No they don’t. The Goal Zero Nomad 7 is small and extremely effective.</span></div>","author":"Ty Dawley","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_790593","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Ty Dawley\"> great</span></div>","author":"Charles Nighbor","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_864559","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Aaron Crawford\"> Thank you</span></div>","author":"Kristi Kucera","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_843385","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Charles Nighbor\"> Smaller just means less power, i.e. they charge slower. You could argue that some (slow) charging is better than none.</span></div>","author":"Leif Warner","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_665260","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Agreed. Unless you're going to be directly under unobstructed high noon sun for extended periods (doesn't sound fun for riding in), it doesn't really seem worth it. Unless you're going \"off the grid\" for greater than a week at a time, I imagine you'll be stopping at places to resupply or at least wash up, and you can charge your cache battery packs then.</div>","author":"Leif Warner","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_363334","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Voltaic Solar is very helpful in deciding what you may need.</div>","author":"Lukey Nuthmann","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_85603","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Lukey Nuthmann\"> Thank you</span></div>","author":"Kristi Kucera","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_361171","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I would always take powerpacks. I have a Anker 24W solar charger, basically 3 x A4 sheets of paper size, which works very well in full sunshine, ok on bright days, and not at all the rest of the time, so I charge the powerpack(s) by solar when possible, my dynamo hub, or at cafe stops, and always have enough power.</div>","author":"Phil Metcalfe","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_937898","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><a href=\"https://voltaicsystems.com/backpacking-solar-chargers/\" target=\"_blank\" rel=\"nofollow\">https://voltaicsystems.com/backpacking-solar-chargers/</a>. The primary battery is critical.  Standard powerbanks &amp; devices can be charged by passthrough from the primary battery</div><div class=\"comment_attachment\"><div class=\"link-tool\"><a class=\"link-tool__content link-tool__content--rendered\" target=\"_blank\" rel=\"nofollow\" href=\"https://l.facebook.com/l.php?u=https%3A%2F%2Fvoltaicsystems.com%2Fbackpacking-solar-chargers%2F&amp;h=AT3i3725BDVa2S3tbc9Cmb0ObXGM8Pc9DbJT4YlkIB-c4e3ThPEH356FUB7N8oDdnPkYITVCLLBIt_ZkxEaX40f8tcTPE9a8zZbvkVfVg-tQiJf-SQWeTfvYTCm2Sz_2S5ULHqSbGdLBWdtfnTRbMx8wKFWTD7k-CsM&amp;s=1\"><div class=\"link-tool__image\"><img loading=\"lazy\" src=\"https://cdn11.bigcommerce.com/s-6ubn8z08et/images/stencil/1280x1280/z/solar-backpacking__90555.original.jpg\" alt=\"\"></div><div class=\"link-tool__title\">Portable Solar Chargers for Backpacking</div><span class=\"link-tool__anchor truncate\">voltaicsystems.com</span></a></div></div>","author":"Will Taylor","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_30864","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I’m a fan of my Goal Zero Nomad 7. Charges my phone 0-100 in an hour in direct sunlight. However, I now use an Anker 20000mAh powerbank instead.</div>","author":"Ty Dawley","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_618784","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I have been using a Goal Zero Nomad 10 or the previous equivalent in a passthrough configuration for about as long as they have been around.  It has kept the phone kept the phone charged every day in addition to a keyboard, and a tablet.  Only the phone is attached in the passthrough setup.  For just a phone a 5 will provide all you need.  I use the Goal Zero Venture 30 power pack.    Have used small ones for just the phone with complete success.  Direct full sun is not necessary to get a complete charge.  Touring year-round on all the continents, except Antarctica, I have never had a time when I did not have sufficient power for all my devices.  \n\nI leave the panel strapped to my rear rack all the time.  Heat has not been a problem, nor has rain, or snow.  Note the picture.  \n\nThe worst problem was when the panel and power pack were underwater for the entire night during a 3 month canoe trip.  The panel still functioned.  The power pack quit after 2 days.  Goal Zero sent me a new one overnight at no charge.  Cannot say they will do that consistently, but it was great of them.</div><div class=\"comment_attachment\"><div class=\"comment_photo_attachment\"><img class=\"comment_photo_image\" loading=\"lazy\" src=\"/images/community/what-to-look-for-when-buying-a-solar-charger-for-bikepacking/image_1659022590_6205267729.jpg\" alt=\"\"></div></div>","author":"Bill Heimann","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_564379","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Bill Heimann\"> Thank you</span></div>","author":"Kristi Kucera","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_523011","type":"fbcomment","data":{"text":"<div class=\"comment_text\">If you are only going for a week, and only charging a phone for pictures a couple of 20 000 mAh battery banks will be cheaper and a lot less cumbersome. If you are only taking pics, and not taking lots of video or navigating, then one battery bank would be enough. If you set your phone to the maximum battery saver setting, then even 20 000 mAh would be overkill.</div>","author":"Mark Perry","gender":"UNKNOWN","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_793944","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Mark Perry\"> Thank you. I'll just be using my phone to take pictures and to Strava my rides. So with battery Banks you just charge them beforehand? And if I had a small solar panel could it recharge the power bank when it runs down?</span></div>","author":"Kristi Kucera","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_907010","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Kristi Kucera\"> Yes, you can charge before you go, and if you stop at a gas station or diner you can often charge there. You could buy a small solar panel, but it is just something else to mess around with. As well as the bike tourists, I also follow hiking Youtubers, and several of them say that they dumped their solar chargers. You also need to compare the extra weight and bulk of even a small solar panel , with that of a second battery bank.\n\nI am not saying that solar does not have its place, it does. But I don't think that you need one in your plans.\n\nI spent a lot of time researching solar chargers as I need to carry a medical device with a pretty heavy duty (40k mAh, 12v out) battery bank. My friend who is an electrical engineer looked at the specs and we figured solar would be more of a problem than a solution. But I can now buy fast charge 84 mAh multi-voltage that charge fully in 6 hours.</span></div>","author":"Mark Perry","gender":"UNKNOWN","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_967862","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Mark Perry\"> Thank you.  Whenever I start researching I just get overwhelmed trying to figure it all out. And you're right, weight is an issue because on some of the rides I'm also planning on pulling a Burley trailer to take my dog with me and right there is 75 lb🤪</span></div>","author":"Kristi Kucera","gender":"FEMALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_799175","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Kristi Kucera\"> <span class=\"ce-fbcomment-quote\" data-quote=\"Mark Perry\"> is right in one respect.  The solar is just too bulky for what you actually gain.  They were a good choice for a while but the technology has passed them.  They wouldn't do much for a battery bank of 20,000.  My personal max is 10,000 but end up using my 5000 more frequently since it charges faster.  But none work well without a plug somewhere.\n\nUse an actual bikegps.  They're more efficient than a phone.  If you must use a phone keep the screen turned off most of the time.  When I used to use one I'd mostly memorize my route and only fire it up when necessary.  For actually navigating they consume a lot.\n\nConsider that the average good cell phone these days costs more than reasonable quality bikegps units.  And the phone is much less efficient.</span></span></div>","author":"Daniel Ellsworth","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_773197","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Daniel Ellsworth\"> Thanks.So much to consider🤪</span></div>","author":"Kristi Kucera","gender":"FEMALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_483413","type":"fbcomment","data":{"text":"<div class=\"comment_text\">One more think to think about if you are going to change your phone at all. Some phones now have high power 'Turbo' charging. My new mi11 phone has a 55 watt charger and will fully charge my smart phone (5000 mAh i think) in 35 mins. Some phones have 125W chargers and will charge in less than half the time of this. I believe some powerbanks also have Turbo charge now. This means you could charge up in the time it takes to drink a coffee at a gas station.</div>","author":"Mark Perry","gender":"UNKNOWN","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_767235","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I would just bring a few USB battery packs. Those small solar chargers don't work that great in my experience unless they have direct sunlight. You have to keep chasing the sun with it all day. I was able to go two weeks with listening to Spotify all day and watching Netflix at night. I had 4 USB battery packs and would charge them once every two weeks at warm showers host or hotel.</div>","author":"Joshua Auerbach","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_62156","type":"fbcomment","data":{"text":"<div class=\"comment_text\">If you go with the solar panels, NEVER charge your phone directly. Charge an USB battery pack that will then charge your one. Your expensive phone, camera, etc can get damaged if the solar panel gives a spike or other issue.</div>","author":"Morrie Portnoff","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_599324","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Morrie Portnoff\"> Thanks. Good to know.</span></div>","author":"Kristi Kucera","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_847903","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Get a pedalcell.  Better than anything else you can use to generate power.  And it's always good to have a powerpack or two for backup.  Not huge ones.  They take too long and too much to fully charge.  Forget the panels.  Though they're nice the pedalcell is much better.  Also a better choice than dynamos.  I've had 3 dynos and a solar panel.  So plenty of experience.</div>","author":"Daniel Ellsworth","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_454152","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Daniel Ellsworth\"> Thanks. I've considered the pedalcell but when I tour I ride my Stumpjumper with front shocks and I'm not sure a pedalcell will mount on it. Plus riding on rough terrain and mountain trails.</span></div>","author":"Kristi Kucera","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_136906","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Kristi Kucera\"> I'll take a look.  I've an extra pedal cell.   I've a mountain bike here with shocks and see if i can mount the pedal cell.</span></div>","author":"Daniel Ellsworth","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_103422","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Kristi Kucera\"> I've a very old mountain bike with rim brakes and 26\" wheels.  I could mount it on the main shell of the front shock backwards on the left side.   Where they recommend for rim brakes.  I didn't ride it since I recently had an operation and I'm not supposed to yet.  But I could see it would probably work.  I adjusted it with the proper angle.  The only issue is the shocks are quite rounded and the pedal cell is designed for a bit of oblong shape.  I tightened enough I couldn't budge it.  So perhaps it would be fine.  The rear wouldn't mount with my rim brakes.  The brake mount is too high preventing proper positioning.  Disk it probably would.  But you'd need all the spacers they send with it since the seat stay is quite narrow.\n\nIf you want to pursue it they actually have quite good customer service with online chat.  You could probably send them a picture(s) and they could give you a definitive answer.  They'd probably let you do a trial and return if it didn't work.\n\nI've ridden mine on my touring bike on rough gravel roads and a bit of stoney trail and had no issues.  I'm a lot on gravel roads and feel confident it's okay.  I'm not as much on rough trails with big rocks so can't advise on that.  I'd personally would still do it since it's a low percentage of my riding.  A very nice feature is that you can simply retract it with a simple pin release by hand.  So in less efficient conditions you stop and in 5 seconds it's retracted.  Then the same 5 second stop to teenage reengage.</span></div>","author":"Daniel Ellsworth","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_690024","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Daniel Ellsworth\"> Thanks so much</span></div>","author":"Kristi Kucera","gender":"FEMALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_482521","type":"fbcomment","data":{"text":"<div class=\"comment_text\">mAh measures battery capacity. Ideally, your solar panel won't have a built-in battery, it'll just charge batteries. Solar panels are measured in watts (though the stated watts are some idealistic theoretical maximum - you'll be lucky to get half that at noon on a cloudless summer day in US latitudes).\nThe mAh is \"milliamp hours\", and the assumed voltage in that is 5 (as in USB), meaning a 10,000mAh battery pack can output 50 watts for an hour (watts = amps * volts). Watts is a rate of power, while watt-hours (or here, mAh), is an amount of energy (E.g. your home electricity is billed in kilowatt-areas).</div>","author":"Leif Warner","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}