{"time":1659346881799,"version":"2.23.2","blocks":[{"id":"id_830762","type":"header","data":{"text":"What Multitool Components Would Be Useful for Bike Tours?","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_685593","type":"paragraph","data":{"text":"<i>I've bought myself a Topeak Hexus X multitool, which I feel is a good choice and not too small and fiddly.\nBut my question is what additional multitool components do people find useful e.g. pliers, scissors etc.\n\nAnd which multitool do people recommend? I am looking for something fairly basic and lightweight for short tours. I could also be in the market for an even smaller everyday carry tool.\n\nThank in advance for your suggestions.</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_350856","type":"delimiter","data":{}},{"id":"id_129272","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I love my Topeak alien 2, it’s always in the saddlebag, I’ve a small pair of needlenose pliers in it as well, just for getting stuff out the tyres when I’ve had a puncture</div>","author":"Anatoli Bugorski","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_641204","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Anatoli Bugorski\"> brilliant, this is the kind of thing I am meaning, also tools to use off the bike whilst touring. With regard to puncture and first aid, I just watched a video on the Swiss Army Explorer knife which has tweezers, a straight pin and a magnifying glass. But I've heard needlenose pliers can equally be used to remove splinters from human skin and tyres.</span></div>","author":"William Gilmour","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_79587","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I've had the same topeak alien tool for 15 yrs.  Always comes in handy, had a good chain breaker on it which is a must have tool.</div>","author":"Ryan Parker","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_544597","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Ryan Parker\"> lots of votes for the Alien! Although the Hexus X also has a solid chain breaker, and a replacement pin can be ordered as a spare part. And of course I am carrying the necessary quicklinks.</span></div>","author":"William Gilmour","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_687822","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I have an earlier version of the Hexus and it is my favorite. Maybe check out the Topeak Alien which has more tools in it and may be a good choice for touring. I also have an early version of that and a similar one by Park Tool.</div>","author":"Steve Reisman","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_769390","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Thanks, I feel the Hexus gives me enough bike tools, it is the other more general toolset I am looking to add right now. Maybe I will find I need the Alien further down the line? Thanks for your comment.</div>","author":"William Gilmour","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_62613","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Another Alien 2 user here but the key extras I have are:\n\nNBT2 for cassette removal\n\nSmall adjustable spanner\n\nTie-wraps\n\nTyre levers</div>","author":"Mark Litherland","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_676235","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I’ve carried a multi tool for years on tour. However I think I am going to change to carrying individual longer Alan keys.  This is because I find my multi tool Allen keys are just not long enough for certain jobs - even though they are one of the longer multitools.  Also many things on the multi tool are not needed.  I plan to carry a 3,4,5,6 size.  I have also replaced all torx bolts with allen equivalents.  I also carry a separate chain breaker,  mini cassette removal tool and a small pair of pliers.  Oh and small size JSI screwdriver to adjust stop screws.</div>","author":"Roger Leary","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_563694","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Roger Leary\"> I feel there is a home exercise to attempt to reach and loosen/tighten every bolt etc that you would want to be able to adjust on tour. And then add the requisite additional tools. 5mm allen key is what I have come up with so far for my own needs. Personally, I am only looking to master a limited skill set, and so can skip pedal, crank bolts etc.\n\nIn terms of tools not needed, that is a point in favour of a multi tool such as the Hexus X which is mainly allen keys and torx keys. Also, looking at the grip and leverage available on both sides of the Hexus X chain tool, I am struggling to imagine a portable chain tool which is a marked improvement on that.\n\nBut thanks for sharing some pointers as to what a more complete touring toolset might look like.</span></div>","author":"William Gilmour","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_250994","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"William Gilmour\"> ,  I found I needed a longer size 3 key to adjust disc pad distance (at the disc).  I had a brake lever come slightly  loose, needed to go to a bike shop for a longer size 5 key to tighten.  I couldn't undo a pedal with my size 6 key, though managed eventually. ( even though I had loosened pedals at the beginning of my tour).  Minor issues with the right tools but a pain with my multitool (Crank Bros).  All of these issues have made me reconsider.</span></div>","author":"Roger Leary","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_670518","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I have a small leatherman tool with needle-nose pliers that’s definitely handy on a tour.</div>","author":"Ivan Liew","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_713874","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Ivan Liew\"> thanks, this is the real question I was asking. I know the larger Leatherman can be quite heavy so am curious which small one you went for.</span></div>","author":"William Gilmour","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_668807","type":"fbcomment","data":{"text":"<div class=\"comment_text\">agreed, I bought a leatherman and it weighed a ton!  I now carry a small, generic multitool with needle nose pliers. Perfectly adequate for me and  a third of the weight.  However I can no longer remove stones from horses hooves.....</div>","author":"Roger Leary","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_671969","type":"fbcomment","data":{"text":"<div class=\"comment_text\">One of the smallest mini ones with pliers. Smaller than average Swiss Army. Many generic brands available too.</div>","author":"Ivan Liew","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_898983","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Ivan Liew\"> thanks, that sounds a good way to do it. As a Swiss army knife with pliers is going to be huge, and the pliers v. small.</span></div>","author":"William Gilmour","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}