{"time":1655721761148,"version":"2.23.2","blocks":[{"id":"id_206028","type":"header","data":{"text":"What Is the Best Sleeping Pad for Month+ Long Cycle Tours?","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_834181","type":"paragraph","data":{"text":"<i>Those of you who do month+ long trips, what do you use as a sleeping pad and pillow? I use inflatable ones, but this is the longest trip I'm on and both have got slow punctures that I can't easily find and thus can't see how to repair. I'm wondering if a solid pad is better for long tours? Given its durability. Are they warm enough for cold winters?</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_933459","type":"delimiter","data":{}},{"id":"id_581296","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I just bought a Sea to Summit pillow and I have a Nemo sleeping pad. I recommend both.   👍</div>","author":"Chris Styles Flaro","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_251889","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I've never liked inflatable pads for this reason.</div>","author":"Shane Daly","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_712452","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Shane Daly\"> inflatable pads pack down small. I would love the luxury of a blow up mattress , but when you're on a two month cycling trip....that's not an option.</span></div>","author":"Chris Styles Flaro","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_996145","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I have tried many different sleeping systems.  Clothes bundled up for a pillow, form pads, just the ground, and so on.  For my best sleeping is a high quality inflatable pad and an inflatable pillow have proved to provide the best sleeping.  However, I must say that I can sleep anywhere, in any condition.  So, does my opinion mean much?  Yes and no.  The fact that I have tried many systems says that I have a well formed opinion.  The fact that I have a great tolerance for extremes says, be careful listening to this guy.  \n\nTherma Rest produces very good sleeping pads that not only provide comfort but protection from wet and cold.  Your tent floor provides protection for the pad.   An inflatable pillow allows adjustments to your needs.</div>","author":"Bill Heimann","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_619953","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Bill Heimann\"> I agree - Thermarest are very durable. I also find their Trekker Chair invaluable after a day in the saddle.</span></div>","author":"Laurie Piper","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_647897","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Laurie Piper\"> I also use a camp chair.  It is also great inside the tent on rainy days.</span></div>","author":"Bill Heimann","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_611627","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I do both. An inflatable and a short foam  pad with smaller pads to give it full length. The foam pads go under the inflating mattress to provide further insulation and loft, and protect from puncture. If the inflating mattress fails ( and I've been through at least a dozen ) than the foam mattress takes its place until I can replace it. A good inflating mattress will last a few years of constant use. A thermorest, about 18 months before it delaminates, or less if it develops many small unfindable punctures.. I use a Klymit now, which is fairly inexpensive in the U.S. They can last as little as 6 months or as long as several years. The one I'm using now is very comfortable and has worked well for two years of continuous use without leaking. I got it from Amazon for $50, and it's full length.</div>","author":"David Brankley","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_761235","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I took a blow up pillow and an air mattress a quilt and a 2 person tent.</div>","author":"Jean Phillips","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_17802","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I used a Thermarest neo-air on a year plus trip. It never punctured but did develop a slow leak that I never could find. Had to wake up at midnight to reinflate... and by the end of the trip even reinflate a second time in the early morning. Tried so many times to submerge pad in lakes and bathtubs to look for bubbles....but no luck. Once I got back to the states I got it warrenteed by Thermarest with few questions asked.... but annoying while on the trip.\nPrevious trips I used the older style pads with foam core and self inflating which seemed to be more durable.... but also heavier.</div>","author":"Madhavananda Das Brssm","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_953637","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I use a Nemo tensor inflatable pad with below a therm a rest Z lite. To protect from punctures and extra isolation. A a pillow I have one from therm a rear with real stuffing you can roll in a package. Not the smallest but so comfortable!</div>","author":"Anja Verschoor","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_471945","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I like the compactness of an infatable pad, but have had the same problems that others have mentioned - obscure slow leaking meaning I have to reinflate during the night. I have never taken a pillow on bike tours - happy to bundle up a few clothes wrapped inside my fleece jacket.</div>","author":"Biff Frederikson","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_909110","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Sea to Summit pillow. Been using it the last 4 or so years now, 100+ camping nights. Best pillow I've used in about 25 years of camping. The trick for comfort is to only inflate it about 50% for my liking.</div>","author":"Martin Hughes","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_760710","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Have had US Army surplus self-inflatable pad for years. Got a puncture about 10 years ago in Spain. Sprinkled the pad with soap water to find the hole, sealed it, put a strip of duct tape at the top to be sure that the patch doesn't go off, and it's good as new. Used bundled clothes for a pillow but my ears hurt every time from the uneven surface, so I bought a small inflatable pillow in an airport. Now I put it on top of some clothes, and problems have gone.</div>","author":"Juris Lipsnis","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_381802","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Got any slime?</div>","author":"Jef Ott","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_196924","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I've used a bundle of clothes as a pillow for years but a pillow is worth it for having better nights. I would not go without one. I have a compressible Thermarest.</div>","author":"Martin Koole","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_411734","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I've used foam pads and inflatable, an inflatable is much more comfortable (especially if you are a side sleeper). You can use a single foam pad in winter but I prefer to use both for warmth and because your pad will often get wet if you are camping on snow. However, on a long tour (months+), your inflatable pad will eventually break somehow, so I stick with the foam pad as it is basically indestructible. Thermarest are great at replacing pads, but it is a pain to get a new one delivered when you are on the road.</div>","author":"James Stearn","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_742373","type":"fbcomment","data":{"text":"<div class=\"comment_text\">We use inflatable mattresses but do make sure that the mattresses are easily repairable in the field. We had air matresses that had a woven (pack cloth like) coating on one side. While it was intended to make the mattress more durable it actually made it useless. We did get a small puncture and it needed to be repaired with an iron on patch.  Competitor completely useless on a long tour.</div>","author":"Steve Hiniker","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}