{"time":1655553192563,"version":"2.23.2","blocks":[{"id":"id_604147","type":"header","data":{"text":"Which Camera for Bikepacking Adventures","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_621208","type":"paragraph","data":{"text":"<i>Anyone here into photography? I'm trying to decide on a camera for my bikepacking adventures. I spend a lot of time off road, so durability is important. I also favour weather proofing. Since I'm in nature a lot, most of my photos are of landscapes and some wildlife, although I do also like taking photos of buildings and people.\n\nI have been looking at the Fujifilm x100 and Sony alpha series, although I'm open to hearing other ideas.</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_835968","type":"delimiter","data":{}},{"id":"id_813259","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I can recommend the lumix fz 300, if you want i can sent you some samples!</div>","author":"Eric Maes","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_66247","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I'm pretty happy with my nikon z50, but the downside is that the z lenses are quite expensive and there are not too many varieties, so I had to buy an ftz adapter.</div>","author":"Søren Rosenius Olsen","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_862783","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Søren Rosenius Olsen\"> I see it's not fully weather sealed. Do you ever have it out in the rain? Hour do you protect it?</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_149444","type":"fbcomment","data":{"text":"<div class=\"comment_text\">It's in my ortlieb handlebar bag. They make a camera insert, which I use for my current trip and it works great. Regarding rain I still take pictures and haven't experienced any problems yet. I had a sony rx100 until some wind made my tripod fall over. That camera was way more affected by damp and high humidity caused by rain. So there is definitely a difference there. I haven't tried using the z50 in heavy rain for more than a few seconds so far though. Haven't had any problems in light to moderate rain.</div>","author":"Søren Rosenius Olsen","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_389827","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Moinudin\"> - the Olympus m43 pro cameras and lenses are amazingly weather proof. Loads of videos of folk leaving or cleaning them in shower.\nAnd this is an interesting story from theonlinephotographer...\n\nThe Olympus [E-M5 II] with ƒ/2.8 zoom attached had fallen into the pond, into a few inches of water. I quickly scooped it up and dried it off on my shirt as best I could.\n\n...\n\nSo I kept the Sony and its lenses back at the house we were staying in, and used the E-M5 Mark II with the 12–40mm ƒ/2.8 and the 40–150mm ƒ/2.8 Pro zooms. I got soaked to the bone. Of course, the camera and lenses were fine.\n\n...\n\nThe day of the first big snow last year I did a lot of photography, in three sessions. I used the E-M5 Mark II and other cameras within walking distance in the first session. I drove someplace I thought might be good for a second session, and for the third session I was closer to home again.\n\nStill snowing the next day, I went out again, and reached for the E-M5 Mark II in my bag. It wasn't there. I couldn't find it anywhere. Tracing my steps from yesterday I would only be slogging through eight to ten inches of new snow. If I was going to find the camera I would have to feel it with my foot. There would be a lot of ground to cover, kicking at acres of new snow cover. Hopeless.\n\nSo I wrote my little Olympus off as lost. Sometime later I replaced it with another used E-M5 Mark II body with low use, and I also replaced the 60mm ƒ/2.8 Macro lens lost with it.\n\nHere in Vermont last Winter we had steady snow cover, but it was not by any means a Winter of powder. It rained as often as it snowed. Hard rain at times, including Winter thunderstorms. The snow has often been wet snow. While March was a Winter month, often below freezing, February was unusually warm, featuring a lot of thaws and rains. I've been painfully aware of this weather, knowing that I had an Olympus EM-5 Mark II with the 60mm ƒ/2.8 Macro lens out there somewhere. But then...\n\n...Four and a half months later...\n...I found the lost Olympus!\n\nAbout two weeks ago, next to the path between the garden and house, there it was: lens-up, during Vermont's final mid-altitude snow melt. It had been out in the elements for four and a half months: four and a half months of hard, atypical, changing Vermont Winter. Raining and snowing, freezing and thawing. I grabbed it out of the snow and immediately took the lens off to look inside the camera and through the lens. There was some wet fog on an inner element, and condensation on the sensor glass. I took out the battery, which was dry. Camera and lens, separated, were placed in a sunbeam on a warm windowsill for a while, as I prepared a large glass jar with dry desiccant. The lens quickly cleared, and of course the sensor glass dried quickly.\n\nThe next day was maybe too soon to check, but I couldn't help my curiosity. I put the battery in, put the lens on, and powered it up.\n\nIt worked perfectly.</span></div>","author":"Jeremy Lawrence","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_25667","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jeremy Lawrence\"> I missed this comment until now. This makes me want to seriously consider this camera! Is it worth considering the newer iii model? What lenses would you recommend for the purposes I've mentioned? Landscapes mostly, but also ability to take other shots.</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_537045","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Moinudin\">, the later models are better,  as is usual. With 3 fairly small lenses you can cover 16-300mm at f2.8 (FF equivalent). But at a much larger price than a pocket camera. It's a really small setup for interchangeable lens kit,  but big for bikepacking kit. But obviously you can use it rest of time too.</span></div>","author":"Jeremy Lawrence","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_466764","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Moinudin Gallotta\"> I’ll jump in. I have an Olympus E-M1ii, a bigger body than I’d prefer for cycle touring, but it’s what I have. I’m touring now and the most versatile lens, imo, is the 14-150 1:4-5.6ii. It’s weatherproof and much lighter than the Pro lenses. There may be something newer available but I’m happy with mine. \n\nI’m also carrying a non-weatherproof 9-18 that I picked up used but it’s really wide. \n\nNote that these are M43 so double the focal length numbers for FF equivalent, i.e. my favourite zoom is 28-300 ffe.</span></div>","author":"Jacquie Gaudet","gender":"UNKNOWN","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_586718","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I'm a professional photographer with loads of various sized cameras. Yet use my iPhone a lot of the time when cycling. \nLike all cameras it has it's limitations [not good for action or low light], but simply by being accessible in my jersey pocket at all times means I use it more than I would my bigger cameras. \nI did have a Sony RX100III, but that fell apart after Sony 'fixed' it which is otherwise an excellent camera for riding. Fits in pockets and produces images good enough for pro work. Mind you images from a new iPhone can also be very good and now feature on my website. \nMy Olympus m43 camera gear is about the best weatherproofed interchangeable lens camera gear out there and way smaller and lighter than my full frame camera gear. But best sealing is with the more expensive Pro lenses - the f2.8 40-150mm is good for wildlife at a distance without being stupidly heavy. \nI also have a drone which can give you different viewpoints for images, for example...</div><div class=\"comment_attachment\"><div class=\"comment_photo_attachment\"><img class=\"comment_photo_image\" loading=\"lazy\" src=\"/images/community/which-camera-for-bikepacking-adventures/image_1655553191_7623409091.jpg\" alt=\"\"></div></div>","author":"Jeremy Lawrence","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_261191","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jeremy Lawrence\"> I've heard the iPhone case. The phone I currently have has a mediocre camera. Would you still recommend an iPhone for its camera? I've owned an rx100 series camera before (it got wet and died), so I know what it's capable of. I must be honest, I'm torn between returning to something like that to learn with versus getting something I can play around with lenses. Bit nervous the lenses might complicate it at this stage and prevent me from Judy taking pics.</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_767933","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jeremy Lawrence\"> what camera do you put on your drone? Perhaps a dumb question but I've always wondered this. Or do they have their own cam?</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_992191","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Depends. Most drones have a camera built in. But if you get an FPV [first person view - you use with goggles] drone, you add you own camera, But only if  you want to.</div>","author":"Jeremy Lawrence","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_639712","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I would never say 'definitely use an iPhone', but I would say it's better than many folk give it credit for. But it definitely has limits. But constraints can be creatively inspiring. \nHere's a series of images I took using iPhone whilst doing local exercise every day in January last year during Covid. Ideal tool for that job, even if light levels were terrible/non existent at times. . \n\n<a href=\"https://www.futtfuttfutt.com/-/galleries/imajez-portfolio/red-january-2021\" target=\"_blank\" rel=\"nofollow\">https://www.futtfuttfutt.com/-/galleries/imajez-portfolio/red-january-2021</a></div><div class=\"comment_attachment\"><div class=\"link-tool\"><a class=\"link-tool__content link-tool__content--rendered\" target=\"_blank\" rel=\"nofollow\" href=\"https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.futtfuttfutt.com%2F-%2Fgalleries%2Fimajez-portfolio%2Fred-january-2021&amp;h=AT031VIXV62tsuCnno74P6MvLffIWFdErYVD3ScoQo4O6xWrW5OarFFDhQl57Ym74I5arsL5q6YWo1RbFJKg-L3SVllNJiiOhLPdAb7vi0tud71mX1vldV4Jh0VxtnTecSaJRP9dtbK2glo&amp;s=1\"><div class=\"link-tool__image\"><img loading=\"lazy\" src=\"https://di262mgurvkjm.cloudfront.net/5b9a7874-f039-4386-9cd4-1c5632609a3e/2021-01-28_RED_January_Slow_Ride_in_Ecclesall_Woods_106-Edit-4-Edit-Edit-Edit_uxga.jpg\" alt=\"\"></div><div class=\"link-tool__title\">Futt Futt Futt Photography | Sub-Urban RED January 2021</div><span class=\"link-tool__anchor truncate\">futtfuttfutt.com</span></a></div></div>","author":"Jeremy Lawrence","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_484493","type":"fbcomment","data":{"text":"<div class=\"comment_text\">DJI</div>","author":"Curtis Lane","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_933180","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jon\"></span></div>","author":"Paul Götzl","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_917130","type":"fbcomment","data":{"text":"<div class=\"comment_text\">So I'm out on a road right now and I'm using my phone for most of my photos but for something special or if I'm taking a rest day in a town in running my nikon d3200 with a 35mm. I would probably prefer a nutritious\nMirrorless I'm eyeing up the Nikon z5 or sony a7 III. With around 20mm lens. The mirrorless cameras are just so much more compact and honestly the thingi hate most about my camera is how much space it is taking up. Plus it's mostly landscapes and vlogs so something wider than my 35mm would be nice. \n\nIm generally not a fan of kit lenses but that is a me thing.</div>","author":"Sufyan Saleem","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_394654","type":"fbcomment","data":{"text":"<div class=\"comment_text\">It also goes in a small camera bag inside by trunk bag on my panniers. Seems to be holding up fine. I do short in light rain and it's been alright.</div>","author":"Sufyan Saleem","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_814505","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Sufyan Saleem\"> yeah I'd never want to lug a DSLR on a bike. For me it's either compact such as the Sony rx100 series or mirrorless. There's an article on <a href=\"http://bikepacking.com/\" target=\"_blank\" rel=\"nofollow\">bikepacking.com</a> about how to carry your camera, and most people seem to recommend carrying on your body due to vibrations. And I spend lots of time off road so that's important for me</span></div><div class=\"comment_attachment\"><div class=\"link-tool\"><a class=\"link-tool__content link-tool__content--rendered\" target=\"_blank\" rel=\"nofollow\" href=\"https://l.facebook.com/l.php?u=http%3A%2F%2Fbikepacking.com%2F&amp;h=AT3GXTPiHPoTyaxNchmIObrZ44tGX4Lm751Ek7J0QlNjPw3mFY5PlNVTZ5ubq26uJYsVnHIyDxiw5ioIPFHAuwb-RuNiL0HZS83gvfz6LzS3w_VPI-tZBk7sQdllUZAyC23qDAc9x8iKMUc&amp;s=1\"><div class=\"link-tool__image\"><img loading=\"lazy\" src=\"https://bikepacking.com/wp-content/uploads/2013/06/bikepacking-FB-ad.jpg\" alt=\"\"></div><div class=\"link-tool__title\">BIKEPACKING.com - Bikepacking Routes, Gear, Inspiration</div><span class=\"link-tool__anchor truncate\">bikepacking.com</span></a></div></div>","author":"Moinudin Gallotta","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_103450","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Moinudin Gallotta\"> yeah that is true, but you have got to enjoy it too. I would hate to wear any kind of bag for a bikepacking trip especially doing back to back 100km days for weeks at a time. I suppose it depends on what kind of off road, hardpack gravel or single track with features.</span></div>","author":"Sufyan Saleem","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_296443","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Sufyan Saleem\"> I'm often on quite technical trails. People on that article have told stories of cameras rattling to pieces and I'm not surprised, I often find loose bolts on my bike that weren't fastened tight enough. I'm looking into fanny packs.</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_696559","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Moinudin Gallotta\"> fair enough, would be good to know what you experience of it is like when you have it figured out</span></div>","author":"Sufyan Saleem","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_958837","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Moinudin\">, the issue with carrying camera on body is getting hurt when you land on it. I used to use hip packs for camera gear or tools, but never wore one again after a chap I know landed on his and folded his spine around it, cracking vertebrae. \nI'm also careful about what I put in rear pockets.</span></div>","author":"Jeremy Lawrence","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_485899","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jeremy Lawrence\"> ouch! Was he carrying it facing the front or back? Where would you carry it then given what I've said about the trails I take?</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_346851","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Moinudin\"> - hip packs are usually on back over spine. Wouldn't work other way around. \nSafest place for camera is in front of body - if carrying on body. But that's limiting camera size. And why I prefer cameras that fit in pocket.</span></div>","author":"Jeremy Lawrence","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_462424","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jeremy Lawrence\"> would a mirrorless like the Sony alpha series fit front of body? I'd have thouht yes as long as the lenses don't take too much space. Otherwise I'm with you on likely want to go smaller.</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_143964","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Moinudin\"> - be aware mirrorless does not equate to smaller cameras/lenses. \nPeople only think that because first mirrorless cameras were smaller sensors. Now smaller sensors do equate to smaller cameras and lenses. I happily carry my m43 with an 80-300mm f2.8 FF equivalent lens. I dread to think how heavy such a useful lens would be for my already enormous FF bodies.</span></div>","author":"Jeremy Lawrence","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_141430","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jeremy Lawrence\"> Sony do have their line of pancake lenses though, very compact, not going to be doing a wild life shots on that though.</span></div>","author":"Sufyan Saleem","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_858129","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jeremy Lawrence\"> yeah I know that, what I meant was does a mirrorless equivalent to the Sony alpha series fit? I don't know how they compare to the m43 cameras but they're built to be reasonably sized. I ask cause I've seen and held then so they're a good reference point for me.\n\nWhich m43 do you have / recommend?</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_545819","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Sufyan Saleem\"> I'd go for landscapes first. Those are most of my current shots.</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_708735","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Moinudin\"> - it's the lenses that make the size differnce between FF and m43. FF lenses are maybe 2x or more bigger and much, much heavier.</span></div>","author":"Jeremy Lawrence","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_380477","type":"fbcomment","data":{"text":"<div class=\"comment_text\">This an EM5II vs Canon 5DIV\nwith 24-70 equivalent lens Vs a 24-35mm FF lens. The FF 24-70mm is much bigger again.</div><div class=\"comment_attachment\"><div class=\"comment_photo_attachment\"><img class=\"comment_photo_image\" loading=\"lazy\" src=\"/images/community/which-camera-for-bikepacking-adventures/image_1655553191_3785305266.jpg\" alt=\"\"></div></div>","author":"Jeremy Lawrence","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_822899","type":"fbcomment","data":{"text":"<div class=\"comment_text\">This with 80-300 f2.8 equivalent. FF version would be ginormous. If it existed.</div><div class=\"comment_attachment\"><div class=\"comment_photo_attachment\"><img class=\"comment_photo_image\" loading=\"lazy\" src=\"/images/community/which-camera-for-bikepacking-adventures/image_1655553192_4201206900.jpg\" alt=\"\"></div></div>","author":"Jeremy Lawrence","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_992926","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Camera bodies.</div><div class=\"comment_attachment\"><div class=\"comment_photo_attachment\"><img class=\"comment_photo_image\" loading=\"lazy\" src=\"/images/community/which-camera-for-bikepacking-adventures/image_1655553192_8132761545.jpg\" alt=\"\"></div></div>","author":"Jeremy Lawrence","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_251143","type":"fbcomment","data":{"text":"<div class=\"comment_text\">The Olympus m43 are the most waterproof cameras around and really nicely designed. Olympus kit has always felt like a photographer designed them, not a marketing person. \nThey also have a clever multi-shot mode to get 64 or 80mp images. You need a tripod, or in more recent models, you can supposedly handhold. Not tried them yet. Sony does multishot too but it's so very painful to deal with in post production it's awful.</div>","author":"Jeremy Lawrence","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_639652","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jeremy Lawrence\"> Love my Olympus.</span></div>","author":"Bill Bubnis","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_103390","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I got a Ricoh grii and I never ever pack any of my other cameras anymore. The size to quality ratio is unparalleled. \nIt's popped outta my bar bag and hit the concrete, spent nights in a dewy tent, and shook on the bars for 100s of kms with zero issues. \n\nBiking destroyed my Sony rx100iii, nearly killed my Fuji x100f. \nIf you're comfortable with the wider (28mm) focal length there is not a better travel camera.</div>","author":"Alex Paterson","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_777986","type":"fbcomment","data":{"text":"<div class=\"comment_text\">The later GRIII has some appeal, but has way too many drawbacks for my liking <span class=\"ce-fbcomment-quote\" data-quote=\"Alex\">. It's been around 3+ years now too, so also long overdue for a necessary upgrade.</span></div>","author":"Jeremy Lawrence","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_536621","type":"fbcomment","data":{"text":"<div class=\"comment_text\">no weather proofing, but no issues yet on my fuji xt20…. i LOVE IT.\n\n<a href=\"https://www.reddit.com/r/bikepacking/comments/v6nfq3/broke_some_bones_and_had_to_call_it_early_but/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\" target=\"_blank\" rel=\"nofollow\">https://www.reddit.com/r/bikepacking/comments/v6nfq3/broke_some_bones_and_had_to_call_it_early_but/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf</a>\n\ni also have more in my highlights on ig piggyditch_farm</div><div class=\"comment_attachment\"><div class=\"link-tool\"><a class=\"link-tool__content link-tool__content--rendered\" target=\"_blank\" rel=\"nofollow\" href=\"https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.reddit.com%2Fr%2Fbikepacking%2Fcomments%2Fv6nfq3%2Fbroke_some_bones_and_had_to_call_it_early_but%2F%3Futm_source%3Dshare%26utm_medium%3Dios_app%26utm_name%3Diossmf&amp;h=AT33kgM0OYtvhN_grwFs0cOdzMi1If43_r_SihTdAxnrOVIYLE1CwxxrFSkFMhNQNb7ZZvMv7tHsgJGPO9FS7tAoAQdpT1fbfqcxpy_xGLwvKwfTLbPwW5vhozrCGr-U7cIDUC6TPF-2PWs&amp;s=1\"><div class=\"link-tool__image\"><img loading=\"lazy\" src=\"https://a.thumbs.redditmedia.com/ZBrsvdB5tt7vRWifNRT3OhAEYQ13D0DxGF7qp5ILbF0.png\" alt=\"\"></div><div class=\"link-tool__title\">broke some bones and had to call it early, but certainly had a blast up until...</div><span class=\"link-tool__anchor truncate\">reddit.com</span></a></div></div>","author":"Lucas Ehster","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_774194","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I love my Fuji X-T4!!!  My biggest problem on a trip is deciding which lenses. I have primes (16 1.4 and 35 1.4) and zooms (10-24, 18-135, 55-200).</div>","author":"Deb Young","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_794797","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Panasonic LUMIX DMC-TZ100 have it now three months on a world trip hangs on a leash on my back a lot of dust an no problems yet, it is probably not the best but it is not too expensive and the zoom is a big bonus over using your phone</div>","author":"Mathias Verreyt","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_405637","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Sony A7C with a Tamron 28-200 lens carried in a Rockgeist Big Dumpling waterproof hip pack.</div>","author":"Dermot Blackweir","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_527491","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I hauled my Nikon Z7 all over this past week.  It took a beating off road but still good!</div><div class=\"comment_attachment\"><div class=\"comment_photo_attachment\"><img class=\"comment_photo_image\" loading=\"lazy\" src=\"/images/community/which-camera-for-bikepacking-adventures/image_1655553192_7766781436.jpg\" alt=\"\"></div></div>","author":"Karen Kersch Tone","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_982564","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Karen Kersch Tone\"> how is it holding up and which lens/es are you using. I considering a z5 for my travels</span></div>","author":"Sufyan Saleem","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_507993","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Sufyan Saleem\"> I am not using a lenses, I use the adapter and bring my Nikon 20 mm and 85 mm prime lenses.  They are very lightweight.</span></div>","author":"Karen Kersch Tone","gender":"FEMALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_951279","type":"fbcomment","data":{"text":"<div class=\"comment_text\">The tripod works well to prop up my bike!</div><div class=\"comment_attachment\"><div class=\"comment_photo_attachment\"><img class=\"comment_photo_image\" loading=\"lazy\" src=\"/images/community/which-camera-for-bikepacking-adventures/image_1655553192_6416416999.jpg\" alt=\"\"></div></div>","author":"Karen Kersch Tone","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_588763","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I'm looking hard at Fujifilm x100v as well. even up against the Leica q it does very well</div>","author":"John Capitan","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_632565","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"John Capitan\"> yeah this one's still high on my list, although I might start out with the older x100f.</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_180850","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Moinudin Gallotta\"> yeah smart with all the microchips and etc parts shortages it is very hard to find a V even used</span></div>","author":"John Capitan","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_911645","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Sony Rx-100 VI or above. Equivalent 24-200 range, compact size and fits easily in a feedbag. I have also taken a6000/a6300, but it gets buried further in bags and you don't end up pulling it out as much. Convenience tends to trump the bigger body and I take more photos with the RX-100. With the broad lens range I would need two dedicated zooms to cover that range on the alphas.</div>","author":"John Cotton","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_676789","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"John Cotton\"> my big concern with the rx100 is it doesn't handle water well. Had one that died from a little water.</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_209140","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I had an RX100 albeit the one with [for my needs] the better faster lens <span class=\"ce-fbcomment-quote\" data-quote=\"John\">. Which is almost the perfect bikepacking camera, But it fell apart after Sony 'fixed' the common lens cover fault that they blamed me for and refused to honour warranty. 🙁</span></div>","author":"Jeremy Lawrence","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_379309","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jeremy Lawrence\"> how would you recommend keeping it safe from rain?</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_426128","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Not use it rain and kept in waterproof pocket  would be my only suggestion <span class=\"ce-fbcomment-quote\" data-quote=\"Moinudin\">. \nSadly it may not be robust enough a design for our needs.</span></div>","author":"Jeremy Lawrence","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_235827","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jeremy Lawrence\"> hmm, do you know of an equivalent that would be better in rain and dust? I'm too nervous having already had one that died from water damage. I really appreciate your help here, thanks!</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_149886","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Moinudin\">, you need a weather sealed camera like the pro Olympus m43 kit. Or a 'tough' pocket camera, but they tend to aimed at point and shoot brigade, who now mostly use phones.</span></div>","author":"Jeremy Lawrence","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_615430","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jeremy Lawrence\">  - a couple of other things to factor in - risk vs reward. \n\nCarrying an expensive camera and potentially multiple expensive lenses on a jarring ride. ( you can pick up Rx100 on ebay for under $700. \n\nWhen riding not technical trails - I store it in a feedbag  - but for technical trails (or anything bumpy) you likely want that whole kit on your body. So you are absorbing shock (<a href=\"http://bikepacking.com/\" target=\"_blank\" rel=\"nofollow\">bikepacking.com</a> determined the same thing). In those cases size and # of lenses start to matter. In addition you likely want a waterproof bag (likely a fanny pack to hold the camera). I also carry a couple of ziplocks to protect from wet. Water sealing is never going to be waterproof.</span></div><div class=\"comment_attachment\"><div class=\"link-tool\"><a class=\"link-tool__content link-tool__content--rendered\" target=\"_blank\" rel=\"nofollow\" href=\"https://l.facebook.com/l.php?u=http%3A%2F%2Fbikepacking.com%2F&amp;h=AT1U62PY6aU_4U1tKTmTmMnKZ41n7MtQWlE_ZzHOLXTvbUfT9IcFx5sK8b5AiruuLwZFlwSEpSe7BwLnamvUrJ2GS1Dv3digxh8k35Wluvs3IYF_3UgKcMskJRQeuIDFeH8pS3SW8a79FvE&amp;s=1\"><div class=\"link-tool__image\"><img loading=\"lazy\" src=\"https://bikepacking.com/wp-content/uploads/2013/06/bikepacking-FB-ad.jpg\" alt=\"\"></div><div class=\"link-tool__title\">BIKEPACKING.com - Bikepacking Routes, Gear, Inspiration</div><span class=\"link-tool__anchor truncate\">bikepacking.com</span></a></div></div>","author":"John Cotton","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_617929","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"John Cotton\"> I read that article, but Jeremy mentioned a story of his friend who landed on the camera and it curved his spine. Ouch! Perhaps that's a rare incident? Sounds scary though.</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_381553","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"John Cotton\"> I'm currently deciding between either the rx100 series or mk5 ii. If I had to decide right now I'd go with hw safer bet and starte with the rx100, do what I can to protect it from the rain, and keep mirrorless as a future upgrade. I'm still undecided though.</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_336653","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Moinudin\">, not a camera, but a hip pack/bum bag/fanny pack with tools etc in it. But a camera or hip camera pack over part of spine is same issue. \nI use a backpack that cover entire back with stuff carefully packed if carrying stuff on back My usual backpack curves bag away from spine anyway which makes for more comfort and safety.</span></div>","author":"Jeremy Lawrence","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_578768","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jeremy Lawrence\"> a full backpack seems overkill if I go for something like the rx100. Is there anything else you'd recommend? I'm leaning that way to begin with.</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_643787","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"John\"> - As I said I've had an RX100 III and it it fell apart. And it was never carried on bike. Always in a pocket on body. I suspect Sony repairs didn't put it back together properly after they repaired the flakey lens cover. \nGreat camera re picture quality, but don't think it's the most durable piece of kit. \nOlympus pro m43 kit is incredibly weatherproof. Read my other replies on how very, very good it is. \nI used to have to regularly tighten everything back up on my lenses in days when I still used film. And that kit was always carried on my body.</span></div>","author":"Jeremy Lawrence","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_275379","type":"fbcomment","data":{"text":"<div class=\"comment_text\">It is <span class=\"ce-fbcomment-quote\" data-quote=\"Moinudin\">. It's a pocket camera so I'd keep in chest pocket or a pocket away from spine. A backpack get used if carrying bigger gear.</span></div>","author":"Jeremy Lawrence","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_245497","type":"fbcomment","data":{"text":"<div class=\"comment_text\">As a Sony pro I will say that it’s the camera for me. Travel on the bike the A6500 series would be compact easy and great to take along . The A7 series are bigger so might be too big for Bikepacking</div>","author":"Aydin Odyakmaz","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_508002","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Aydin Odyakmaz\"> what lenses would you recommend?</span></div>","author":"Moinudin Gallotta","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_854546","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Moinudin Gallotta\"> I would just do the kit lens which works well. I don’t have one but I did and it was quite good.</span></div>","author":"Aydin Odyakmaz","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_371576","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Definitely recommend the Fuji xt30</div>","author":"Joshua Kian","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_883486","type":"fbcomment","data":{"text":"<div class=\"comment_text\">LUMIX TZ 700 perfect, Compact, incredible zoom, Automatic mode covers most shots, Sony app lets you use camera remote, Has wi-fi so downloading images is a doddle.</div>","author":"Darrin Bastin","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_687386","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I use the powershot sx720 hs</div>","author":"Edgnar Snowdon","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}