{"time":1657814185623,"version":"2.23.2","blocks":[{"id":"id_478206","type":"header","data":{"text":"Which Handlebar Satellite Navigation Device for Bike Touring?","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_61642","type":"paragraph","data":{"text":"<i>hello everyone...\nI'm a seasoned cyclist, during my whole life... Mtb single-track mostly\nhowever not as tech savvy as some...\nI want to ask what handlebar \"satnav\" device do people use, recommend...\n I usually refer to my phone !\nI like \"cycle travel\" UK website routes etc but have stumbled into komoot as well...\n\ndo I use my phone or a garmin ?? \nmy picture is me doing the mid wales Radnor ring trip this spring...on my new thorn nomad bike.... I plan to do big world trips as I ease up on work .....<div class=\"post_attachment\"><div class=\"post_photo_attachment\"><img class=\"post_photo_image\" loading=\"lazy\" src=\"/images/community/which-handlebar-satellite-navigation-device-for-bike-touring/image_1657814185_928255918.jpg\" alt=\"\"></div></div></i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_250894","type":"delimiter","data":{}},{"id":"id_100224","type":"fbcomment","data":{"text":"<div class=\"comment_text\">From my experience so far, I would highly recommend you to invest into a good navigation app like Komoot, rather than a Garmin. If your purpose is travelling, this is far better because Garmin maps are sometimes... limited.\nI am now travelling in Turkey, I now use exclusively Komoot, my Garmin remains as a nice decoration and to upload my rides on Strava😅</div>","author":"Robin Vanhoutte","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_410906","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I bought a Garmin Edge Explore to use while touring. A terrible purchase, battery life is rubbish. I complained to Garmin and was told to disable most of the features to prolong the battery life. Gave up with it for route planning, use it for pace and distance only.</div>","author":"Sean Alger","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_222865","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Sean Alger\"> the garmin explore is entry level. if you make bike trips should get the Edge 1030 Plus or the new 1040 because it lasts much longer. The edge 1030 plus you have 25 hours and the new 1040 it is 35 hours.</span></div>","author":"Aydin Ürgen","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_85941","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I have the Edge 1030, great bit of kit and battery life of about 20 ish hours, I use it for navigation, load the route and switch it to cycle computer makes the battery last longer, it automatically switches to maps as you approach a junction, then back when you've turned.</div>","author":"Chris Pine","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_722923","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Sean Alger\"> yes, I'm disappointed with mine also!</span></div>","author":"Rick Rich Walters","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_186386","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Hi to all people above. I have the 830 and used it to ride across the country. Overall, I was dissatisfied due to its inconsistency. I seemed to take a long time to find the signal. When I would intentionally go off course to make a stop, maybe just a 100 yards or so,  and then resume, it would keep telling me that I am off course while knowing full well that I was on course. Eventually, it would catch up. This was very frustrating. When it did tell me I was off course I always stopped and checked a map or Google Maps to verify that I was off course. When in battery saver mode it seemed to last all day. It does charge quickly. Does the 1030 seem temperamental? I rode with someone with a Wahoo Bolt and it was solid. Comments welcome.</div>","author":"Scott Bowers","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_596981","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Sean Alger\"> if it has sleep mode, easy to switch on then it will last. Im on a RTW trip and rarely use more than 5% of battery life on a typical day of between 40 to 70 miles.</span></div>","author":"Debs Mutton","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_992655","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I plan my trip in Komoot app and then i load into Garmin Edge 830. I feel confortable with this setup and i dont complain about battery life.</div>","author":"Gonçalo Santos","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_232429","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Gonçalo Santos\"> i use same ... komoot can sometimes lead us weird places but I believe thay all csn ... i pay for premium</span></div>","author":"Sue Urbaniak","gender":"FEMALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_205330","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I had a Garmin Edge 800 I used in multiple trips. But battery life was about 8 hours. And I had several days I had to plug in Powerpack to keep it charged up to last longer  \n\nAnd last trip it had some issues navigating. So I just used my phone and found it much better.\nAt first I used my RidewithGPS files I to Google Maps. \n\nBut because I was almost using roads exclusively I just used Google maps directly.\n\nNever had any issues going from Tallinn to Odessa.</div>","author":"Duane Taylor","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_847182","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I always carry a map as backup in case my old Garmin fails, gets lost or stolen.</div>","author":"Clyde Slade","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_575606","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I plan in Kamoot, and it's connected with my Hammerhead Karoo GPS unit.\n\nIf the Karoo is connected to the Internet (I make my phone WiFi hotspot) it pulls the information about the planned route from Kamoot. Karoo also has an option of downloading the maps of an area, which I do for the area I cycle in.\nThen I use the Karoo in offline mode, and it gives me Kamoot route and options of rerouting.\n\nI love the unit as it has a very good heigh map and climbing screen which shows me the gradient (current and every 200-300m in the next kilometar), and  how long is the climb (eg it says 2km/150m, so I know I'll have to climb 150m in the next 2 km - 7.5% average gradient)</div>","author":"Stipe Stajp Predanic","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_974904","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Stipe Stajp Predanic\"> - seriously considering buying the hammerhead for navigation. How do you find the battery life ?</span></div>","author":"Adrian Camm","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_692234","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Adrian Camm\"> I have v1 so cannot say how current V2 is holding. There is a FB group which can answer that.\nMy 3 years old V1 uses 7-8% of battery per hour (I tend to turn on auto pause so on tours the whole day is one ride and I don't worry about stopping it) when no additional sensors is used, up to 11-12% with heart rate and cadence sensors. Screen is at minimum or in the first 25%, even on that settings it can be read on direct sunlight without a problem.\nAnd as I take stops at least every 2 hours (I usually something interesting enough to take a photo), I plug in the powerbank for 10-15 minutes. Had it up to 15 hours (with sensors) in a day that way without a problem.</span></div>","author":"Stipe Stajp Predanic","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_91510","type":"fbcomment","data":{"text":"<div class=\"comment_text\">thx</div>","author":"Adrian Camm","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_419209","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Adrian Camm\"> I have a v2 (and love it), get around 10 hours without the battery save mode on.\n\nThe screen is so good you can easily work out where you’re going and where other paths are nearby.</span></div>","author":"John Ioannou","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_183258","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Having a dedicated head unit like a Garmin is a good idea. I have nearly cooked an iPhone using it for nav. Mobile phone processors are not really designed for nav, they over work and overheat. If you are going to use a phone it is best to only look at it when you think you need to change direction, then shut the screen down. \n\nYou can get some apps that allow off line navigation, but again screen time gobbles up battery.\n\nI use a Garmin Edge 520 Plus. This is a very compact unit and is one of Garmin's cheaper options. Be aware the 520 Plus have mapping the 520 standard does not. Battery life running navigation is about 8 hours. Just using the device as a bike computer gives about 15 hours.\n\nFor route planning I use the free versions of either Ridewithgps or Komoot, and then export the route to my Garmin. The easiest is to route plan on a PC/laptop and then transfer. Both RWGPS and Komoot have phone apps to, but I have not used them for route planning yet. There are tutorials on youtube on how to easily transfer routes to your Garmin.</div>","author":"Mark Perry","gender":"UNKNOWN","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_327280","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I've used a garmin for years, I have had 2 Garmin 830s and used them all over the UK and Europe. \nThe Garmin software is less user friendly that other brands I hear but I've always found it OK. \nMy newer 830 will easily do over 250k on a battery, I used it to 200k and still had 38% left.</div>","author":"Sam Minett-Smith","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_280621","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I am doing at this moment a trip in Portugal, Spain,  France and Italy and all I use is Komoot. I use it for everything. To plan and to guide me along the route. I like the versatility of it, of being able to take and change it on the move. For me it was the best choice. I still have my GPS devices at home like Garmin and Wahoo but I don't see a need to use it anymore. These phones now a days do everything. I just take a power bank with me that I use once a day and recharge it at night. The simplest the better.</div>","author":"Rafael Nacif","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_965200","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Rafael Nacif\"> same as me best one!!</span></div>","author":"Ovidiu Suculiuc","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_247806","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Komoot reaaaally drains your phone atleast…</div>","author":"Anne Bryn","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_207203","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I used to use my phone but using navigation, strava etc drained it quite quickly. I bought myself an ancient Garmin Edge 705 a month or so ago and replaced the battery in it and it has made cycle trips so much better. Best £60 I've spent. I usually load routes from cycle travel onto it as well.\n\nThe only feature I wish it has is bluetooth uploading to Strava but its still very good</div>","author":"Adam Bennett","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_878796","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I use a Garmin. I save my phone battery for emergencies.</div>","author":"Geoffrey Silverstein","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_826237","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I love my Garmin Edge 1030. Battery life is fine (3ish days 8-10 hours a day) but I added a Garmin Charge and if both devices are charged before I leave they’ll last two weeks without needed charged again. Bright screen. Easy to read. Quick feedback.</div>","author":"Ty Dawley","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_634517","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Komoot plus lezyne mega c. Long battery life, small and affordable</div>","author":"Eric Buysman","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_135730","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Cheapest option is Komoot on your phone and a power pack adding charge to your phone.  Works very well.</div>","author":"James McBride","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_885564","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I've been going through the same process as you.  I started with an android phone but fried it in Madrid's hot sun. I did a post on thus site a couple of weeks back.  I'm about to buy a wahoo elemnt roam.  What I learnt.   \nWahoo has free world wide maps  maps.  Garmin provide maps in the region to you are in.\nKamoot has a free version, but you have to pay to get access to the premium cycle package and to have kamoot offline and also to export files.  I been using OSMAND for route planning and will continue to do so.  OSMAND lets you plan car routes avoiding motorways and other major roads. This has been great at times as bike mode and kamoot create some funky routes.\nThe wahoo has buttons not touch screen from what I've read it's therefore better in the rain. Wahoos display is meant to be easier to read in bright sun.  In my posts others recommended cycle.travel for route planning. It looks awesome for UK and Europe where I'm currently to touring!!! You can download routes to be transferred to GPS or other apps. Hope that helps.</div>","author":"Julie Williams","gender":"UNKNOWN","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_80914","type":"fbcomment","data":{"text":"<div class=\"comment_text\">As someone else says, Komoot and Wahoo Elemnt Roam. Once you've uploaded the Komoot route to the Wahoo, an advantage is the battery life of the Wahoo Elemnt Roam.</div>","author":"Greg Harvey","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_54126","type":"fbcomment","data":{"text":"<div class=\"comment_text\">AllTrails is good for plotting off road routes</div>","author":"Barnaby Taylor","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_561290","type":"fbcomment","data":{"text":"<div class=\"comment_text\">CHEERS EVERYONE, REALLY APPRECIATED...\nLOTS TO RESEARCH ...</div>","author":"Jamie Trader","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_991642","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jamie Trader\">, Garmin 830 and up now support the Komoot IQ app</span></div>","author":"Simon Hope","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_332241","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Jamie Trader\"> do you know Wikiloc? There are thoussans of routes , check a while!!</span></div>","author":"David Gimenez","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_600709","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Just used Komoot and my phone to cross the UK.  It was great.</div>","author":"Scott Hyman","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_409272","type":"fbcomment","data":{"text":"<div class=\"comment_text\">We use the combination of Komoot and Wahoo ROAM. This works perfect. But charging the wahoo every day is something you need to take in account.</div>","author":"Wim Broens","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_119472","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I really like a paper map on top of bar bag, even if it's 1: million as it give me flavour of where we are. Homework on Komoot as it seems really accurate regards height gain. MapsMe on phone (out of bar bag) for checking position and route through the day - especially great as it will work offline. Elevation I go on Maps.Me not accurate and likely to lead to tears.</div>","author":"James Hall","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_721342","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Definitely Komoot. Plan your route and store offline. Start navigating and then put your phone on airplane mode and I can go about 70 km before needing to plug in my battery pack to my phone. I’ve done this through about 18 European countries and it’s been a great system.</div>","author":"Sally Dinham Scott","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_740517","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I think Komoot is one of the best.. I olso have komoot premium and is lovley!!!</div>","author":"Ovidiu Suculiuc","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_205673","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Garmin Edge 1030 with UK Ordnance Survey mapping, outside of UK or even Europe I download the relevant open source cycle maps (free). Sometimes for final mile I’ll use phone to get to a campsite or Airbnb. I route with a variety of services but find an already completed route is always better than a computer generated. RideWithGPS is great, I convert to Garmin on Connect website and sync to device. By only using the line of your route on the map to guide you (called a crumb trail) versus “turn by turn routing” (think car sat nav style) the battery lasts for multiple days of routing and recording. When you’ve done a good route share it back to the community via Garmin or STRAVA or Komoot or with RideWithGPS.  Google maps (on cycle routing option) is a good final mile or last resort.</div>","author":"Nigel Clark","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_645594","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Looking good. \nAll the best for your travels. 🚲</div>","author":"Sue Hope","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_667322","type":"fbcomment","data":{"text":"<div class=\"comment_text\">komoot for planing, wahoo elemnt bolt for navigation.\n\nit´s such a nice picture! all joy!</div>","author":"Ste Ierace","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_682108","type":"fbcomment","data":{"text":"<div class=\"comment_text\">hello, does anyone have any idea about South America bike routes and the safety tips traveling from US south?</div>","author":"Darius Sotoudeh","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_796489","type":"fbcomment","data":{"text":"<div class=\"comment_text\">good luck go life is very short enjoy yourself</div>","author":"Tinosamqilla Tinosamqilla","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_580973","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I use a Hammerhead Karoo 2, great device and the screen is great! Get around 10 hours battery life and can upload routes on the fly with web links (ie Kokoot) when out and about.</div>","author":"John Ioannou","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_303819","type":"fbcomment","data":{"text":"<div class=\"comment_text\">How are you finding the bike Jamie? I’m just moving across from mtb and looking at some longer road rides</div>","author":"Doug McDill","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_225667","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Great question...I'm a seasoned cyclist but not tech savvy and having this conversation today</div>","author":"Ben Smith","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_139868","type":"fbcomment","data":{"text":"<div class=\"comment_text\">We like Komoot on phone with screen turned off unless you need it...still get commands but preserves battery life. One less thing to charge....but we have a charge bank as back up</div>","author":"Debbie Marriott","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_529418","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I'm also a Kamoot user. I recently bought an Edge and also found the battery life short. But it is better with the battery saver turned on, over 8 hours. The screen is reasonably visible and I don't want to mount my phone on the bars so I'm going to stick with it. I like the way it beeps to warn you that a turn is coming up. It's also very easy to transfer GPX file from the phone to the Edge. It cost just under €200 which was much less than other options.</div>","author":"Mark Smith","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_375197","type":"fbcomment","data":{"text":"<div class=\"comment_text\">That looks like the South downs Jamie. Am I right?</div>","author":"Pete Lushington","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_922154","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I pride myself on looking at a map and remembering the route.\nA couple of years ago I cycled 40 km out of Berlin only to come to a sign pointing the direction I was heading that said, Berlin 7km.\nI now use Kamoot on my phone.</div>","author":"Gary Smith","gender":"UNKNOWN","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_442605","type":"fbcomment","data":{"text":"<div class=\"comment_text\">MapOut, in my IPhone. Perfect off-line, accept your gpx files from anywhere. Great job in Japan.</div>","author":"Roberto Cunha","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_908626","type":"fbcomment","data":{"text":"<div class=\"comment_text\">We have just ridden 3000 km in 3.5 weeks, using Hammerhead gps (great system, battery was pretty good up to 8 hours - then I would plug it in to my battery pack).  Mapping we use ride with GPS and upload onto the hammerhead - but also used the hammerhead for when we deviated - it would offer suggestions.  Very happy.  PReviously we only ever used Garmin - but Hammerhead is far better.  We had a mobile phone with us - but we keep that fully charged for any emergencies.</div>","author":"Sharron Yaxley","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_583274","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Elent Bolt with komoot is bomb proof.</div>","author":"Richard Ham","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_630669","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Komoot, or RidewithGPS, either on my Android phone. Either in back pocket or in cross-bar mounted pouch, screen off just shouting directions.</div>","author":"David Sreeves","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_755208","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I quite like MapOut. I can use it offline.</div>","author":"Gary Pinnegar","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_422263","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Beeline</div>","author":"David Collin","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_827963","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Cycle travel to find the best traffic free/friendly route (paved), then download and transfer to Komoot for onboard satnav. I always take a battery back up for longer days in the saddle. I also always switch to low power mode and rely on voice directions from Komoot to save phone battery power.</div>","author":"Martin Clark","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_329658","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Helmet?</div>","author":"Bill Cranston","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_480034","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Seasoned. Like with pepper?</div>","author":"R.H. Southcott","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_967274","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I use a Garmin Touring. It’s excellent.</div>","author":"Taniya Morris","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_152656","type":"fbcomment","data":{"text":"<div class=\"comment_text\">What a fantastic thread,  thanks for asking the question and thanks everyone for your input.\n\n(<span class=\"ce-fbcomment-quote\" data-quote=\"Cam Wood\">, here it is)</span></div>","author":"Cath Wood","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_780596","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Both. For uncivilized areas a dedicated gps is  indispensable.  With two AA batteries, I can make mine last for about 20 hours of active duty which translates to about a week.</div>","author":"Anders Hansen","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_726358","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I have Garmin Edge 830. Phone works in the beginning but with a longer ride, battery issue becomes a problem if the screen is on all the time. Plus heat is a huge problem if the sun is out.</div>","author":"Chae An","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_210245","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Hammerhead or a wahoo element bolt v2 are great options.</div>","author":"Scott Jones","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_706141","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Beeline</div>","author":"Kev Day","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_307698","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I have used the GAIA GPS app to ride and hike on five continents and I highly recommend it. \nAll smart phones have a GPS chip on them and you don’t need a mobile phone (cellular) connection to use your phone as a GPS when using an app such as GAIA, Komoot etc. \nYou can down load maps and plan your routes when on-line and then go onto Airplane mode when navigating and recording your route. This way your battery should last all day (depending on its type/age). Of course take a spare phone and paper map as back up.</div>","author":"Martin Jenkins","gender":"UNKNOWN","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_21682","type":"fbcomment","data":{"text":"<div class=\"comment_text\">We are riding around the world. Komoot tho not perfect is near so. Uk cycle. Travel fantastic. Not tried it anyway else. Always look over the route and check on street view if uncertain. Good luck.\n<a href=\"http://Debsandtom.com/\" target=\"_blank\" rel=\"nofollow\">Debsandtom.com</a></div><div class=\"comment_attachment\"><div class=\"link-tool\"><a class=\"link-tool__content link-tool__content--rendered\" target=\"_blank\" rel=\"nofollow\" href=\"https://l.facebook.com/l.php?u=http%3A%2F%2Fdebsandtom.com%2F&amp;h=AT3LEVv4VTomtS8nEQBijcfFZxfvBz_HWshmkAJmc3zBaAwY549qWuBO5A0DRpmasLTiwN_V_xMKsEQftRBGEkg9GKofuAlTZFWgkxKrPSsLkI8KdMC0SZf1E8j5iq2mrKmm9cDtjQ6fseGOm5RoNUnp0qdDPtSpUTA&amp;s=1\"><div class=\"link-tool__title\">Debs and Tom cycle the world</div><span class=\"link-tool__anchor truncate\">debsandtom.com</span></a></div></div>","author":"Debs Mutton","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}