{"time":1657972005333,"version":"2.23.2","blocks":[{"id":"id_998974","type":"header","data":{"text":"Why Should I Use Garmin or Wahoo Instead of my iPhone?","level":1},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_656835","type":"paragraph","data":{"text":"<i>Hope you'll pardon another newbie question...I am a modestly experienced rider, but have yet to do any multi-day touring trips, though have a few planned in the next 2 months and am excited about them. My question is about the cockpit and iPhone vs a Garmin or Wahoo product. In all my riding thus far, I am happy with my iPhone mounted on my quadlock using ridewithgps app and my varia. \nWhat additional functionality would a Garmin Edge or Wahoo Element give me? Thanks for any input.....</i>"},"tunes":{"AlignmentBlockTune":{"alignment":"center"}}},{"id":"id_209421","type":"delimiter","data":{}},{"id":"id_276404","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Really just battery life &amp; sparing battery drain on your phone.</div>","author":"Will Taylor","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_720711","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Will Taylor\"> i agree. Also maybe in rainy days you will avoid humidity problems with your phone.\n\nBut really I don't think they are worth it. At least not if you are not touring in the middle of nowhere with no human life for miles and miles.</span></div>","author":"Parsa Jazni","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_71074","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I use an android phone in airplane mode (to save battery - can turn on cell service when needed, also use this as a wireless hotspot) running offline mapping /GPS software- OSMAnd &amp; a few alternates for navigation &amp; POIs (ACA’s bicycle route navigator, Komoot, maps.me, ride with GPS, Mapy.cz, google maps offline) &amp; a Hammerhead Karoo 2.  I like the large screen on the phone for maps.  The phone with cell service toggled on also serves for Warmshowers &amp; other services en route.  Tho a diehard Apple aficionado, android excels for the navigation apps.</div>","author":"Will Taylor","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_501503","type":"fbcomment","data":{"text":"<div class=\"comment_text\">A Loksac bag or Topeak phone dry bag keeps the phone dry in rain.  I carry a few powerbanks to recharge devices &amp; keep these charged with voltaic systems solar charging systems.  (I ride a recumbent trike, so can carry massive amounts of kulch).</div>","author":"Will Taylor","gender":"MALE","level":"2"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_710794","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I use it as a backup to the iPhone.  Don’t always have internet cot cell signal.  I also like the incident alert and live tracking feature for safety as most of my touring is solo.  I got the 1030 plus but wish I’d known the 1040 was coming out…</div>","author":"John Goldman","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_605535","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I had a Garmin, the a hammerhead karoo.  They work..so does my phone.  Then I realized I spent too much time on that and not enough time enjoying the ride.  My knockoff Fitbit tells me if my heart rate gets too high. I have paper written turns in my handlebar bag if needed.  It works better for me</div>","author":"Andrew Hill","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_326266","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I have my phone for communication,and music, and let the bike computer do GPS, keep stats and I can monitor my cadence.  It syncs with the apps on my phone.  I’m no expert though.</div>","author":"Diane Farley","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_952979","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I'm.not a tech guy. I have a cheapo little computer thong that tells me how fast I'm riding and how far and how long, and allegedy how many calories I burn. I get my route printed off my daughter's computer '( again, not a tech guy) and carry a notebook size road atlas. My cell phone is my backup and communication dource.</div>","author":"Andrew Guinn Patten","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_141821","type":"fbcomment","data":{"text":"<div class=\"comment_text\"><span class=\"ce-fbcomment-quote\" data-quote=\"Andrew Guinn Patten\"> yup, good old simple bike computer for distance and average speed, batteries last for months...  and paper map... relying on Garmin or phone triggers a whole chain of things that become weight and risks...   To charge it you need a power bank..  to charge the power bank you need a generator hub... To get the generator hub you need to buy it and build a wheel around it....</span></div>","author":"Peter Harger","gender":"MALE","level":"1"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_654772","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I tried using my phone to record my rides and it killed the battery before I was done every time (and I always had data turned off).  I bought a Garmin 810 then, in 2013, because it had mapping functionality and my phone would still have some juice if I actually needed it for anything. I just replaced the Garmin with an 830 as I’m happy with my system.</div>","author":"Jacquie Gaudet","gender":"UNKNOWN","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_838623","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I added the Garmin 1030 Plus as I was killing iPhone batteries too fast. Both have their place.</div>","author":"Jeff Osborn","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_496043","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I have a cheap phone with limited apps for talk/text. I have my old Samsung for camera, nav apps and music. It saves me from burning through batteries. I have battery banks that also help. The $$ bike computers are greeat if you need them for a specific reason, but otherwise they are not any more \"useful\" than a phone app.</div>","author":"Roy Onabike","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_3600","type":"fbcomment","data":{"text":"<div class=\"comment_text\">The battery issue is what made me mostly navigate with a Wahoo ELEMNT roam. A few times when I really needed my cell in an emergency I was low on battery. Bad feeling.</div>","author":"Anita Valencia Bozzo","gender":"FEMALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_694700","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Nice topic. People used to  cycle far without the electronics stuff. But GPS navigation is so nice. I have tried numerous things with my phone to navigate cycling without a map, does not work well, can't see the screen or hear the instructions. Tried blootooth ear buds, tried special holder bag on top tube, just does not work for me. \nMy Garmin watch is fantastic, but for general use, but serious cycling it probably just won't be as good as a cycling specific unit.</div>","author":"Brian Alexander Langton","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_23753","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Maps and my phone for when I get lost in towns normallly</div>","author":"John Axson","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_711223","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I use a phone, but don’t always have it “open”. I like the flexibility of replanning routes - even with no connectivity if you download maps with things like Komoot or even google maps. My iPhone will last all day even if I’m regularly opening to look when I want or need (enjoy the scenery!), and carry an Anker battery it the top tube bag - it is awesome.</div>","author":"Oliver Parsons","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_983860","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I use Wahoo elmnt roam also komoot and Google maps on my phone phone as back up</div>","author":"Peter Tomlin","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_312544","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Garmin has good battery life, keep the phone in pockets in case you need to reach someone (would apply to wahoo as well to be fair)</div>","author":"Pierre Vannier","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_472091","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Battery life would be the one. My phone sucks battery life (android) even when plugged into my dynamo unless I put it in flight mode. Hence I use my garmin 810 which lasts all day, phone on flight mode and charge my battery pack via the dynamo during the day (ready to use in camp)\nHappy touring 🤘🚴🏕️</div>","author":"Mark Randlesome","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_300867","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I have used a Garmin product for the past 15 years....designed for the bike...I tend to store the phone in the off position...</div>","author":"Martin Fano","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_56942","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I use a Wahoo ELEMNT Bolt for all my riding , good battery life , syncs with all my apps</div>","author":"Joe Marganski","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_419510","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Wahoo or garmin (I use garmin). You want to save your phone battery for communications and not have it on your handlebar in case you go down</div>","author":"Guy Smallwood","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_347974","type":"fbcomment","data":{"text":"<div class=\"comment_text\">Battery life has been the biggest reason I stopped navigating with iPhone. And charging the phone is problematic in the rain. Also the touch screen is hard to operate in the rain and kind of goes berserk. In ideal conditions it’s a non-issue, but touring sometimes requires riding in less than ideal conditions and the iPhones have let me down too many times</div>","author":"Brent Langlinais","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}},{"id":"id_294650","type":"fbcomment","data":{"text":"<div class=\"comment_text\">I use an iPhone and yes, the battery life sucks. I bought a SKS phone holder and storage compartment when we traveled in Europe. Worked so well I got one for my road bike. Plenty of room for a spare battery, which solves the battery drain issue. All the wiring remains inside the case so no issues with rain.</div>","author":"Chad Jane Hainline","gender":"MALE","level":"0"},"tunes":{"AlignmentBlockTune":{"alignment":"left"}}}]}