{
  "time": 1658131767233,
  "blocks": [
    {
      "id": "nRFbbTLm-1",
      "type": "header",
      "data": {
        "text": "Best Type of Bicycle for Long-Distance Bike Touring",
        "level": 1
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "N5Q2qvyDuj",
      "type": "paragraph",
      "data": {
        "text": "<i>A mountain bike for touring? Perhaps a top-shelf touring bike? Touring with a carbon road bike? Maybe a recumbent bicycle is the best? A hybrid bike? Yes, anything will do, but...</i>"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "center"
        }
      }
    },
    {
      "id": "LrJabra3Iu",
      "type": "image",
      "data": {
        "file": {
          "url": "/images/learn/bicycle-for-touring/1652517052_image.jpg",
          "name": "1652517052_image.jpg",
          "size": 639048,
          "extension": "jpg"
        },
        "caption": "",
        "withBorder": false,
        "stretched": false,
        "withBackground": false
      }
    },
    {
      "id": "-tV8h1Am2_",
      "type": "header",
      "data": {
        "text": "Features of a Good Bicycle for Long-Distance Touring",
        "level": 2
      }
    },
    {
      "id": "CpS4-wm0Zk",
      "type": "paragraph",
      "data": {
        "text": "When I consider a bike I think of the three most important criteria that surround a successful touring bike."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "I7ZdGQJsl6",
      "type": "paragraph",
      "data": {
        "text": "For me these three criteria are:"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "I6pqfpr2ET",
      "type": "list",
      "data": {
        "style": "unordered",
        "items": [
          {
            "content": "Proper fit",
            "items": []
          },
          {
            "content": "Ability to handle the terrain",
            "items": []
          },
          {
            "content": "Carrying capacity",
            "items": []
          }
        ]
      }
    },
    {
      "id": "4Xqa9BUET7",
      "type": "header",
      "data": {
        "text": "Proper Fit of the Bicycle",
        "level": 3
      }
    },
    {
      "id": "w--fkpSJ2c",
      "type": "paragraph",
      "data": {
        "text": "“Fit” is absolutely and without a doubt the key one in this list of important criteria. You are going to spend lots of time on the bike and how comfortable you are on this bike will go a long, long way towards how successful your tour is."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "jzlb-wfs4I",
      "type": "paragraph",
      "data": {
        "text": "Rather than trying to “make something work” spend the time upfront on finding a bike that fits you properly and allows you to ride <b>without pain</b>. There are many styles of bikes to choose from including traditional upright bikes and recumbents.&nbsp;"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "xz4aj8xB4N",
      "type": "paragraph",
      "data": {
        "text": "Don’t be afraid to get out there and look at a bunch of different bikes in local and near-local bike shops. If you see a bike that interests you then ask for permission to take it for a test ride."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "am5ruSjyI9",
      "type": "paragraph",
      "data": {
        "text": "Consider contacting local bicycle clubs to see if anyone locally has a bike of the type you are considering. You may not get to ride the bike but many people don’t mind helping you out by showing off their bikes!"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "EwVzIyoF0I",
      "type": "paragraph",
      "data": {
        "text": "<b>People have ridden around the world using bikes of all kinds, including unicycles, racing road bikes, mountain bikes, purpose-built touring bikes, and various recumbents.</b>"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "-FNve7Eu9X",
      "type": "paragraph",
      "data": {
        "text": "While all of these bikes were capable of being ridden to the tour's completion it is essential to think of two other very important factors that come into play when you think of the bike."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "m4xDRnLBMm",
      "type": "paragraph",
      "data": {
        "text": "One method to achieve a proper fit that worked for me personally was to request a “Fit Kit” session at a local bicycle shop. For me, the shop was To Wheels in London, Ontario. I arrived for my fit kit appointment and was measured for a number of things. When the test was complete I answered a few more questions and the result was a series of recommendations for how my bicycle should be set up including saddle and handlebar height to name a few."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "S-gf57S6Vo",
      "type": "paragraph",
      "data": {
        "text": "I encourage you to mention the following needs when having a fit kit session:"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "R-OMhKu0Mc",
      "type": "header",
      "data": {
        "text": "More upright position",
        "level": 4
      }
    },
    {
      "id": "2WPio-F1nN",
      "type": "paragraph",
      "data": {
        "text": "Requirement for a more upright or “see the scenery” type position. This position causes you to be a little less aerodynamic but you have the advantage of being able to look around and see the scenery. If you are using drop bars you can still get lower on those windy days when you need to avoid the wind."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "cNcG_EcjrO",
      "type": "header",
      "data": {
        "text": "It’s for a touring bicycle",
        "level": 4
      }
    },
    {
      "id": "cvUBq0CNYf",
      "type": "paragraph",
      "data": {
        "text": "This is for a&nbsp;touring bicycle&nbsp;where you will be going for long distances regularly and for multiple days. Emphasize that <i>you need to feel very comfortable</i> and not cramped up since the distance and time you spend on the bike one day is likely to also be the amount of time and distance you spend on the bike the next day."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "DE0Rqtz4HO",
      "type": "header",
      "data": {
        "text": "Cycling shoes",
        "level": 4
      }
    },
    {
      "id": "4onXyipxfS",
      "type": "paragraph",
      "data": {
        "text": "Take your cycling shoes with you. This can make a real difference when you are measured for saddle height."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "EaxHVMN-D8",
      "type": "header",
      "data": {
        "text": "Testing float",
        "level": 4
      }
    },
    {
      "id": "mYjEDqyazT",
      "type": "paragraph",
      "data": {
        "text": "If you use clipless pedals there is an additional test that you can take to measure the float setting that you should use for your pedals."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "CUVMuKYlck",
      "type": "header",
      "data": {
        "text": "Wear your helmet",
        "level": 4
      }
    },
    {
      "id": "8aL2MKbLFZ",
      "type": "paragraph",
      "data": {
        "text": "Wear your helmet when you try the sample measurements on a bike. The reason for this isn’t just safety since you will be getting used to new settings but also to allow you to see how much neck bending you have to do to look around on the bike."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "WEZJRd5JnA",
      "type": "header",
      "data": {
        "text": "Ability to Handle the Terrain",
        "level": 3
      }
    },
    {
      "id": "yfpsnOug4H",
      "type": "paragraph",
      "data": {
        "text": "This refers to being able to safely and reasonably easily ride a bike over all of the terrains that a touring route entails. While a <b>lightweight racing bike</b> might be excellent for unloaded riding on smooth, paved roads it would be a very poor choice for riding on technical singletrack in the deep, dark woods especially if that singletrack included roots, rocks, sand and mud. It would also very likely be a poor choice if you needed to carry 100 pounds of gear with you on the bike."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "4Ex5DfVCvd",
      "type": "header",
      "data": {
        "text": "Carrying Capacity of the Bike",
        "level": 3
      }
    },
    {
      "id": "FqSM2DzAT2",
      "type": "paragraph",
      "data": {
        "text": "The bike’s ability to carry weight is also important especially for&nbsp;self-contained/fully loaded touring.&nbsp;<b>Overloading a lightly built frame could lead to a dramatic adventure out on the road.</b>"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "1TEKLsAQXQ",
      "type": "paragraph",
      "data": {
        "text": "Conversely having to pack too lightly for fear of overloading the bike could easily lead to having to leave behind some essential comforts."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "Y8gVBb4Z92",
      "type": "paragraph",
      "data": {
        "text": "Usually, recommendations for a touring bicycle include&nbsp;<b>traditional touring bikes, lightly modified mountain bikes and some types of recumbents.</b>"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "N2sh8b-aHf",
      "type": "paragraph",
      "data": {
        "text": "Traditional touring and mountain bikes can usually handle rough terrain and carry a significant load as well. Then again there have been many instances of lightweight racing bicycles being used for long-distance SAG wagon touring."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "g5voek-LQr",
      "type": "paragraph",
      "data": {
        "text": "I will follow up with some additional information on the various types of bicycles and bicycle-related equipment in the sections that follow."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "QIoQww-67y",
      "type": "header",
      "data": {
        "text": "Common Considerations when Choosing a Bicycle for Touring",
        "level": 2
      }
    },
    {
      "id": "2gXxKDJyc5",
      "type": "paragraph",
      "data": {
        "text": "All touring bikes seem to have several considerations in common. Before I discuss the specifics of each type of bike I would like to discuss these common considerations first."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "qL4nz2dLUz",
      "type": "paragraph",
      "data": {
        "text": "Here they are:"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "OZg3mrfRnj",
      "type": "list",
      "data": {
        "style": "unordered",
        "items": [
          {
            "content": "Load carrying capacity",
            "items": []
          },
          {
            "content": "Mounting points for fenders and racks",
            "items": []
          },
          {
            "content": "Low gearing",
            "items": []
          },
          {
            "content": "Reliable components",
            "items": []
          },
          {
            "content": "Water bottle holder",
            "items": []
          }
        ]
      }
    },
    {
      "id": "ssI78ysKp8",
      "type": "paragraph",
      "data": {
        "text": "The next few sections will discuss each of these items in more detail. Please remember that whatever bike you choose it’s important that it have a good fit! A great bike but a poor fit is very likely to lead to an awful tour!"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "-eqH6oeOiS",
      "type": "header",
      "data": {
        "text": "Load carrying capacity",
        "level": 3
      }
    },
    {
      "id": "VT0CElFWlo",
      "type": "paragraph",
      "data": {
        "text": "When you load up the bike with 50 - 100 pounds of weight and go for a ride around the block how well does it handle it?"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "jPpKN65yWL",
      "type": "paragraph",
      "data": {
        "text": "I currently use a Trek 520 for my loaded touring bicycle. I feel like&nbsp;my bike rides better fully loaded&nbsp;than it does with no load at all. The frame is made with carrying a load in mind and I think that it shows in the ride."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "g0Q2lT2WP3",
      "type": "paragraph",
      "data": {
        "text": "If you do the test and find that the bike feels shaky then perhaps it’s time to consider a different bike. Before you get too upset though you might consider&nbsp;towing a trailer behind your bike&nbsp;instead. A trailer introduces other issues that will be discussed in the trailer section but it is something to consider."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "QpUdzEQ4_J",
      "type": "paragraph",
      "data": {
        "text": "You might be considering just ignoring the shakes and jitters. Please keep in mind that any problems you notice now riding around at normal speeds will be even worse when your speed is either blazing fast like during a downhill or incredibly slow like you would experience during a steep climb."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "2Bv3wPQ8nI",
      "type": "paragraph",
      "data": {
        "text": "If you aren’t sure then carefully do a bit more trial riding or consider getting a second opinion from some knowledgable cyclists. The last thing you want to do is experience <b>a high-speed shimmy while descending a mountain at 60+ km/hour!</b>"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "kpzE4-xLDH",
      "type": "header",
      "data": {
        "text": "Mounting points for fenders and racks",
        "level": 3
      }
    },
    {
      "id": "65eAj3xraY",
      "type": "paragraph",
      "data": {
        "text": "Unless you decide to use a trailer (and sometimes even then) you will need to have a place to put your gear."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "VnmqAI-uyW",
      "type": "paragraph",
      "data": {
        "text": "Sometimes people start a tour <b>using a backpack</b> or something similar to carry the load. The vast majority of these people quickly change to&nbsp;saddlebags or trailers&nbsp;before a long-distance trip has ended. While a backpack can certainly hold lots of stuff most people find them hot to wear on the back and uncomfortable."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "ZwQWXAqcs6",
      "type": "paragraph",
      "data": {
        "text": "This leaves you with the option of a trailer or racks and saddlebags. In order to use racks, you have to be able to mount them on the bike. To do this there are usually items called braze-ons. Mounting a rack to these is generally quite easy to do."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "yPrvS6ItPn",
      "type": "paragraph",
      "data": {
        "text": "Sometimes light racing bikes are used for lightly loaded or SAG touring and the cyclist wants a rack despite the lack of braze-ons. For light loads, there are clips that you can get to allow you to mount a rack on these bikes. Usually, the amount of weight that you can carry is greatly reduced from the amount that you would normally be allowed to carry with the same rack."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "fq8z1QG6bx",
      "type": "paragraph",
      "data": {
        "text": "Another use for braze-ons is to mount front and rear fenders on your bike. Back when I was a kid I can remember always removing the fenders from any bike that came my way with them. I used to think that they lacked a certain something."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "OQ3JajpxMO",
      "type": "paragraph",
      "data": {
        "text": "Now that I’ve grown up I love fenders and I have them permanently mounted on all of my bikes. Why the change you ask?"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "4rGgmg2S55",
      "type": "paragraph",
      "data": {
        "text": "<b>Fenders protect the bike, the gear and me from spraying water.</b> Most tours that I’ve been on have included at least one day with some rain. The great increase in comfort during those days far outweighs the slight weight gain especially when you consider that the fenders are also protecting your nice dry sleeping bag!"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "cLUqzsqqCy",
      "type": "header",
      "data": {
        "text": "Low Gearing",
        "level": 3
      }
    },
    {
      "id": "OcqGyBsTd-",
      "type": "paragraph",
      "data": {
        "text": "When you load a bike with tons of cargo it becomes a bit harder to move it up hills. Even riding on flat terrain you will notice that it takes some extra effort to move the&nbsp;fully loaded bike&nbsp;at a reasonable pace over the ground."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "YviKxy-rfG",
      "type": "paragraph",
      "data": {
        "text": "Most bikes come with gearing designed for an unloaded and unencumbered bike. While there are numerous examples in the world of touring of people who have toured successfully there are also many who changed to lower gearing, suffered less and continued touring for many more years without&nbsp;gearing related injuries."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "QclgvelM4N",
      "type": "paragraph",
      "data": {
        "text": "I haven’t yet heard of anyone regretting carrying lower gears even if they haven’t needed them on a tour but I most certainly have heard people wishing that they did have lower gearing."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "EikVfOs2Ac",
      "type": "paragraph",
      "data": {
        "text": "If you have a choice when selecting a bike pick one with low gearing whenever possible."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "IzRsAtCGul",
      "type": "internal",
      "data": {
        "text": "gear/drivetrain"
      }
    },
    {
      "id": "Rx-moL3xjU",
      "type": "header",
      "data": {
        "text": "Reliable components",
        "level": 3
      }
    },
    {
      "id": "CHkdzQ4ID5",
      "type": "paragraph",
      "data": {
        "text": "<b>Few things can wreck a tour faster than having a critical part disintegrate in the middle of nowhere (Of course some people would argue that minor setbacks like a broken bike provide an extra bit of spice to the&nbsp;adventure of a bicycle tour).</b>"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "M_rmGfS7jF",
      "type": "paragraph",
      "data": {
        "text": "While you don’t necessarily have to have the world’s most expensive bike, it is important that you have a&nbsp;bike with reliable and trustworthy parts."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "tb6cbOeGAd",
      "type": "paragraph",
      "data": {
        "text": "Remember that people have used bikes in various states of readiness to do continent crossing journeys. The difference between a good equipment bike with reliable components and one that is a poorly maintained wreck might come down to the number of flat tires, broken spokes and other failures."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "YSkVQxV0RE",
      "type": "paragraph",
      "data": {
        "text": "It’s your tour. Would you rather relax watching scenery and eating ice cream or fix your bike instead?"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "pxj3WaEx-Q",
      "type": "header",
      "data": {
        "text": "Water bottle holder",
        "level": 3
      }
    },
    {
      "id": "gEtr1nCW69",
      "type": "paragraph",
      "data": {
        "text": "Water is one of the most important things that you need to have when touring. Running out of water while pedalling along can be an unhappy experience!"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "05ix9BPFAW",
      "type": "paragraph",
      "data": {
        "text": "Although there are many ways to carry water on a bike, water bottle holders are one of the most common ways of doing so."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "0L6LnXsLLU",
      "type": "paragraph",
      "data": {
        "text": "Many bikes tend to have two water bottle holders although some mountain bikes only have one and most touring bikes seem to have three."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "Vl7-9xVn4F",
      "type": "paragraph",
      "data": {
        "text": "Water can be carried in other ways including using&nbsp;water bladders and saddlebag pockets so there are workarounds. Still having the ability to carry water on the bike itself is a major plus."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "FQ96KCMVX8",
      "type": "header",
      "data": {
        "text": "Types of Bikes Used for Touring",
        "level": 2
      }
    },
    {
      "id": "OjNrIZwga5",
      "type": "paragraph",
      "data": {
        "text": "As you’ve seen in the last few sections there are numerous types of bicycles that have been used for successful touring."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "pnc18tIqr3",
      "type": "paragraph",
      "data": {
        "text": "This section will discuss each of the types of bikes typically used for touring."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "HS3245z888",
      "type": "paragraph",
      "data": {
        "text": "For the purposes of discussion, I intend to focus on some of the common bicycle types that are used for&nbsp;<b>fully loaded/self-contained bicycle touring.</b> I have decided to focus on this type of touring because I believe that the requirements are more strict for this group than for the other types of touring especially when you consider the carrying capacity requirements needed by this group."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "6KkMgQX9hN",
      "type": "header",
      "data": {
        "text": "Upright/Diamond frame bicycles",
        "level": 3
      }
    },
    {
      "id": "TLMT4R05gj",
      "type": "paragraph",
      "data": {
        "text": "Upright or diamond frame bicycles are the traditional type of bike that most people instantly think of when they hear the word bicycle. Examples of this type of bicycle include lightweight racing bikes, mountain bikes and general-purpose commuting bikes."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "jxVRpH-Gv1",
      "type": "paragraph",
      "data": {
        "text": "Many successful tours have been completed by this kind of bike. When considering an upright bicycle for touring you usually want to consider the following in addition to the info contained in the common considerations section:"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "6SIm9FcdtO",
      "type": "list",
      "data": {
        "style": "unordered",
        "items": [
          {
            "content": "Long chainstays",
            "items": []
          },
          {
            "content": "Handlebars",
            "items": []
          }
        ]
      }
    },
    {
      "id": "koXjCA9Pwv",
      "type": "paragraph",
      "data": {
        "text": "The next few sections will discuss each of these areas."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "N85_84ssEl",
      "type": "header",
      "data": {
        "text": "Long chainstays",
        "level": 5
      }
    },
    {
      "id": "_kdHN9vceT",
      "type": "paragraph",
      "data": {
        "text": "The chainstays are the two pieces of tubing that run from the seat post to the rear axle of the bike. The term \"long chainstays\" is used to describe having more space between the seat tube and the chainstays."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "gbyls3f-kf",
      "type": "paragraph",
      "data": {
        "text": "This is important for bikes that are going to use a&nbsp;rear rack and saddlebags&nbsp;(also called&nbsp;panniers). Longer chainstays allow you to have more room between the back of your foot when it’s on the pedal and the front of your rear saddlebag. Few things are more irritating than striking the saddlebag with your foot each time the pedals turn! Over time you would also wear a hole into the saddlebag."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "ybvo0gGj2a",
      "type": "paragraph",
      "data": {
        "text": "There are workarounds to some degree. You can try to mount the saddlebags further back on the rack. Some racks even come with longer mounting hardware to make this easy to do. The downside is that the more weight you have behind the rear axle the more it affects bicycle handling especially climbing steep hills."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "pe5UBf7Nk0",
      "type": "paragraph",
      "data": {
        "text": "People with smaller feet apparently have fewer problems with this.&nbsp;"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "JeUqrZAHR2",
      "type": "header",
      "data": {
        "text": "Handlebars",
        "level": 5
      }
    },
    {
      "id": "74yTvMyFXM",
      "type": "paragraph",
      "data": {
        "text": "Having a&nbsp;variety of hand positions&nbsp;is one very important consideration to make when trying to select your handlebars. After a period of time, your hands can become restless, numb or even painful unless you have different places to put them."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "czcC52p4BT",
      "type": "paragraph",
      "data": {
        "text": "It’s not just about having a different position but also about being able to change the angles of your hands as they approach the handlebars.&nbsp;Carpal tunnel syndrome&nbsp;is a problem that may affect cyclists. It is thought that hand position on the bike plays a large role in this."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "t6zTGVS7Nw",
      "type": "paragraph",
      "data": {
        "text": "Another thing to think about is your ability to see the world. You are on a bicycle tour after all and possibly you are hoping to see more than just the pavement in front of your face. One way to do this is to have your handlebars mounted higher up. A common guideline seems to be to aim for having the handlebars at the very least, level with the seat."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "gQGvp21ZKr",
      "type": "paragraph",
      "data": {
        "text": "I would be neglectful if I didn’t mention the issue of&nbsp;aerodynamics. At some point, you will experience a day with strong winds. In what seems to be an application of Murphy’s law your route takes you right into the wind!"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "T84jT68bPU",
      "type": "paragraph",
      "data": {
        "text": "In this situation, it’s nice to have a set of handlebars that allows you to get down lower from time to time. While you might not want to stay down low the entire time it’s still nice to know that you have an option!"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "ZAOU7wq6Z2",
      "type": "paragraph",
      "data": {
        "text": "Many people use drop bars on their touring bikes for all the reasons I’ve mentioned above."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "0dOvGnJkR1",
      "type": "paragraph",
      "data": {
        "text": "When considering an upright or diamond frame bicycle common choices seem to include converting a mountain bike or purchasing a touring bike."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "02JOApzYN5",
      "type": "header",
      "data": {
        "text": "Touring bikes",
        "level": 4
      }
    },
    {
      "id": "6abNbAYFyZ",
      "type": "paragraph",
      "data": {
        "text": "Touring bicycles can be purchased new or used. Some bicycles that often receive mention are the following:"
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "4cqfo5zKCx",
      "type": "list",
      "data": {
        "style": "unordered",
        "items": [
          {
            "content": "Surly LHT",
            "items": []
          },
          {
            "content": "Fuji Touring",
            "items": []
          },
          {
            "content": "Trek 520",
            "items": []
          },
          {
            "content": "Cannondale T2000 or T800",
            "items": []
          },
          {
            "content": "Heron",
            "items": []
          },
          {
            "content": "Bruce Gordon",
            "items": []
          },
          {
            "content": "Jamis Aurora",
            "items": []
          }
        ]
      }
    },
    {
      "id": "IIvf1t8Cda",
      "type": "paragraph",
      "data": {
        "text": "This list is by no means complete. As time passes I will continue to update the list with links to other bicycles that should be considered."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "s3IFrjM7sL",
      "type": "header",
      "data": {
        "text": "Mountain bikes as touring bikes",
        "level": 4
      }
    },
    {
      "id": "_IBEj_Ew8X",
      "type": "paragraph",
      "data": {
        "text": "In the past ten years, mountain bikes have been the best selling type of bicycle in North America. Even though only a very low percentage of these bikes are used offroad it’s the perceived features of these bikes that made them such good sellers."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "2hMt5tsawC",
      "type": "paragraph",
      "data": {
        "text": "When sitting on the bike you have a more&nbsp;upright position&nbsp;so you can have a much better view of the road. The&nbsp;wider tires&nbsp;cushion against road shock and the frame is perceived as being much more capable of withstanding abuse."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "MZX6Py-Z3c",
      "type": "paragraph",
      "data": {
        "text": "With all these features it’s not surprising that people have considered&nbsp;using a mountain bike to tour."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "ETtz_0FU2F",
      "type": "paragraph",
      "data": {
        "text": "Surprisingly the easiest bikes to convert for fully loaded touring seem to be the ones that were popular from about 1990 to 1995. These bikes had the upright position, a sturdy frame and wide tires but few came with front suspension shocks. The problem with front suspension shocks is that you need specialized racks to be able to carry front saddlebags on this type of bike. An alternative is to replace the suspension fork with a non-suspension fork especially one with mid-fork braze-ons."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "WuZuDVvon9",
      "type": "paragraph",
      "data": {
        "text": "<b>Many mountain bike tourers complain about how awkward the bike feels when loaded. I suspect that the biggest cause of this is the need to load everything on the rear rack of the bike when you don’t have the option to use front saddlebags.</b> I experienced something similar during my first tour on Trek 520. During that tour, I did not have a front rack or front saddlebags yet so everything was loaded on the rear rack. Climbing hills was harder, especially when the front wheel would lift off the ground from time to time on the steepest grades and the rear wheel certainly appeared to be carrying a lot of weight. From the descriptions, this sounds like the same problem that a lot of mountain bike riders experience."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "JtXwW0J684",
      "type": "paragraph",
      "data": {
        "text": "For those people who really like front racks and front suspension, a company called Old Man Mountain make front racks that work with suspended forks."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "o3sBeE7M9X",
      "type": "header",
      "data": {
        "text": "Multi-rider bikes like tandems, triplets and quads",
        "level": 4
      }
    },
    {
      "id": "M4bNz-R5ED",
      "type": "paragraph",
      "data": {
        "text": "Another exciting way to tour as part of a group is to ride a multi-person bike like a tandem or triplet. These bikes still only have two wheels but instead of having only one rider, several riders are on the same bike at the same time."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "aLkduVQEPJ",
      "type": "paragraph",
      "data": {
        "text": "This kind of bike allows two or more people to work together on the same bike. This means that there’s never a concern about keeping up with each other (and hopefully never a pressing need to get some “space” - grin)."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "Apf1VnQXat",
      "type": "paragraph",
      "data": {
        "text": "Of course, having two people on the same bike means that to some degree you are more limited in the amount of gear that can be carried. Although larger saddlebags are available you still end up with room for only four saddlebags on the bike, a handlebar bag and perhaps a trunk. Some people overcome this to some degree by towing a trailer as well."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "7r7BWgkbrD",
      "type": "paragraph",
      "data": {
        "text": "Tandems have a reputation for being fast rides as well as giving people a real chance to test the strength of their relationship (grin). Still from what I’ve heard many people find riding multi-person bikes to be a very rewarding experience that adds an entirely new element to the touring experience."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "ZNaI88Da6Z",
      "type": "paragraph",
      "data": {
        "text": "One additional tip that I’ve heard is a strong suggestion to get some sort of a lesson about how to ride a tandem or other multi-person bike before setting off on your first tour."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "ixrMeNCU2l",
      "type": "header",
      "data": {
        "text": "Recumbent Bicycles for Touring",
        "level": 3
      }
    },
    {
      "id": "ZysWww-nDC",
      "type": "paragraph",
      "data": {
        "text": "Recumbents have been used for many successful tours. Some of the perceived benefits include a more&nbsp;comfortable ride, a seating position that allows you to see the scenery, greater&nbsp;visibility&nbsp;on the roads, and a better ability to&nbsp;handle headwinds&nbsp;with&nbsp;increased speed."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "4n84UXXIZD",
      "type": "paragraph",
      "data": {
        "text": "The most common disadvantage that I’ve heard has to do with hill climbing abilities. Many recumbents are considered to have more&nbsp;difficulty climbing hills&nbsp;than upright bikes. Some of this could be due to not being able to stand up and put your weight on the pedals when the hill gets steep. Another consideration would be your ability to balance the bike at low speed."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "jhD2B-kauF",
      "type": "paragraph",
      "data": {
        "text": "So many possible positives and a few potential negatives make this an option that should carefully be considered. Be aware that unlike upright bikes there are a huge number of recumbent designs and change is constant for this type of bike. This means that if one recumbent doesn’t work for you it’s probably a good idea to check out a few more designs before deciding against a recumbent completely."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "XU2yugWWHl",
      "type": "header",
      "data": {
        "text": "Touring with Folding Bicycles",
        "level": 3
      }
    },
    {
      "id": "lCwAzKroTd",
      "type": "paragraph",
      "data": {
        "text": "One of the common concerns for tours that don’t leave from the front door of your home is how to get the bike and all of your gear to the starting point. One option is to use a&nbsp;folding bicycle for your tour."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "yywt_kpZ_1",
      "type": "paragraph",
      "data": {
        "text": "A folding bicycle can be easily stored away in a standard-sized box that airlines will accept as normal checked baggage. This means that not only are you saving on potential extra fees for carrying your bike on an airplane but you usually also have the comfort of knowing that your bike is being carried just like any other luggage with fewer worries about the special handling (or lack thereof) that an oversized box or bike bag might receive."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "10HSEue2v6",
      "type": "paragraph",
      "data": {
        "text": "Some bicycles come with a handy case that serves two functions. One of these functions is to carry the bike when travelling. Once at your destination&nbsp;the case turns into a trailer&nbsp;capable of carrying your gear behind the bike."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "zf23g8LCUq",
      "type": "paragraph",
      "data": {
        "text": "Some people are sceptical about the usefulness of these bikes on long tours. As is true with every other type of bicycle listed on this page as well as some that are not, folding bikes have been successfully used to cross major countries and continents."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "AlrD6Ca02Z",
      "type": "header",
      "data": {
        "text": "Touring with Trikes",
        "level": 3
      }
    },
    {
      "id": "GQh9TgteNo",
      "type": "paragraph",
      "data": {
        "text": "A trike is a three-wheeled bicycle. Many of the types used on tour are recumbents, either delta (two wheels at the back and a single wheel at the front) or tadpole (two wheels at the front and a single wheel at the back) type designs."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "mS2CEodeNb",
      "type": "paragraph",
      "data": {
        "text": "The addition of a third wheel is popularly believed to increase rolling resistance but, due to better weight distribution, the rolling resistance of trikes is on par or better than two-wheeled bicycles. Tire selection is critical though."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "2NQapQTJKr",
      "type": "paragraph",
      "data": {
        "text": "Another perceived disadvantage is the need to take up more space on the road and whilst it can lead to tense moments on narrow roads, the larger footprint can also provide better protection in busy traffic and the novelty value causes most road-users to give trikes more respect (and space) than upright bicycles."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "_dF3psQ7yh",
      "type": "paragraph",
      "data": {
        "text": "Trikes have several advantages not least among them is the ability to install low gearing on the bike. Since three wheels make balancing much easier it is possible to keep on pedalling with insanely low gears and eventually&nbsp;make your way up very steep hills."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    },
    {
      "id": "UTWi-duORJ",
      "type": "paragraph",
      "data": {
        "text": "Trikes have been used very successfully on long tours including a 317-day tour from North Carolina to Alaska and back again by Heidi Domeisen."
      },
      "tunes": {
        "AlignmentBlockTune": {
          "alignment": "left"
        }
      }
    }
  ],
  "version": "2.23.2"
}